[{"id": 103, "companies": [533], "cpu": "MOS Technology 6502 @ 1 MHz", "graphics": "monochrome character graphics", "memory": "4–96 KB", "name": "Initial version", "os": "Commodore BASIC 1.0 ~ 4.0", "platform_logo": 543, "platform_version_release_dates": [552], "slug": "initial-version", "sound": "none or beeper", "storage": "cassette tape, 5.25-inch floppy, 8-inch floppy, hard disk", "summary": "The Commodore PET is a line of home/personal computers produced starting in 1977 by Commodore International. The system combined a MOS 6502 microprocessor, Commodore BASIC in read only memory (ROM), a keyboard, a computer monitor and (in early models) a cassette deck for data and program storage in a single all-in-one case.", "url": "https://www.igdb.com/platforms/cpet/version/initial-version", "checksum": "df0a5020-309d-04c9-5368-b2b9244bb6b4"}, {"id": 282, "companies": [527], "name": "Switch Lite", "platform_logo": 534, "platform_version_release_dates": [359], "slug": "switch-lite", "summary": "A smaller version of the Switch, which only supports handheld play. The Joy-Cons are integrated into the main unit, and the four directional buttons are replaced by a more classic D-Pad", "url": "https://www.igdb.com/platforms/switch/version/switch-lite", "checksum": "24097bf5-9bbf-5959-931b-4b87ece75fb8"}, {"id": 139, "companies": [144], "cpu": "Ricoh 5A22 @ 3.58 MHz", "media": "ROM cartridge", "memory": "128 KB", "name": "Super Famicom (SHVC-001)", "online": "Satellaview (satellite radio), XBAND,", "output": "composite video, S-Video and RGB", "platform_logo": 105, "platform_version_release_dates": [204], "resolutions": "256x224 to 512x448", "slug": "super-famicom-shvc-001", "sound": "Nintendo S-SMP 8 channels, stereo, 64 KB", "summary": "Original Japanese version (SHVC-001)", "url": "https://www.igdb.com/platforms/snes--1/version/super-famicom-shvc-001", "checksum": "3fcc6ae9-ac67-dc57-a433-780e25ee615f"}, {"id": 164, "name": "Initial version", "platform_logo": 372, "slug": "initial-version", "url": "https://www.igdb.com/platforms/trs-80/version/initial-version", "checksum": "93cf119c-a0d5-5de9-fcaa-4692e0bd605c"}, {"id": 222, "name": "Initial version", "platform_logo": 370, "slug": "initial-version", "url": "https://www.igdb.com/platforms/nec-pc-6000-series/version/initial-version", "checksum": "a4ae254e-b95b-ec66-9c68-a55026361c04"}, {"id": 283, "companies": [368], "cpu": "IBM PowerPC ''Broadway'' @ 729 MHz", "graphics": "ATI ''Hollywood'' @ 243 MHz", "media": "Nintendo Wii optical disc", "memory": "80 MB", "name": "Wii mini", "os": "Wii System Software", "output": "composite", "platform_logo": 326, "platform_version_release_dates": [360, 361, 362], "resolutions": "480p, 480i, 576i", "slug": "wii-mini", "sound": "Stereo, Dolby Surround", "storage": "512 MB NAND Flash memory", "summary": "A smaller version of the Wii with a top-loading disc drive. This version lacks online connectivity, as well as GameCube compatibility and an SD card slot.", "url": "https://www.igdb.com/platforms/wii/version/wii-mini", "checksum": "f5adf622-be04-e3ef-278e-bee6e383a1b1"}, {"id": 51, "cpu": "64-bit 93,75 MHz NEC VR4300", "graphics": "62,5 MHz SGI RCP", "media": "Nintendo 64 Game Pak", "memory": "4 MB RDRAM", "name": "Initial version", "online": "RANDnetDD (Japan Only)", "output": "Composite video and S-Video", "platform_logo": 259, "platform_version_release_dates": [36, 37, 39, 133], "resolutions": "256x224, 320x240 and 640x480", "slug": "initial-version-4369dd46-1ced-49c7-85f2-7f5c28d72be5", "sound": "16-bit, stereo, CD quality", "storage": "64 MB Cartridge and 256 Kb Controller Pak", "summary": "In the early 1990s there was a trend by video game companies to update their 16-bit cartridge-based systems to 32-bit CD-ROM based systems. Nintendo aimed extensive research at a possible CD-ROM add-on for its Super NES console. They launched development projects with, ironically, Sony and Philips but were not impressed with the loading speed of the CD-ROM-based systems. Nintendo instead opted to explore the potential of combining the fastest data storage device available: the silicon-based game cartridge, with the fastest computer chip to be used in video games: the 64-bit processor.\n\nChairman of Nintendo of America, Howard Lincoln, teamed with Jim Clark, Chairman of Silicon Graphics, the company that had done the special effects for Terminator 2: Judgment Day and Jurassic Park. They sought to design a new game system capable of incredible graphics-rendering power. The new system was initially called, \"Project Reality.\" The term \"Project Reality\" was in reference to the \"real\" three-dimensional environments that they knew could be created with the new system. The new platform would run on the powerful 100 MHz MIPS RISC microprocessor. Foreseeing the finite future of the current television standard, Nintendo made sure that \"Project Reality\" would also be compatible with HDTV (high-definition television).\n\nOn July 18, 1994, Nintendo revealed that the new name for their system, the \"Ultra 64\" (later changed to Nintendo 64), would use 500MHz DRAM memory technology from Rambus, Inc. This fast access speed would provide the means for extremely fluid three-dimensional graphics.\n\nNintendo announced that it would release the Nintendo 64 system to American consumers on April 21, 1996. The price would be under $250. This date was soon pushed back five months in order to allow manufacturers enough time to produce enough systems to accommodate the projected consumer demand.\n\nWhen the Nintendo 64 system was finally launched on September 29, 1996, only two games were available to American consumers: Super Mario 64 and Pilot wings 64. In a move considered risky by Nintendo, no game cartridge was packaged with the Nintendo 64 system. Only the console, a single gray controller and an AC adapter were included in the original packaging. The Nintendo 64 debuted with a retail price of $199.\n\nThe Nintendo 64 system and the game Super Mario 64 opened to rave reviews from the critics. Next Generation magazine even called Super Mario 64, \"the greatest video game ever made.\"\n\nOn its first day of sale, the Nintendo 64 system sold 500,000 units in North America. It took the PlayStation three months to sell the same amount. By the end of March 1997, Nintendo had sold over 3.3 million units of its new system.\n\nBesides the obvious innovations in graphics, the Nintendo 64 featured a unique controller with fourteen buttons and an analog joystick at the center. The joystick provides complete 360° control of on-screen action. On the bottom of the controller is a quick-action \"Z-trigger\" and a multi-directional control pad. Additional controllers (in designer colors) are available for $25 each.\n\nPlayers can attach an optional Controller Pak to the memory cart slot on the back of the Nintendo 64 controller. It stores a player's game statistics, preferred controller button configuration and built-up character strengths.\n\nNintendo introduced the Rumble Pak accessory in June 1997 along with the Star Fox 64 game cartridge. It attaches to the rear of the controller and vibrates according to various actions that occur on the screen (such as explosions or gunshots). The Rumble Pak is powered by two AAA batteries that can last up to 60 hours of play. Its retail price is $19.95.\n\nNintendo of America's President Minoru Arakawa announced a storage attachment for the system called the Nintendo 64 Disk Drive (64DD) in 1997. Also known as the \"bulky\" drive for its large or \"bulk\" storage capacity, the 64DD is designed to be a \"writable\" drive. Players would be able to customize existing games by introducing new characters or additional levels. This storage unit would sit beneath the Nintendo 64 console and plug into the \"EXT.\" expansion connector on the bottom of the system. The magnetic disk would be capable of holding 64 megabytes. It would be about the same size of a 3.5-inch floppy disk and twice as thick. When it is inserted into the 64DD, the disk would add four megabytes to the main memory, thereby upgrading the system's total to eight megabytes. Nintendo had originally announced that the first game to use this technology would be The Legend of Zelda: Ocarina of Time. While the 64DD was originally announced to be available in 1997, Nintendo cancelled its plans to debut the system upgrade in the United States.\n\nNintendo announced the release of the Nintendo 64 Expansion Pak on November 23, 1998. The Expansion Pak is a four-megabyte RAM cartridge that fits underneath a removable panel located on the top of the console. It will also increase the total RAM memory on the system to eight megabytes and allow select Nintendo 64 games to be played in a special high-resolution mode. The retail price for the Expansion Pak was $29.95. The first Expansion Pak compatible games to be announced were Star Wars: Rogue Squadron, NFL Quarterback Club 99 and Turok 2: Seeds of Evil.", "url": "https://www.igdb.com/platforms/n64/version/initial-version-4369dd46-1ced-49c7-85f2-7f5c28d72be5", "checksum": "805e01e1-1a8b-7ccd-b0fb-42d4d9cf0eb9"}, {"id": 284, "companies": [553], "cpu": "8x Cores @ 3.8 GHz (3.6 GHz w/ SMT) Custom Zen 2 CPU", "graphics": "12 TFLOPS, 52 CUs @ 1.825 GHz Custom RDNA 2 GPU", "memory": "16 GB GDDR6 w/ 320b bus", "name": "Xbox Series X", "online": "Xbox Live", "output": "HDMI 2.1 output port, three USB 3.2 ports, one networking port, an expanded storage slot and a power input port", "platform_logo": 561, "platform_version_release_dates": [363], "resolutions": "4k 60fps up to 120fps, support for Variable Refresh Rate (VRR), 8K capability", "slug": "xbox-series-x", "storage": "1TB Custom NVME SSD", "summary": "Xbox Series X is Microsoft's most powerful console ever, powered by their custom designed processor leveraging AMD's latest Zen 2 and RDNA 2 architectures. The new system on a chip (SOC) has been built from the ground up for speed and performance, with 12 teraflops of processing power and with compatibility in mind for four generations of games. \n \nCompared to the previous generation, Xbox Series X represents a superior balance of power and speed in console design, advancing on all technological fronts to delivering amazing, dynamic, living worlds and minimize any aspects that can take you out of the experience. \n \n- Next Generation Custom Processor: Xbox Series X is our most powerful console ever powered by our custom designed processor leveraging AMD’s latest Zen 2 and RDNA 2 architectures. Delivering four times the processing power of an Xbox One and enabling developers to leverage 12 TFLOPS of GPU (Graphics Processing Unit) performance – twice that of an Xbox One X and more than eight times the original Xbox One. Xbox Series X delivers a true generational leap in processing and graphics power with cutting edge techniques resulting in higher framerates, larger, more sophisticated game worlds, and an immersive experience unlike anything seen in console gaming. \n \nVariable Rate Shading (VRS): Our patented form of VRS empowers developers to more efficiently utilize the full power of the Xbox Series X. Rather than spending GPU cycles uniformly to every single pixel on the screen, they can prioritize individual effects on specific game characters or important environmental objects. This technique results in more stable frame rates and higher resolution, with no impact on the final image quality. \n \n- Hardware-accelerated DirectX Raytracing: You can expect more dynamic and realistic environments powered by hardware-accelerated DirectX Raytracing – a first for console gaming. This means true-to-life lighting, accurate reflections and realistic acoustics in real time as you explore the game world.", "url": "https://www.igdb.com/platforms/xbox-series-x/version/xbox-series-x", "checksum": "49c3532d-2977-925c-4670-c654a3303e76"}, {"id": 65, "companies": [249], "cpu": "Hitachi SH-2 @ 28,6 MHz", "graphics": "VDP1 (Polygons, Sprites, Texture Mapping, Gouraud Shading) VDP2 (Transparency, Scaling, Rotations, and Scrolling)", "media": "Sega Saturn Cartridge", "memory": "40 MB", "name": "Initial version", "online": "Sega NetLink, SegaNet", "platform_logo": 49, "platform_version_release_dates": [90, 91, 92], "resolutions": "320 x 224, 704 x 480,", "slug": "initial-version-ed059efd-a8a6-4ded-a209-998137a3f29a", "sound": "SCSP (SEGA Custom Sound Processor (Yamaha YMF-292  32 Channels FM sound PCM MIDI, Pitch Bending))", "storage": "Internal RAM, cartridge", "url": "https://www.igdb.com/platforms/saturn/version/initial-version-ed059efd-a8a6-4ded-a209-998137a3f29a", "checksum": "e08a46e1-4e04-bc05-10b3-4c2275e602b1"}, {"id": 3, "name": "Xbox 360 Arcade", "platform_logo": 250, "platform_version_release_dates": [2], "slug": "xbox-360-arcade", "url": "https://www.igdb.com/platforms/xbox360/version/xbox-360-arcade", "checksum": "8b9f5a93-4afe-405c-3046-bc3fb538f82d"}, {"id": 6, "companies": [74], "name": "Playstation 3 Super Slim", "platform_logo": 79, "platform_version_release_dates": [161, 162, 163, 164], "slug": "playstation-3-super-slim", "summary": "In September 2012, Sony announced that a new slimmer PS3 redesign (CECH-4000) was due to be released in late 2012 and that it would be available with either a 250 GB or 500 GB hard drive. In PAL regions, the 250 GB model is not available; a model with 12 GB of flash memory is available in its place. A standalone 250 GB hard drive is available to upgrade this model. Both are roughly 25% smaller and about 20% lighter than the original PS3 Slim. This version has a sliding disc cover rather than the slot-loading drive found on previous PlayStation 3 consoles. A vertical stand is also available for these models and was launched on the same day as the consoles in their respective regions.", "url": "https://www.igdb.com/platforms/ps3/version/playstation-3-super-slim", "checksum": "50fa2235-a2d7-ac43-3931-bf6e083c69e7"}, {"id": 12, "companies": [196], "name": "KitKat", "platform_logo": 63, "platform_version_release_dates": [102], "slug": "kitkat", "summary": "Versions 4.4 – 4.4.4", "url": "https://www.igdb.com/platforms/android/version/kitkat", "checksum": "104f941f-d949-35bc-3422-2e11a36b4853"}, {"id": 153, "name": "Initial version", "platform_logo": 295, "slug": "initial-version", "url": "https://www.igdb.com/platforms/apple-iigs/version/initial-version", "checksum": "9bf063a4-e282-8c7b-d62c-ccc79185a8cf"}, {"id": 117, "name": "SwanCrystal", "platform_logo": 263, "platform_version_release_dates": [140], "slug": "swancrystal", "url": "https://www.igdb.com/platforms/wonderswan/version/swancrystal", "checksum": "0b103ab5-0046-841f-68ad-a798e4702bfe"}, {"id": 195, "name": "Initial version", "platform_logo": 235, "platform_version_release_dates": [260, 261], "slug": "initial-version", "url": "https://www.igdb.com/platforms/new-nintendo-3ds/version/initial-version", "checksum": "89469ff6-b8e4-791b-ca48-6b86ded1853f"}, {"id": 93, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/donner30/version/initial-version", "checksum": "a924bdad-34d0-d4fb-1fc6-af9fdb9723c8"}, {"id": 116, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/pdp10/version/initial-version", "checksum": "be63d6df-3e82-1c8b-cc35-e6b644577e14"}, {"id": 130, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/hp2100/version/initial-version", "checksum": "1f78e979-6a06-3500-e70a-758de6c7ef15"}, {"id": 126, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/analogueelectronics/version/initial-version", "checksum": "57684063-eeb9-b25c-c16a-8053bd41858c"}, {"id": 41, "cpu": "Sharp LR35902 @ 8 MHz", "media": "Game Boy Cartridge", "memory": "32 KB", "name": "Initial version", "platform_logo": 273, "platform_version_release_dates": [85, 86, 87, 88], "slug": "initial-version-cfe9db03-c422-4216-b8de-539d686f3616", "url": "https://www.igdb.com/platforms/gbc/version/initial-version-cfe9db03-c422-4216-b8de-539d686f3616", "checksum": "4acf32ae-dae7-eed0-9387-160b9849ba25"}, {"id": 163, "companies": [532], "cpu": "NEC µPD780C @ 4MHz & higher", "media": "Floppy disk", "memory": "64 kilobytes and higher", "name": "Initial version", "platform_logo": 542, "platform_version_release_dates": [551], "slug": "initial-version", "summary": "The PC-8800 series (Japanese: PC-8800シリーズ, Hepburn: Pī Shī Hassen Happyaku Shirīzu), commonly shortened to PC-88, are a brand of Zilog Z80-based 8-bit home computers released by Nippon Electric Company (NEC) in 1981 and primarily sold in Japan. \n \nThe PC-8800 series sold extremely well and became one of the three major Japanese home computers of the 1980s, along with the Fujitsu FM-7 and Sharp X1. It was later eclipsed by NEC's 16-bit PC-9800 series, although it still maintained strong sales up until the early 90s. \n \nNEC's American subsidiary, NEC Home Electronics (USA), marketed variations of the PC-8800 in the United States.", "url": "https://www.igdb.com/platforms/pc-8801/version/initial-version", "checksum": "76bbbe04-5640-bfad-7727-f8391d946d2d"}, {"id": 105, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/astrocade/version/initial-version", "checksum": "e3004e5b-93d9-94ec-16e8-84787bebc92a"}, {"id": 55, "companies": [294], "connectivity": "Wi-Fi 802.11 b/g/n, Bluetooth LE 4.0, Ethernet port", "cpu": "1.7 GHz Quad-Core ARM Cortex-A9", "graphics": "Nvidia GeForce ULP @ 520 MHz", "memory": "1 GiB DDR3 SDRAM", "name": "Initial version", "os": "Android 4.1 Jelly Bean", "output": "HDMI, USB 2.0, Micro USB", "platform_logo": 236, "platform_version_release_dates": [15], "resolutions": "1080p, 720p", "slug": "initial-version-729a252f-e870-487e-a893-c9a2f1139bbd", "sound": "5.1 Surround, 2Ch Stereo", "storage": "8 GB internal flash memory", "summary": "The Ouya (/ˈuːjə/ oo-yə), stylized OUYA, is a microconsole running its own version of the Android operating system, developed by Ouya Inc. Julie Uhrman founded the project in 2012. She brought in designer Yves Béhar to collaborate on the design of the project, and Muffi Ghadiali as product manager to put together the engineering team. Development was funded via Kickstarter, raising $8.5 million and becoming the website's second-highest-earning project in its history.\n\nUnits started to ship to Kickstarter backers on March 28, 2013. The console was released to the general public on June 25, 2013, and features an exclusive Ouya store for applications and games designed specifically for the Ouya platform, of which the majority are casual games targeted at or used by a mass audience of casual gamers. Out of the box, Ouya supports media apps such as TwitchTV and XBMC media player. It runs a modified version of Android 4.1 Jelly Bean, and is open to rooting without voiding the warranty (developer models ordered during the Kickstarter campaign for $699 or $1,337 come pre-rooted). The console's hardware design allows it to be easily opened up, requiring only a standard screwdriver for easy modding and possible hardware addons.\n\nAll systems can be used as development kits, allowing any Ouya owner to also be a developer, without the need for licensing fees. All games are required to have some kind of free-to-play aspect, whether that be completely free, has a free trial, or has purchasable upgrades, levels, or other in-game items. The Ouya is classified as part of the eighth generation of video game consoles and as such is a rival competing against the PlayStation 4, Xbox One, and Wii U.\n\nAfter financial issues, Ouya's employees and software assets were sold to Razer Inc., who announced the discontinuation of the Ouya console on July 27, 2015.", "url": "https://www.igdb.com/platforms/ouya/version/initial-version-729a252f-e870-487e-a893-c9a2f1139bbd", "checksum": "996a6c9c-4d46-88d6-26ce-94ca112588dc"}, {"id": 2, "name": "Xbox 360 Elite", "platform_logo": 251, "slug": "xbox-360-elite", "summary": "Xbox 360 brings you a total games and entertainment experience. The largest library of games, including titles that get you right into the thick of it with Kinect. Plus, your whole family can watch HD movies, TV shows, live events, music, sports and more—across all your devices. Xbox 360 is the center of your games and entertainment universe.", "url": "https://www.igdb.com/platforms/xbox360/version/xbox-360-elite", "checksum": "69224598-256a-3ff9-a345-bd704a9e2148"}, {"id": 150, "companies": [103], "name": "Yosemite", "platform_logo": 99, "platform_version_release_dates": [159], "slug": "yosemite", "summary": "OS X Yosemite (version 10.10) is the eleventh major release of OS X, Apple Inc.'s desktop and server operating system for Macintosh computers. Yosemite introduced a major overhaul of OS X's user interface. Its graphics replaced skeuomorphism with flat graphic design and blurred translucency effects, following the aesthetic introduced with iOS 7. Many of Yosemite's new features focus on the theme of continuity, increasing its integration with other Apple services and platforms such as iOS and iCloud.", "url": "https://www.igdb.com/platforms/mac/version/yosemite", "checksum": "db5c61ef-17aa-52f3-8f3a-6aea54f2a7db"}, {"id": 157, "name": "Initial version", "platform_logo": 390, "platform_version_release_dates": [355], "slug": "initial-version", "summary": "The Neo Geo Pocket is a monochrome handheld game console released by SNK. It was the company's first handheld system and is part of the Neo Geo family. It debuted in Japan in late 1998 but never saw a western release, being exclusive to Japan and smaller Asian markets such as Hong Kong.", "url": "https://www.igdb.com/platforms/neo-geo-pocket/version/initial-version", "checksum": "5e4964dc-377c-dc88-2f7b-be603fc9fc24"}, {"id": 86, "name": "SG-1000", "platform_logo": 381, "slug": "sg-1000", "url": "https://www.igdb.com/platforms/browser/version/sg-1000", "checksum": "8af94739-cbbf-a353-03be-bda2f66c1323"}, {"id": 66, "name": "Initial version", "platform_logo": 297, "slug": "initial-version-5be55259-43c6-4700-8222-3dda296b2e6f", "url": "https://www.igdb.com/platforms/x1/version/initial-version-5be55259-43c6-4700-8222-3dda296b2e6f", "checksum": "638f8c3f-9a2a-544b-2feb-ceadce27f4a7"}, {"id": 13, "companies": [244, 245], "name": "Windows XP", "platform_logo": 205, "platform_version_release_dates": [257], "slug": "windows-xp", "summary": "Windows XP, the successor to Windows 2000 and Windows ME, was the first consumer-oriented operating system produced by Microsoft to be built on the Windows NT kernel. Windows XP was released worldwide for retail sale on October 25, 2001, and over 400 million copies were in use in January 2006", "url": "https://www.igdb.com/platforms/win/version/windows-xp", "checksum": "8e8f0276-0dc1-dcce-6b54-aa4cfeefb03c"}, {"id": 156, "cpu": "Intel 80386DX @ 16MHz", "memory": "1-2 MB RAM (upgradable to 64 MB)", "name": "Initial version", "os": "Towns OS + Windows", "platform_logo": 365, "platform_version_release_dates": [184], "resolutions": "320×200 to 720×512", "slug": "initial-version", "sound": "Richo RF5c68", "url": "https://www.igdb.com/platforms/fm-towns/version/initial-version", "checksum": "738b2df8-9ae4-5451-54e2-89163568c411"}, {"id": 11, "companies": [56], "name": "Jelly Bean 4.1.x-4.3.x", "platform_logo": 59, "platform_version_release_dates": [107], "slug": "jelly-bean-4-1-x-4-3-x", "url": "https://www.igdb.com/platforms/android/version/jelly-bean-4-1-x-4-3-x", "checksum": "814f22a7-13bd-25d2-a369-2d0b8adedfd3"}, {"id": 114, "companies": [316], "connectivity": "100 Mbit Ethernet/modem, 2x USB 1.1", "cpu": "Emotion Engine @ 294.912 MHz", "graphics": "Graphics Synthesizer @ 147.456 MHz", "memory": "32 MB", "name": "Slimline", "online": "Dynamic Network Authentication System", "output": "Composite video, S-Video, RGB, VGA, YPBPR", "platform_logo": 254, "platform_version_release_dates": [139], "resolutions": "480i, 480p", "slug": "slimline", "sound": "CPU+SPU2", "storage": "Playstation 2 Memory Card (8 MB), Playstation 1 Memory Card (1 MB)", "summary": "The PS2 is primarily differentiated between models featuring the original \"fat\" case design and \"slimline\" models, which were introduced at the end of 2004.", "url": "https://www.igdb.com/platforms/ps2/version/slimline", "checksum": "4e8e35ff-6cb7-1c7d-c0a5-77fdd36512c2"}, {"id": 123, "name": "Initial version", "platform_logo": 277, "slug": "initial-version", "url": "https://www.igdb.com/platforms/famicom/version/initial-version", "checksum": "3d81f692-d812-9cc3-db37-7c65ad81d5dd"}, {"id": 134, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/pdp11/version/initial-version", "checksum": "95881b8e-d41d-36b0-e36b-3110f8d513cb"}, {"id": 132, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/sdssigma7/version/initial-version", "checksum": "bf2c83e7-7b9a-91a0-bb9f-fb8ef6c03546"}, {"id": 137, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/imlac-pds1/version/initial-version", "checksum": "ce775deb-7559-be08-2d74-e5e2c05f414e"}, {"id": 24, "cpu": "MOS 6507 @ 1,19 MHz", "memory": "128 bytes ram", "name": "Initial version", "online": "GameLine", "platform_logo": 309, "platform_version_release_dates": [33, 34, 35], "slug": "initial-version-4d6e4123-07c6-4367-8d8a-f77760bebcc1", "storage": "4 kB ROM", "summary": "The Atari 2600, branded as the Atari Video Computer System (Atari VCS) until November 1982, is a home video game console developed and produced by Atari, Inc. Released in September 1977, it popularized microprocessor-based hardware and games stored on swappable ROM cartridges, a format first used with the Fairchild Channel F in 1976. The VCS was bundled with two joystick controllers, a conjoined pair of paddle controllers, and a game cartridge—initially Combat and later Pac-Man.\n\nAtari was successful at creating arcade video games, but their development cost and limited lifespan drove CEO Nolan Bushnell to seek a programmable home system. The first inexpensive microprocessors from MOS Technology in late 1975 made this feasible. The console was prototyped as codename Stella, by Atari subsidiary Cyan Engineering. Lacking funding to complete the project, Bushnell sold Atari to Warner Communications in 1976.\n\nThe Atari VCS launched in 1977 with nine simple, low-resolution games in 2 KB cartridges. The system's first killer app was the home conversion of Taito's arcade game Space Invaders in 1980. The VCS became widely successful, leading to the founding of Activision and other third-party game developers and to competition from console manufacturers Mattel and Coleco. By the end of its primary lifecycle in 1983–84, games for the 2600 were using more than four times the storage size of the launch games with significantly more advanced visuals and gameplay than the system was designed for, such as Activision's Pitfall!.\n\nIn 1982, the Atari 2600 was the dominant game system. Amid competition from both new consoles and game developers, a number of poor decisions from Atari management affected the company and the industry as a whole. The most public was an extreme investment into licensed games for the 2600, including Pac-Man and E.T. the Extra-Terrestrial. Pac-Man became the system's biggest selling game, but the conversion's poor quality eroded consumer confidence in the console. E.T. was rushed to market for the holiday shopping season and was critically panned and a commercial failure. Both games, and a glut of third-party shovelware, were factors in ending Atari's relevance in the console market. Atari's downfall reverberated through the industry resulting in the video game crash of 1983.\n\nWarner sold Atari's home division to former Commodore CEO Jack Tramiel in 1984. In 1986, the new Atari Corporation under Tramiel released a lower-cost version of the 2600 and the backward-compatible Atari 7800, but it was Nintendo that led the recovery of the industry with its 1985 launch of the Nintendo Entertainment System. Production of the Atari 2600 ended on January 1, 1992, with an estimated 30 million units sold across its lifetime.", "url": "https://www.igdb.com/platforms/atari2600/version/initial-version-4d6e4123-07c6-4367-8d8a-f77760bebcc1", "checksum": "e7e977d7-57bc-c953-54d9-ab241dbf4385"}, {"id": 174, "companies": [535, 536], "cpu": "3.58 Mz", "media": "CD-ROM (Super Disc)", "memory": "552 KB", "name": "Initial version", "output": "RCA Composite, S-VIdeo, multi-out AV", "platform_logo": 529, "slug": "initial-version", "summary": "The Nintendo PlayStation, or Super NES CD-ROM System, was a peripheral for the Super Nintendo Entertainment System and the Super Famicom. It was being developed in a partnership between Nintendo and Sony. It was cancelled and only one development prototype was found so far.", "url": "https://www.igdb.com/platforms/nintendo-playstation/version/initial-version", "checksum": "2ce6097b-0d25-ff3c-a052-991ccb4b5393"}, {"id": 170, "companies": [538], "name": "Odisea (Mexico Export)", "platform_version_release_dates": [173], "slug": "odisea-mexico-export", "summary": "Mexican Export version of the Magnavox Odyssey. For the Mexican market all accessories were changed from English to Spanish.", "url": "https://www.igdb.com/platforms/odyssey--1/version/odisea-mexico-export", "checksum": "68b8c93e-a155-4e8e-1a09-737702278eca"}, {"id": 29, "companies": [37, 84], "cpu": "MOS 65SC02 @ 4 MHz", "media": "ROM cartridges", "memory": "64 KB DRAM", "name": "Initial version", "online": "Comlynx (18-player networking)", "platform_logo": 42, "platform_version_release_dates": [142], "resolutions": "160×102 standard resolution (16,320 addressable pixels)", "slug": "initial-version-2d30967a-4545-4ff8-b4bb-e82e5038fe16", "sound": "8-bit 4-channel mono", "storage": "Cartridge 128 KB, 256 KB, 512 KB", "url": "https://www.igdb.com/platforms/lynx/version/initial-version-2d30967a-4545-4ff8-b4bb-e82e5038fe16", "checksum": "4490e81f-eca5-3d8a-55d1-a167cd213cdf"}, {"id": 353, "companies": [529], "cpu": "Zilog Z80 @ 2.106 MHz (later 4 MHz)", "name": "Initial version", "platform_version_release_dates": [543], "slug": "initial-version", "summary": "The Sorcerer is a home computer system released in 1978 by the video game company Exidy.", "url": "https://www.igdb.com/platforms/exidy-sorcerer/version/initial-version", "checksum": "70ffa499-a654-cdfc-ab56-082c0ad4e777"}, {"id": 229, "companies": [309], "connectivity": "Wi-FI", "cpu": "ARM9 clocked at 133 MHz and ARM7 clocked at 33 MHz", "media": "Nintendo DS Cartridge, Nintendo DSi Cartridge", "memory": "16 MB PSRAM", "name": "Nintendo DSi XL", "online": "Nintendo Wi-Fi Connection, Nintendo DSi Shop, Nintendo Zone", "platform_logo": 246, "platform_version_release_dates": [268, 269, 270, 271], "resolutions": "256x192 pixel resolution", "slug": "nintendo-dsi-xl", "storage": "256 MB internal flash memory, SD card (up to 2gb), SDHC card (up to 32gb)", "summary": "The extra large version of the Nintendo DSi. \nThe system itself is larger overall than the other Nintendo DS versions. \nThe screens are larger than the Nintendo DSi, at 4.2-inch (110 mm), and have a larger viewing angle than the other versions allowing people around the main user to easily view the game being played. \nThe system came with an extra stylus that did not fit into the system and was made in the style of a pen.", "url": "https://www.igdb.com/platforms/nintendo-dsi/version/nintendo-dsi-xl", "checksum": "69dbab1e-9d96-5616-174f-e7c8414a9ce2"}, {"id": 319, "name": "Stadia", "platform_logo": 392, "slug": "stadia", "summary": "Stadia, is the first platform created by search giant Google. Releasing in November 2019, it is the first major video game streaming platform with others rapdily approaching.", "url": "https://www.igdb.com/platforms/stadia--1/version/stadia", "checksum": "af700bd8-6161-1e0c-3dcd-5d24cc5043ea"}, {"id": 320, "companies": [415], "name": "Pie", "platform_logo": 393, "platform_version_release_dates": [398], "slug": "pie", "url": "https://www.igdb.com/platforms/android/version/pie", "checksum": "632725de-8777-0c5f-66ac-ae6946bcf976"}, {"id": 68, "cpu": "16-bit 65c816 Ricoh 5A22 3.58MHz", "graphics": "Nintendo S-SMP (8 stereo channels)", "media": "Satellaview (Japan only), Nintendo Power (Japan only), XBAND", "name": "Super Nintendo (original North American version)", "platform_logo": 73, "platform_version_release_dates": [17, 18, 19, 20], "resolutions": "RF, composite, S-video, RGB", "slug": "super-nintendo-original-north-american-version", "sound": "ROM cartridge", "storage": "128 kB", "url": "https://www.igdb.com/platforms/snes--1/version/super-nintendo-original-north-american-version", "checksum": "ed30c08a-95f7-32cc-c657-9f26742dad11"}, {"id": 97, "companies": [117], "cpu": "Ricoh 5A22 @ 3.58 MHz", "media": "ROM cartridge", "memory": "128 KB", "name": "Super Nintendo (Model SNS-101)", "output": "VGA", "platform_logo": 71, "platform_version_release_dates": [203], "resolutions": "256x224 to 512x448", "slug": "super-nintendo-model-sns-101", "sound": "Nintendo S-SMP 8 channels, stereo, 64 KB", "summary": "Redesign released 1997", "url": "https://www.igdb.com/platforms/snes--1/version/super-nintendo-model-sns-101", "checksum": "247450ac-9d70-884b-1145-b71f5ac2fb5f"}, {"id": 127, "name": "Initial version", "platform_logo": 386, "slug": "initial-version", "url": "https://www.igdb.com/platforms/nimrod/version/initial-version", "checksum": "95003d46-9fff-1850-e821-3f6ad1d2c31b"}, {"id": 239, "companies": [407], "name": "Oreo", "platform_logo": 376, "platform_version_release_dates": [275], "slug": "oreo", "summary": "Versions 8.0 – 8.1", "url": "https://www.igdb.com/platforms/android/version/oreo", "checksum": "0b4dc6a1-25cf-5552-a71c-f966603c20e2"}, {"id": 318, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/stadia--1/version/initial-version", "checksum": "a570d899-eacb-7f93-808c-46ad44232506"}, {"id": 52, "companies": [305], "connectivity": "Wi-FI IEEE 802,11", "cpu": "ARM946E-S @ 67,028 MHz, ARM7TDMI @ 33,514 MHz", "media": "Nintendo DS Game Card, Game Boy Advance Cartridge", "memory": "4 MB RAM, 256 KB flash memory", "name": "Initial version", "online": "Nintendo Wi-Fi Connection", "platform_logo": 243, "platform_version_release_dates": [76, 77, 78, 79], "resolutions": "256 × 192 pixels", "slug": "initial-version-edb2fbbe-ffbe-4e63-a504-4a98114ab7c7", "url": "https://www.igdb.com/platforms/nds/version/initial-version-edb2fbbe-ffbe-4e63-a504-4a98114ab7c7", "checksum": "255b00a7-ee26-b36c-5b13-aa7db441928d"}, {"id": 28, "cpu": "Multi Processor:  ''Tom'' @ 26,59 MHz, ''Jerry'' @ 26,59 MHz", "media": "ROM cartridge, CD-ROM (Add-on)", "memory": "2MB", "name": "Initial version", "output": "S-Video, Composite, RGB", "platform_logo": 286, "platform_version_release_dates": [45, 46, 47], "slug": "initial-version-25c50fa0-8e30-466f-8758-50b1f7e18793", "sound": "16-bit Stereo", "storage": "ROM Cartridge 6MB", "url": "https://www.igdb.com/platforms/jaguar/version/initial-version-25c50fa0-8e30-466f-8758-50b1f7e18793", "checksum": "7932233a-1d62-03e7-a4ec-b8f4c2fc823a"}, {"id": 191, "companies": [307], "connectivity": "Wi-Fi, Integrated 802.11b/g", "cpu": "ARM9 clocked at 133 MHz and ARM7 clocked at 33 MHz", "media": "Nintendo DS Game Card, Nintendo DSi Game Card", "memory": "16 MB PSRAM", "name": "Nintendo DSi", "online": "Nintendo Wi-Fi Connection, Nintendo DSi Shop, Nintendo Zone", "platform_logo": 244, "platform_version_release_dates": [229, 230, 231, 232, 233], "resolutions": "256 × 192 pixels", "slug": "nintendo-dsi", "storage": "256 MB of internal flash memory, slots for a SD card (up to 2 GB) and a SDHC card (up to 32 GB)", "summary": "An improved version of the Nintendo DS. \nIt does not have a Game Boy Advance Cartridge slot. \nIt has more RAM and a faster CPU than the Nintendo DS and Lite versions. \nIt has slightly larger screens and 5 brightness settings. \nIt has 2 digital cameras.", "url": "https://www.igdb.com/platforms/nds/version/nintendo-dsi", "checksum": "38d3ef4e-b82a-08da-d6e6-e59bc4d17242"}, {"id": 98, "name": "Super Famicom Jr.", "platform_logo": 74, "slug": "super-famicom-jr", "url": "https://www.igdb.com/platforms/sfam/version/super-famicom-jr", "checksum": "589691a3-7ca1-d8e2-3012-d3ebda3e9c03"}, {"id": 122, "companies": [321], "media": "iQue Memory Card", "name": "iQue Player", "online": "Fugue Online", "platform_logo": 260, "platform_version_release_dates": [147], "slug": "ique-player", "summary": "Miniaturized plug-n-play version of the N64 made for use in China", "url": "https://www.igdb.com/platforms/n64/version/ique-player", "checksum": "dcbb08e5-92e8-62b0-6100-8af41aa0cc6e"}, {"id": 59, "connectivity": "Wi-Fi 802.11b, IrDA", "cpu": "MIPS R4000", "media": "Universal Media Disc, digital distribution", "memory": "32 MB eDRAM", "name": "PSP-1000", "online": "Playstation Network", "os": "PlayStation Portable system software", "platform_logo": 242, "platform_version_release_dates": [69, 70, 71, 334, 335], "resolutions": "480 x 272", "slug": "psp-1000", "sound": "Stereo speakers, 3.5 mm headphone jack", "storage": "Memory Stick Duo, Memory Stick PRO Duo", "url": "https://www.igdb.com/platforms/psp/version/psp-1000", "checksum": "9ef024f6-3ec7-8a99-f994-203344b59cd2"}, {"id": 180, "companies": [364], "cpu": "1.75GHz 8-core AMD custom CPU", "graphics": "AMD graphics clocked at 914MHz", "media": "4K/HDR Blu-ray drive", "memory": "8GB DDR3", "name": "Xbox One S", "online": "Xbox Live", "os": "Xbox OS", "output": "HDMI 2.0", "platform_logo": 324, "platform_version_release_dates": [208], "resolutions": "4K Ultra HD video", "slug": "xbox-one-s", "storage": "2 tb", "summary": "The slim version of the Xbox One.", "url": "https://www.igdb.com/platforms/xboxone/version/xbox-one-s", "checksum": "6b781b10-40c3-9635-23ae-2b5cb56374e4"}, {"id": 71, "name": "Initial version", "platform_logo": 384, "slug": "initial-version-37c27703-ddeb-4143-b022-b651fa546464", "url": "https://www.igdb.com/platforms/vc/version/initial-version-37c27703-ddeb-4143-b022-b651fa546464", "checksum": "f41d1bc0-9e07-dda2-236e-21fb8e243572"}, {"id": 111, "name": "Amiga A 2000", "slug": "amiga-a-2000", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-2000", "checksum": "7aacb9e9-e06d-efa2-1d2f-e87d20b78f06"}, {"id": 161, "name": "Initial version", "platform_logo": 261, "slug": "initial-version", "url": "https://www.igdb.com/platforms/wonderswan-color/version/initial-version", "checksum": "2f801ec3-5e31-e2aa-8e52-cade5f3024e5"}, {"id": 186, "companies": [150], "cpu": "NEC VR4300 (64-bit MIPS III architecture based) @ 100 MHz with 4 MB RAM and 64 MB Program Memory", "media": "Cartridge", "name": "Initial version", "platform_logo": 117, "platform_version_release_dates": [222], "slug": "initial-version", "sound": "32-channel PCM wavetable audio, with maximum sampling frequency of 44.1 kHz (CD-quality) and 32 MB of wavetable RAM", "summary": "The short lived successor to the Neo Geo MVS arcade system. It was the first and only SNK system with the ability to render in 3D. \n \nThe system was discontinued after 2 years with only 7 games made for it.", "url": "https://www.igdb.com/platforms/hyper-neo-geo-64/version/initial-version", "checksum": "298a5625-a95a-277a-7c47-d8caf1b0ef85"}, {"id": 56, "companies": [32, 33], "name": "Initial version", "platform_logo": 38, "platform_version_release_dates": [66], "slug": "initial-version-3ef9ff1e-a867-41d2-88c7-7f420cc834bf", "url": "https://www.igdb.com/platforms/dos/version/initial-version-3ef9ff1e-a867-41d2-88c7-7f420cc834bf", "checksum": "27bb8656-5b32-6d25-ddd3-6fb4929059b2"}, {"id": 92, "name": "SG-1000 II", "platform_logo": 66, "slug": "sg-1000-ii", "url": "https://www.igdb.com/platforms/sg1000/version/sg-1000-ii", "checksum": "38fb3d0f-4b91-2d1d-0c4c-ed878b15164e"}, {"id": 193, "name": "Game Boy Advance SP", "platform_logo": 285, "slug": "game-boy-advance-sp", "url": "https://www.igdb.com/platforms/gba/version/game-boy-advance-sp", "checksum": "04935ca0-ffb5-2ed6-93b4-bba945892c2a"}, {"id": 26, "cpu": "Atari SALLY 6502 @ 1,19-1,79 MHz", "media": "ROM cartridge", "memory": "4KB RAM", "name": "Initial version", "output": "S-Video", "platform_logo": 303, "platform_version_release_dates": [44], "resolutions": "160x240, 320x240", "slug": "initial-version-b404799e-fb33-4e0b-9721-85224a46dd97", "storage": "4KB BIOS Rom, 48KB Cartridge ROM", "summary": "The Atari 7800 ProSystem was released a full two years after it was designed and tested. The console was Atari's attempt to compete with the NES and Sega Master System. Following a massive research project focused on determining exactly what consumers were demanding from a video game platform, Atari knew what it needed for its next generation system. They selected the General Computer Corporation to design new a graphics chip. \"Marie\" was what they named it. It provided a greater spectrum of colors and an endless number of sprites.\n\nThere was also one extra feature Atari added to the Marie chip. In an effort to combat third-party game manufacturers from taking a huge chunk out of their potential software profits, Atari installed an encryption algorithm (like a coded lock) into the Marie Chip. The 7800 would only allow cartridges containing a 960-bit encoded \"key\" to activate its state-of-the-art graphics and sound capabilities. If a cartridge did not include the proper coded authentication, the system remained in its default mode and could only run games made for the 2600.\n\nWith the 7800, Atari attempted to correct all of the shortcomings inherent to the 5200 platform. As stated above, the 7800 was compatible with 2600 cartridges. They had even designed an adapter (later discarded upon release) which would let the 7800 play 5200 cartridges, giving Atari across-the-board compatibility with all previous software. To make the system even more attractive to consumers considering purchasing a home computer, Atari promised an optional keyboard add-on.\n\nWhile size of the 7800 console is much smaller than the immense 5200, the major improvement was made in the joystick design. The 7800 controller was made more in the tradition of the 2600. It is sleek, simple and, most importantly, durable.\n\nIn 1983, the Marie project was a courageous attempt to bring Atari back as the preeminent name in video games. Atari poured their best available personnel into the project. The system was ready and waiting to ignite the stagnant video game market.\n\nUnfortunately timing was working against the proponents of the 7800. In 1984, Warner Communications sold Atari to Jack Tramiel. He wanted to focus on the company's computer line, and the Atari 7800 was shelved.\n\nThe video game market awoke with a roar in 1985. Nintendo had released the NES game system to American consumers. Videogame sales skyrocketed and soon Sega premiered its Sega Master System. Seeing there was money to be made, Atari scrambled to get onto the playing field and released the Atari 7800 in 1986 with only three games: Ms. Pac-Man, Joust and Asteroids.\n\nWith a paltry $300,000 advertising budget Atari gave the system a half-hearted release. Sales for the platform were good, but Atari was also trying to market a computer/console hybrid called the Atari XE and a remodeled version of the Atari 2600. All three platforms remained far behind Nintendo and Sega's offerings. By the time the Atari 7800 started to build up a substantial library of games, it was too late, and the system disappeared from store shelves.", "url": "https://www.igdb.com/platforms/atari7800/version/initial-version-b404799e-fb33-4e0b-9721-85224a46dd97", "checksum": "fb317997-881b-1022-f036-09cd9037c3c0"}, {"id": 27, "name": "Atari 400", "platform_logo": 373, "slug": "atari-400", "url": "https://www.igdb.com/platforms/atari8bit/version/atari-400", "checksum": "a0b54078-0324-5349-a03c-f08ea977eb55"}, {"id": 63, "companies": [346], "cpu": "Zilog Z80 @ 4MHz", "graphics": "32 colors out of 64 color palette, 16kB video RAM", "media": "Cartridges", "memory": "8kB RAM", "name": "Initial version", "platform_logo": 298, "platform_version_release_dates": [176, 177, 178], "resolutions": "256x192", "slug": "initial-version-0e6dcd6b-521f-4dfa-a008-e71e9ee4c404", "sound": "SN76489 PSG", "summary": "The Master System is a third-generation home video game console that was manufactured by Sega. \n \nIt was originally released in 1985 as the Sega Mark III in Japan. After being redesigned prior to its North American launch, the console was renamed Master System and released in 1986 in North America, 1987 in Europe, and 1989 in Brazil.", "url": "https://www.igdb.com/platforms/sms/version/initial-version-0e6dcd6b-521f-4dfa-a008-e71e9ee4c404", "checksum": "f5698e92-0e60-fae1-d1a3-19e9f5d38349"}, {"id": 104, "name": "Atari 800", "platform_logo": 224, "slug": "atari-800", "summary": "The Atari 8-bit family is a series of 8-bit home computers introduced by Atari, Inc. in 1979 and manufactured until 1992. All of the machines in the family are technically similar and differ primarily in packaging. They are based on the MOS Technology 6502 CPU running at 1.79 MHz, and were the first home computers designed with custom co-processor chips. This architecture enabled graphics and sound capabilities that were more advanced than contemporary machines at the time of release, and gaming on the platform was a major draw.", "url": "https://www.igdb.com/platforms/atari8bit/version/atari-800", "checksum": "5959846d-c9c3-61fd-baab-9ed6fd960adb"}, {"id": 228, "companies": [310], "connectivity": "Wi-Fi, Integrated 802.11b/g", "cpu": "ARM9 clocked at 133 MHz and ARM7 clocked at 33 MHz", "media": "Nintendo DS Game Card, Nintendo DSi Game Card", "memory": "16 MB PSRAM", "name": "Initial version", "online": "Nintendo Wi-Fi Connection, Nintendo DSi Shop, Nintendo Zone", "os": "Nintendo DSi system software", "platform_logo": 247, "platform_version_release_dates": [263, 264, 265, 266, 267], "resolutions": "256 × 192 pixels", "slug": "initial-version", "storage": "256 MB of internal flash memory, slots for a SD card (up to 2 GB) and a SDHC card (up to 32 GB)", "summary": "An improved version of the Nintendo DS. \nIt does not have a Game Boy Advance Cartridge slot. \nIt has more RAM and a faster CPU than the Nintendo DS and Lite versions. \nIt has slightly larger screens and 5 brightness settings. \nIt has 2 digital cameras.", "url": "https://www.igdb.com/platforms/nintendo-dsi/version/initial-version", "checksum": "a6a80725-f8e8-a1ba-ae81-c01c4db8a49e"}, {"id": 232, "name": "Initial version", "platform_logo": 158, "slug": "initial-version", "url": "https://www.igdb.com/platforms/oculus-vr/version/initial-version", "checksum": "9bde64bf-cc98-265b-b17c-09eae67e0a72"}, {"id": 1, "companies": [247], "name": "Windows 7", "platform_logo": 207, "platform_version_release_dates": [259], "slug": "windows-7", "summary": "Unlike Windows Vista's many new features, Windows 7 was an incremental upgrade designed to work with Vista-compatible applications and hardware. Presentations given by Microsoft in 2008 focused on multi-touch support, an updated Windows shell with a new taskbar, referred to internally as the Superbar, a home networking system called HomeGroup, and performance improvements.", "url": "https://www.igdb.com/platforms/win/version/windows-7", "checksum": "81bcc19f-8798-d0bc-6dd4-4296542563d6"}, {"id": 217, "companies": [530], "cpu": "2x MBL 68B09 clocked at 2MHz", "graphics": "8 colours at 640 x 200 pixel resolution", "media": "Cassette tape, 5¼-inch floppy disk", "memory": "64KB RAM, 48KB VRAM, 48KB ROM", "name": "Initial version", "os": "Fujitsu Disk Basic , OS-9, FLEX", "platform_logo": 538, "platform_version_release_dates": [547], "slug": "initial-version", "sound": "3-channel (AY-3-8910) PSG chip, built-in speaker mounted near the top of the unit. From fm77 av onwards, 6 channel ym2203 (3psg+3fm)", "storage": "5.25\" floppy disk", "summary": "The FM-7 is a home computer created by Fujitsu. It was first released in 1982 and was sold in Japan and Spain. It is a stripped-down version of Fujitsu's earlier FM-8 computer, and during development it was referred to as the \"FM-8 Jr.\"", "url": "https://www.igdb.com/platforms/fm-7/version/initial-version", "checksum": "7c6ec526-871d-03ca-5307-40a67f09a8a2"}, {"id": 108, "name": "Initial version", "platform_logo": 310, "slug": "initial-version", "url": "https://www.igdb.com/platforms/c-plus-4/version/initial-version", "checksum": "3f4fd23f-d759-c5c4-684b-86ae411788d1"}, {"id": 7, "companies": [55], "name": "Froyo 2.2", "platform_logo": 58, "platform_version_release_dates": [106], "slug": "froyo-2-2", "url": "https://www.igdb.com/platforms/android/version/froyo-2-2", "checksum": "8f9379a2-925e-98fd-0b18-b050120d3f6a"}, {"id": 125, "companies": [253], "connectivity": "Gamecube Broadband Network Adapter", "cpu": "IBM \"Gekko\" PowerPC at 485 MHz", "graphics": "ATI Flipper 162 MHz (64 Bit, 16 MB)", "media": "DVD, CD, GD-Rom disc", "memory": "43 MB", "name": "Panasonic Q", "os": "Dolphin OS", "platform_logo": 87, "platform_version_release_dates": [148], "resolutions": "240i , 240p, 480i, 480p", "slug": "panasonic-q", "sound": "81 MHz in Flipper (64 Channels at 48000KHz)", "summary": "The Panasonic Q (sometimes known as Q and GameQ) is a hybrid version of the Nintendo GameCube with a DVD player manufactured by Panasonic in cooperation with Nintendo. The system was officially released only in Japan. A feature of its main competitors Xbox and PlayStation 2, the GameCube lacked commercial DVD movie playback functionality due to the use of the Nintendo optical disc format for games and the correspondingly small disc tray.", "url": "https://www.igdb.com/platforms/ngc/version/panasonic-q", "checksum": "543649b9-aa5a-de32-1489-dec4119223d8"}, {"id": 48, "name": "Initial version", "platform_logo": 308, "platform_version_release_dates": [112], "slug": "initial-version-1a53a258-c792-4df6-b5f6-e616f571b4b0", "url": "https://www.igdb.com/platforms/msx2/version/initial-version-1a53a258-c792-4df6-b5f6-e616f571b4b0", "checksum": "e38310a1-3d96-474e-abfc-108ed7f5e974"}, {"id": 69, "connectivity": "3.5 headphone jack, IR, Bluetooth", "cpu": "Motorola i.MX1 ARM9 @ 200 MHz", "graphics": "ATI Imageon W4200 (8 MB dedicated SDRAM)", "memory": "32 MB", "name": "Zodiac 1", "os": "Palm OS", "platform_logo": 46, "platform_version_release_dates": [84], "slug": "zodiac-1", "sound": "Yamaha Stereo Speakers", "url": "https://www.igdb.com/platforms/zod/version/zodiac-1", "checksum": "f354b037-beea-54b7-6611-b210c8899ba6"}, {"id": 121, "name": "DOL-101", "slug": "dol-101", "summary": "No Digital AV Out (component)", "url": "https://www.igdb.com/platforms/ngc/version/dol-101", "checksum": "b6b45999-cfc9-572b-f6fd-40ab77df446e"}, {"id": 212, "name": "Saba Videoplay", "platform_logo": 317, "platform_version_release_dates": [246], "slug": "saba-videoplay", "summary": "Saba Videoplay was the licensed Channel F-Version for the German market. It was released in late 1977 and was positively received by the press and the general public. However, the initial retail price of over 500 DM meant that the Videoplay would be available only to higher-income households. Yet, the system sold reasonably well, offering a library of 18 games by the end of 1978. But as competition started to grow larger, the inferiority of the Fairchild-hardware became more and more obvious. By 1980 Saba dropped the hardware, which was now owned by Zircon, who licenced it to other German competitors, namely ITT and Nordmende.", "url": "https://www.igdb.com/platforms/fairchild-channel-f/version/saba-videoplay", "checksum": "59bf0530-8769-2e65-9e81-776385cabcdc"}, {"id": 215, "name": "Initial version", "platform_logo": 291, "slug": "initial-version", "url": "https://www.igdb.com/platforms/turbografx-16-slash-pc-engine-cd/version/initial-version", "checksum": "44f1fee7-07aa-f4c9-b9d6-df6d84615726"}, {"id": 141, "companies": [94], "name": "Puma", "platform_logo": 90, "platform_version_release_dates": [150], "slug": "puma", "summary": "Mac OS X version 10.1, code named Puma, is the second major release of Mac OS X, Apple's desktop and server operating system. Version 10.1 was released as a free update for Mac OS X 10.0 users. The operating system was better received than Mac OS X 10.0, although critics claimed that the operating system was still lacking some features and was plagued with bugs.", "url": "https://www.igdb.com/platforms/mac/version/puma", "checksum": "980f0f54-b5a0-cb5a-a130-2997734adb27"}, {"id": 162, "name": "Initial version", "platform_logo": 319, "slug": "initial-version", "url": "https://www.igdb.com/platforms/swancrystal/version/initial-version", "checksum": "2c4f9c0e-8be6-7d03-be9d-b87f8f72531f"}, {"id": 178, "companies": [120], "connectivity": "Super-Speed USB (USB 3.1 Gen1) port × 2, AUX port × 1, Ethernet?10BASE-T, 100BASE-TX, 1000BASE-T?×, IEEE 802.11 a/b/g/n/ac wi-fi, Bluetooth v4.0", "cpu": "x86-64 AMD \"Jaguar\", 8 cores", "graphics": "1.84 TFLOPS, AMD Radeon based graphics engine", "media": "BD × 6 CAV, DVD × 8 CAV", "memory": "GDDR5 8GB", "name": "PlayStation 4 Slim", "online": "PlayStation Network", "os": "Orbis OS", "platform_version_release_dates": [206], "slug": "playstation-4-slim", "storage": "500gb", "summary": "\"When comparing the new PS4 model to the current model, we’ve reduced volume by 30 percent, weight by 16 percent, and power consumption by 28 percent. Despite the sleek design, the new model packs all of the same powerful components that have made PS4 the best place to play.\"", "url": "https://www.igdb.com/platforms/ps4--1/version/playstation-4-slim", "checksum": "6997d14c-3070-26a3-9426-2b9ec215c4e0"}, {"id": 37, "companies": [359], "name": "Initial version", "platform_logo": 313, "slug": "initial-version-736f469b-b7df-49ab-9be6-5f75ac942ec8", "summary": "The Commodore VIC-20 was the first computer to ever sell over 1 million units, and can be regarded as the beginning of the mainstream computer age. It was not particularly useful for business applications, but was well-received for the many games available. It was also the first relatively inexpensive colour computer, costing less than $300. It is the predecessor of the significantly more well known Commodore 64, which is the highest selling single computer model of all time.", "url": "https://www.igdb.com/platforms/vic-20/version/initial-version-736f469b-b7df-49ab-9be6-5f75ac942ec8", "checksum": "87873d1f-85a3-086f-56e5-6524b5ef205c"}, {"id": 82, "companies": [240], "cpu": "16-bit Motorolla 68000 (12MHz) and 8-bit Zilog Z80 (4MHz)", "media": "Cartridge", "memory": "64KB (68000) + 2KB (Z80), Video RAM: 68KB", "name": "Initial version", "platform_logo": 69, "platform_version_release_dates": [314, 315, 316], "resolutions": "320x224", "slug": "initial-version-cf5691a3-0bfb-449c-af8d-465fd2a65b1d", "sound": "3 PSG, 4-FM synthesis, 7-digital, 1 noise channel", "storage": "Removable memory card: 68-pin, JEIDA V3 complaint, cross-compatible with the MVS", "url": "https://www.igdb.com/platforms/neogeoaes/version/initial-version-cf5691a3-0bfb-449c-af8d-465fd2a65b1d", "checksum": "bb313ea4-d6a4-846c-ac24-ec45e8da8a32"}, {"id": 10, "companies": [57], "name": "Ice Cream Sandwich", "platform_logo": 60, "platform_version_release_dates": [108], "slug": "ice-cream-sandwich", "url": "https://www.igdb.com/platforms/android/version/ice-cream-sandwich", "checksum": "d27fa043-3d6e-6ce9-edf8-14fbdafa3e3d"}, {"id": 17, "companies": [289], "connectivity": "802.11 b/g/n Wireless, Bluetooth 2.1, USB 3.0, Ethernet 10/100/1000", "cpu": "Semi-custom 8-core AMD x86-64 CPU", "graphics": "Semi-custom AMD Radeon GPU", "main_manufacturer": 2123, "media": "Blu-ray Disc, DVD", "memory": "8 GB GDDR5", "name": "Initial version", "online": "PlayStation Network", "os": "Orbis OS", "platform_logo": 230, "platform_version_release_dates": [10, 11, 12, 13], "slug": "initial-version-6835ddec-db2a-4da6-8f89-7d8e63f7e293", "storage": "Hard drive, 500GB (user upgradeable, supports SSD)", "summary": "The PlayStation 4 system opens the door to an incredible journey through immersive new gaming worlds and a deeply connected gaming community. PS4 puts gamers first with an astounding launch line-up and over 180 games in development. Play amazing top-tier blockbusters and innovative indie hits on PS4. Developer inspired, gamer focused.", "url": "https://www.igdb.com/platforms/ps4--1/version/initial-version-6835ddec-db2a-4da6-8f89-7d8e63f7e293", "checksum": "ed93f38b-5d3c-73d2-ce2c-135b598aa699"}, {"id": 72, "companies": [366], "connectivity": "Wi-Fi 802,11 b/g, Bluetooth, USB LAN Adapter", "cpu": "IBM PowerPC ''Broadway'' @ 729 MHz", "graphics": "ATI ''Hollywood'' @ 243 MHz", "media": "Nintendo Wii optical disc, Nintendo GameCube game disc", "memory": "80 MB", "name": "Initial version", "online": "WiiConnect24, Wii Shop Channel", "os": "Wii System Software", "output": "composite, S-Video, YPbPr component", "platform_logo": 252, "platform_version_release_dates": [94, 95, 96, 97], "resolutions": "480p, 480i, 576i", "slug": "initial-version-e8ec6a35-4303-4d7a-b1f7-b794a26b70ca", "sound": "Stereo, Dolby Surround", "storage": "512 MB NAND Flash memory, SD/SDHC card (up to 32 GB), GameCube memory card", "url": "https://www.igdb.com/platforms/wii/version/initial-version-e8ec6a35-4303-4d7a-b1f7-b794a26b70ca", "checksum": "44cb6e0b-77e6-3ac5-31c2-d4899f3acaf8"}, {"id": 136, "name": "Initial version", "platform_logo": 375, "slug": "initial-version", "url": "https://www.igdb.com/platforms/plato--1/version/initial-version", "checksum": "cc2ea1dc-21f8-e8ad-699e-7d058e744157"}, {"id": 190, "companies": [152], "connectivity": "Wi-Fi", "cpu": "67 MHz ARM9 and 33 MHz ARM7", "media": "Nintendo DS Game Card, Game Boy Advance Cartridge", "memory": "4 MB RAM, 256 KB flash memory", "name": "Nintendo DS Lite", "online": "Nintendo Wi-Fi Connection", "output": "Terminals for stereo headphones and a microphone.", "platform_logo": 119, "platform_version_release_dates": [225, 226, 227, 228], "slug": "nintendo-ds-lite", "sound": "Stereo speakers providing virtual surround sound, depending on the software.", "summary": "A lighter and slimmer version of the Nintendo DS. \nIt has improved brightness with 4 settings for the screen backlight. \nThe battery can last twice as long as the Nintendo DS on the lowest setting and lasts about 1-2 hours less on the highest setting, depending on the game being played.", "url": "https://www.igdb.com/platforms/nds/version/nintendo-ds-lite", "checksum": "00fcdee0-5931-0414-1c3f-38e9e379a888"}, {"id": 211, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8607/version/initial-version", "checksum": "c127fbbf-fb5d-369a-ac61-94e979f1c007"}, {"id": 201, "name": "tele-ball", "platform_logo": 127, "platform_version_release_dates": [240], "slug": "tele-ball", "summary": "MBO, a popular German electronics manufacturer, produced a large serie of pong systems. Though they had some cosmetic differences, all these systems were very close to each other in terms of functionality. \n \nThe Tele-Ball is the most basic system of the whole range, offering only the 4 classic pong games in black & white.", "url": "https://www.igdb.com/platforms/ay-3-8500/version/tele-ball", "checksum": "4080875f-fd79-8a8f-3f3d-45b5e372d78a"}, {"id": 425, "companies": [525], "cpu": "8-bit NEC μPD78214GC @12MHz; 8-bit Toshiba TMP87C800F @8MHz (Z80 derivative)", "graphics": "Asahi Kasei AK8000 - Audio / Video processor", "media": "CD-ROM", "name": "Initial version", "platform_logo": 532, "platform_version_release_dates": [542], "slug": "initial-version", "summary": "The Playdia (プレイディア, Pureidia) (developed under the codename \"BA-X\") is a fifth-generation home video game console released exclusively in Japan in 1994 at the initial price of ¥24,800. It was intended for a young audience and, like many consoles of the era (e.g. the LaserActive and the 3DO Interactive Multiplayer), was marketed more as a multimedia home entertainment system than as a dedicated gaming console, with anime quiz software and edutainment making up most of the game library.", "url": "https://www.igdb.com/platforms/playdia/version/initial-version", "checksum": "a4c04f7e-7235-fa0a-0737-2647a8aa8d0f"}, {"id": 233, "name": "Initial version", "platform_logo": 159, "slug": "initial-version", "url": "https://www.igdb.com/platforms/steam-vr/version/initial-version", "checksum": "4f3a00a3-4091-57c5-99c6-46125698a72f"}, {"id": 9, "companies": [58], "name": "Honeycomb 3.2", "platform_logo": 61, "platform_version_release_dates": [109], "slug": "honeycomb-3-2", "url": "https://www.igdb.com/platforms/android/version/honeycomb-3-2", "checksum": "0ccf80fc-d580-7b1c-daf0-dea272570bd7"}, {"id": 14, "companies": [246], "name": "Windows Vista", "platform_logo": 206, "platform_version_release_dates": [258], "slug": "windows-vista", "summary": "New features of Windows Vista include an updated graphical user interface and visual style dubbed Aero, a new search component called Windows Search, redesigned networking, audio, print and display sub-systems, and new multimedia tools including Windows DVD Maker", "url": "https://www.igdb.com/platforms/win/version/windows-vista", "checksum": "617aebed-744c-2494-a505-201fdec494a1"}, {"id": 22, "name": "Initial version", "slug": "initial-version-9ef509be-a00a-427e-9b78-93c4a10e04b6", "url": "https://www.igdb.com/platforms/arcade/version/initial-version-9ef509be-a00a-427e-9b78-93c4a10e04b6", "checksum": "4587ca51-3525-e434-26b2-9853250a1d01"}, {"id": 25, "cpu": "MOS 6502C @ 1,79 MHz", "media": "Atari Game cartridge", "memory": "16 KB", "name": "Initial version", "platform_logo": 304, "platform_version_release_dates": [62], "slug": "initial-version-e61f84a7-2907-4d65-af7d-4edf75c34dd7", "summary": "The release of the 5200 Supersystem in 1982 represented Atari's attempt to replace their outdated 2600 model and pull ahead of rival, high-quality platforms like Intellivison. By 1982, Atari game programmers realized that they were severely limited by the capabilities of the 2600 system.\n\nThe designers incorporated technology into the 5200 (called \"Pam\" in developmental stages) which they had just developed for their own 8-bit 400 and 800 series personal computer systems. The 5200 is basically a game console version of their home computer, substituting a controller in place of a keyboard.\n\nThe Intellivision system had raised the stakes in the gaming industry with its 16-position controller. Atari's own 2600 offered only 8 positions. In hopes of obliterating the competition, Atari designer, Craig Asher helped engineer the \"analog\" controller. It gives players full, 360° control of the action on-screen.\n\nThe 5200 controller contains two other features which made Atari's unique to any other system built by 1982: First, It offers speed variability. When a joystick is held in a single direction long enough, a player can increase his or her rate of on-screen movement. Second, it contains an easy-access PAUSE button, enabling players to easily freeze their games indefinitely. This immediately became a normal feature on most every subsequent system controller.\n\nUnfortunately there turned out to be a major drawback to this groundbreaking technology. The analog controllers never caught on with consumers because they are \"non-centering,\" meaning they do not feature a neutral position. There is no way to come to an immediate stop. This factor will tend to inflict a high level of frustration on any 5200 player who tackles a game which requires precision stopping and starting movements like Frogger or Pac-Man. The controllers were also apparently not made with durability in mind and are quite easily broken.\n\nWhen Atari released the 5200 it was incompatible with 2600 cartridges. Consumers who had loaded up on games for the 2600 were understandably reluctant to invest in an entirely new platform. Its initial retail price of $330 didn't cause units to fly off of the shelves either.\n\nThe 5200 also improved on the 2600 in its switch box. The 2600 system requires players to walk behind the television and change the setting on the box setting from TV to GAME. The 5200 automatically switches to GAME after the power is turned on. Also, when changing cartridges, the 5200 shifts to a black screen instead of the annoying, white noisy static players get between games with the 2600.\n\nWhen the platform was launched in 1982, Atari chose not to support it with any \"must have\" new titles. Instead they decided to re-release improved versions of former best seller for the 2600 like Space Invaders or Galaxian. Later, they did offer more sought-after titles like Joust, Space Dungeon and Ms. Pac-Man, but by that time the gaming market was on the verge of collapse.\n\nIn 1983, between: Atari (with the 5200 and 2600), ColecoVision and Intellivision, the VCS (Video Computer System) market was stuck in a glut due to an oversaturation of product. Consumers were also demanding that their computers perform more functions than just play games. At that point the Commodore 64 and Atari 800XL home computers had just been released.\n\nEven after a slow start, 1983 sales for the 5200 plummeted. Warner Communications (Atari's former parent company) reported second quarter losses of $283.4 million. By the end of the year, Atari had posted losses of $536 million. They ended production of the 5200 in 1984.", "url": "https://www.igdb.com/platforms/atari5200/version/initial-version-e61f84a7-2907-4d65-af7d-4edf75c34dd7", "checksum": "5a305c21-915f-5a36-8488-ee6ed6256025"}, {"id": 61, "name": "Initial version", "platform_logo": 279, "platform_version_release_dates": [356, 357, 358], "slug": "initial-version-9ec1965f-e8d3-4f68-9872-b6eb844b01c1", "summary": "The 32X is an add-on for the Sega Genesis video game console. Codenamed \"Project Mars\", the 32X was designed to expand the power of the Genesis and serve as a transitional console into the 32-bit era until the release of the Sega Saturn. Independent of the Genesis, the 32X uses its own ROM cartridges and has its own library of games. The add-on was distributed under the name Super 32X in Japan, Genesis 32X in North America, Mega Drive 32X in the PAL region, and Mega 32X in Brazil.", "url": "https://www.igdb.com/platforms/sega32/version/initial-version-9ec1965f-e8d3-4f68-9872-b6eb844b01c1", "checksum": "4ddeb0e1-9471-0ba2-24f8-579ec31f56a1"}, {"id": 279, "cpu": "MIPS R4000", "media": "Universal Media Disc", "memory": "64MB eDRAM", "name": "PlayStation Portable Street", "os": "PlayStation Portable system software", "platform_logo": 214, "platform_version_release_dates": [347, 348, 349, 350], "resolutions": "480 x 272", "slug": "playstation-portable-street", "sound": "Mono speaker, 3.5 mm headphone jack", "storage": "Memory Stick Duo, Memory Stick PRO Duo", "summary": "The PlayStation Portable Street (PSP-E1000) is a budget-focused model of the PlayStation Portable series.", "url": "https://www.igdb.com/platforms/psp/version/playstation-portable-street", "checksum": "f6abb06c-0faf-c71e-f91f-deb34a86ff69"}, {"id": 15, "companies": [243], "name": "Windows 8", "platform_logo": 204, "platform_version_release_dates": [256], "slug": "windows-8", "summary": "Windows 8 introduced major changes to the operating system's platform and user interface to improve its user experience on tablets, where Windows was now competing with mobile operating systems, including Android and iOS.", "url": "https://www.igdb.com/platforms/win/version/windows-8", "checksum": "7e3de1ff-12b0-e74f-b569-71c6255391a4"}, {"id": 209, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8605/version/initial-version", "checksum": "eb071edb-3a1f-c113-efbb-7655a35a03a6"}, {"id": 36, "cpu": "MOS 8502, Zilog Z80, (128) MOS 6510, MOS 8500 (64)", "name": "Initial version", "platform_logo": 300, "platform_version_release_dates": [321, 322], "slug": "initial-version-4bf2e43a-2f5c-4e9d-83d3-34db176557e1", "url": "https://www.igdb.com/platforms/c64/version/initial-version-4bf2e43a-2f5c-4e9d-83d3-34db176557e1", "checksum": "8cf34994-6542-f7f2-51ad-e770680a6741"}, {"id": 21, "name": "Initial version", "platform_logo": 315, "platform_version_release_dates": [135, 136, 137], "slug": "initial-version-071433c7-3175-44f5-9941-30ea1f42ff58", "url": "https://www.igdb.com/platforms/appleii/version/initial-version-071433c7-3175-44f5-9941-30ea1f42ff58", "checksum": "3e33acb3-248b-a07f-744b-abbffe989844"}, {"id": 100, "name": "Initial version", "platform_logo": 280, "platform_version_release_dates": [262], "slug": "initial-version", "url": "https://www.igdb.com/platforms/virtualboy/version/initial-version", "checksum": "66770934-c4f0-e449-dbf1-636554370b7e"}, {"id": 50, "companies": [302], "connectivity": "Mitsumi Wi-fi Adapter", "cpu": "Dual-Core ARM11 MPCore", "graphics": "DMP PICA200 GPU", "media": "Nintendo 3DS Game Card, SD/SDHC card", "memory": "128 MB FCRAM, 6 MB VRAM", "name": "Initial version", "online": "Nintendo Network", "os": "Nintendo 3DS OS", "platform_logo": 240, "platform_version_release_dates": [55, 56], "resolutions": "800x240 LCD screen (400x240 for each eye)", "slug": "initial-version-d60d8930-94fc-497f-8e0e-92644a02ab6a", "storage": "1GB internal flash memory, included 2 GB SD card", "url": "https://www.igdb.com/platforms/3ds/version/initial-version-d60d8930-94fc-497f-8e0e-92644a02ab6a", "checksum": "8b8b0c61-aaf9-4c18-3c1f-6170c332b907"}, {"id": 78, "companies": [281], "connectivity": "Wi-Fi IEEE 802.11n, Ethernet, 3 × USB 3.0, HDMI 1.4 in/out, S/PDIF out, IR-out, Kinect port", "cpu": "Custom 1.75 GHz AMD 8 core APU", "graphics": "853 MHz AMD Radeon GCN architecture", "media": "Blu-ray, DVD, CD", "memory": "8 GB DDR3", "name": "Initial version", "online": "Xbox Live", "os": "Xbox OS", "output": "HDMI", "platform_logo": 226, "platform_version_release_dates": [14], "resolutions": "4K, 1080p, 720p", "slug": "initial-version-94fdf5b4-d4d1-40de-87ee-54f90e15c944", "sound": "7.1 surround sound", "storage": "500 GB internal hard drive", "url": "https://www.igdb.com/platforms/xboxone/version/initial-version-94fdf5b4-d4d1-40de-87ee-54f90e15c944", "checksum": "c1ecde7f-8c7f-c5cd-6fbd-ad2a559706ad"}, {"id": 196, "companies": [163], "name": "Interton VC 4000", "platform_logo": 134, "platform_version_release_dates": [247], "slug": "interton-vc-4000", "summary": "The rather obscure VC 4000 Video Computer, manufactured by Interton company, is regarded as the only console entirely developed in (West-)Germany. Whether or not that is true will probably remain a secret as the system's (still existing) former distributor has scrapped any documentation of the product that nearly got the company into bankruptcy. Information on the internet about the console's development history, however, is often contradictionary, inaccurate and often blatantly false. \nFor instance, the most common and aggravating misconception is that the VC 4000 is \"based on\" the 1292 Advanced Programmable Video System, which supposedly was released as early as 1976! That would mean, that the technology used in the VC 4000 predates Atari's VCS by about a year and competes with Fairchild's Channel F for the title \"first 2nd generation video game system\". However, it is actually enough to compare the graphic capabilites of the two systems to realise that such information must be rubbish. So, here are some clarifying facts: \nBoth, the VC 4000 and the 1292 APVS, are built around the Signetics 2650 microprocessor, which was released in late 1975. That was around the same time when Philips had bought the Signetics company and shipped the technology over to Europe. At that time Philips' subsidary Magnavox was developing a system based on the arguably more powerful Intel 8048 microprocessor - that system would later become known as the G7000 (or Odyssey² in the USA). Having one hardware product already in development, Philips decided to treat the Signetics 2650 as commercial product, targeting small-sized electronic-manufacturers, who were already swarming the market with PONG-clones. \nConsidering that the VC 4000 is software-compatible (but not slot-compatible!) with the 1292 APVS, and considering that the two systems share the early half of their game library with identical game-titles implies the hypothesis that Philips sold both, the Signetics 2650 hardware and a certain number of developed ROM-software to two or three dozen companies, who developed, admittedly different, but ultimately compatible gaming systems, namely the VC 4000 and the 1292 Advanced Programmable Video System. The misconception that the 1292 APVS was released already in 1976 is probably owed to the - by now viral - misinformation that Radofin (the most prominent 1292 APVS manufacturer) released its first cosoles in 1976. These, however, were no microprocessored early wonder-machines, but plain PONG-clones. \nMore evidence to support this hypothesis is provided by a Swedish TV broadcast from April 1979, when a team from SVT (Swedish broadcast company) visited the Philips-reasearch-centre in Eindhoven, Netherlands to talk about the future of video games. Throught the video the developers are seen with VC 4000 controllers, testing game prototypes which graphicly correspond with games on the VC 4000/1292 APVS and not Philips' own home console, the Videopac G7000, \nAvailable evidence, primarly in the form of leaflets, suggests that German manufacturer Interton was indeed the first one to hit the market with a Signetics 2650 microprocessor-based gaming system in autumn 1978: the VC 4000. Leaflets for 1292 APVS consoles by Radofin, Acetronic and other companies would only appear in 1979.", "url": "https://www.igdb.com/platforms/vc-4000/version/interton-vc-4000", "checksum": "f267ebf6-0061-ccfc-2591-56d86a1b3182"}, {"id": 272, "companies": [414], "cpu": "Custom Nintendo 8 Bit CPU with 16 Bit instructions running at 4 MHz, coined “MINX” by Team Pokeme", "media": "Catridges", "memory": "4096 Bytes shared with the Video unit (if it’s activated)", "name": "Initial version", "online": "No", "platform_logo": 267, "platform_version_release_dates": [317, 318, 319, 320], "resolutions": "96×64 1bpp", "slug": "initial-version", "sound": "Single channel PWM sound (square wave) with three volume levels.", "summary": "The Pokémon mini is a handheld game console that was designed and manufactured by Nintendo and themed around the Pokémon media franchise. It is the smallest game system with interchangeable cartridges ever produced by Nintendo, weighing just under two and a half ounces (71 grams).", "url": "https://www.igdb.com/platforms/pokemon-mini/version/initial-version", "checksum": "77f62430-bad0-5711-0094-af0326905e17"}, {"id": 203, "name": "tele-ball III", "platform_logo": 129, "platform_version_release_dates": [242], "slug": "tele-ball-iii", "summary": "The Tele-Ball III is thus very similar to the original Tele-Ball or Tele-Ball II, offering only the 4 classic pong games in black & white. As usual with MBO, the different systems are quite different cosmectically, but very close in termes of functionality. \nThe dial on the front panel is used to select the different games. Then 6 switches are used to select the different game options. Two red buttons acts as Reset button and Manual Service.", "url": "https://www.igdb.com/platforms/ay-3-8500/version/tele-ball-iii", "checksum": "e6dcb510-e1c0-5a3c-421e-4405bf32762d"}, {"id": 124, "companies": [411], "name": "Windows 10", "platform_logo": 203, "platform_version_release_dates": [168], "slug": "windows-10", "summary": "Windows 10 (codenamed Threshold) is an operating system developed by Microsoft as part of the Windows NT family of operating systems. To encourage its adoption, Microsoft announced that during its first year of availability, Windows 10 would be made available free of charge to users of genuine copies of eligible editions of Windows 7 or Windows 8.1.\n\nWindows 10 introduces what Microsoft described as a \"universal\" application architecture; expanding on Metro-style apps, these apps can be designed to run across multiple Microsoft product families with nearly identical code—including PCs, tablets, smartphones, embedded systems, Xbox One, Surface Hub and HoloLens. Windows 10's user interface was revised to handle transitions between a mouse-oriented interface and a touchscreen-optimized interface based on available input devices—particularly on laplets; both interfaces include an updated Start menu that comprises a design similar to Windows 7 with 8's tiles. Windows 10 also introduces Task View, a virtual desktop system, the Microsoft Edge web browser and other new or updated applications, integrated support for fingerprint and face recognition login, new security features for enterprise environments, DirectX 12 and WDDM 2.0 to improve the operating system's graphics capabilities for games.", "url": "https://www.igdb.com/platforms/win/version/windows-10", "checksum": "62d8ae50-15a8-2ec6-19ce-460eeab66443"}, {"id": 220, "name": "Initial version", "platform_logo": 368, "slug": "initial-version", "url": "https://www.igdb.com/platforms/tatung-einstein/version/initial-version", "checksum": "5a7cdf33-8745-69ab-8b68-6d52d1b0978e"}, {"id": 128, "name": "Initial version", "platform_logo": 389, "slug": "initial-version", "url": "https://www.igdb.com/platforms/edsac--1/version/initial-version", "checksum": "7d7efda6-fb15-8c4d-d1a1-ebdad49fb4fb"}, {"id": 47, "companies": [355], "name": "Initial version", "platform_logo": 307, "platform_version_release_dates": [138], "slug": "initial-version-f668b6cc-cc55-403c-8fcb-66eaae82d89f", "url": "https://www.igdb.com/platforms/msx/version/initial-version-f668b6cc-cc55-403c-8fcb-66eaae82d89f", "checksum": "0b70cfaf-ed15-b919-0fca-433bb7041389"}, {"id": 204, "name": "tele-ball VII", "platform_logo": 130, "platform_version_release_dates": [243], "slug": "tele-ball-vii", "summary": "The chip included in the Tele-ball VII is dated from 1977 as the one included in the tele-ball I, II, III and IV. So maybe they made different shapes at the same time just to propose \"different products\" and to sell more.", "url": "https://www.igdb.com/platforms/ay-3-8500/version/tele-ball-vii", "checksum": "86e15070-357c-c281-cbf6-e71d37fd7f46"}, {"id": 118, "companies": [319], "cpu": "ARM9E", "media": "MMC", "name": "N-Gage QD", "online": "N-Gage Arena", "os": "Symbian OS 6.1 (Series 60)", "platform_logo": 258, "platform_version_release_dates": [143], "slug": "n-gage-qd", "storage": "MMC, 3.4 MB internal memory", "url": "https://www.igdb.com/platforms/ngage/version/n-gage-qd", "checksum": "66ae4b9f-debc-893b-b1f4-166d5a867553"}, {"id": 144, "companies": [97], "name": "Tiger", "platform_logo": 93, "platform_version_release_dates": [153], "slug": "tiger", "summary": "Mac OS X v10.4 Tiger is the fifth major release of Mac OS X, Apple's desktop and server operating system for Mac computers. Some of the new features included a fast searching system called Spotlight, a new version of the Safari web browser, Dashboard, a new ‘Unified’ theme, and improved support for 64-bit addressing on Power Mac G5s. Tiger shocked executives at Microsoft by offering a number of features, such as fast file searching and improved graphics processing, that Microsoft had spent several years struggling to add to Windows with acceptable performance. Apple announced a transition to Intel x86 processors during Tiger's lifetime, making it the first Apple operating system to work on Apple–Intel architecture machines.", "url": "https://www.igdb.com/platforms/mac/version/tiger", "checksum": "d8ed4d73-2caa-0d93-ba01-ca61e80dbf24"}, {"id": 145, "companies": [98], "name": "Leopard", "platform_logo": 94, "platform_version_release_dates": [154], "slug": "leopard", "summary": "Mac OS X Leopard (version 10.5) is the sixth major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. Leopard is the final version of Mac OS X to support the PowerPC architecture as Snow Leopard functions solely on Intel based Macs. According to Apple, Leopard contains over 300 changes and enhancements over its predecessor, Mac OS X Tiger, covering core operating system components as well as included applications and developer tools. Leopard introduces a significantly revised desktop, with a redesigned Dock, Stacks, a semitransparent menu bar, and an updated Finder that incorporates the Cover Flow visual navigation interface first seen in iTunes. Other notable features include support for writing 64-bit graphical user interface applications, an automated backup utility called Time Machine, support for Spotlight searches across multiple machines, and the inclusion of Front Row and Photo Booth, which were previously included with only some Mac models.", "url": "https://www.igdb.com/platforms/mac/version/leopard", "checksum": "35adfa95-ab64-6d15-f7fd-39af83d84fdc"}, {"id": 64, "cpu": "16/32-bit Motorola 68000", "graphics": "64 kB of video RAM", "memory": "72kB of RAM", "name": "Initial version", "online": "Sega Meganet (Japan)", "platform_logo": 293, "platform_version_release_dates": [189, 190, 191], "slug": "initial-version-19bd7841-4910-4844-b407-14cd6b55240b", "sound": "Stereo", "url": "https://www.igdb.com/platforms/smd/version/initial-version-19bd7841-4910-4844-b407-14cd6b55240b", "checksum": "7c711fe8-3105-4b8a-e324-3d04a2677680"}, {"id": 57, "cpu": "MIPS R3051 @ 33,8688 MHz", "media": "CD-ROM Discs, Playstation game disc", "name": "PlayStation 1", "output": "S-Video, Composite", "platform_logo": 278, "platform_version_release_dates": [58, 59, 60, 61], "slug": "playstation-1", "sound": "Stereo", "storage": "Playstation Memory Card", "summary": "The PlayStation (officially abbreviated as PS and commonly known as the PS1 or its codename PSX) is a home video game console developed and marketed by Sony Computer Entertainment. It was the first of the PlayStation lineup of video game consoles. As a fifth generation console, the PlayStation primarily competed with the Nintendo 64 and the Sega Saturn. The PlayStation was the first \"computer entertainment platform\" to ship over 100 million units, which it had reached nine years after its initial launch.", "url": "https://www.igdb.com/platforms/ps/version/playstation-1", "checksum": "f94fb6cb-14b7-49a6-ad10-071009eec2fd"}, {"id": 214, "name": "Initial version", "platform_logo": 366, "slug": "initial-version", "url": "https://www.igdb.com/platforms/pc-98/version/initial-version", "checksum": "2831c71d-bb7b-6e91-cde8-4f6067118591"}, {"id": 67, "name": "Original version", "platform_logo": 271, "slug": "original-version", "url": "https://www.igdb.com/platforms/sfam/version/original-version", "checksum": "c36a8752-9e4a-915a-5a51-55212912d024"}, {"id": 159, "cpu": "Hitachi HD68HC000 10 MHz (Motorola 68000 clone)", "graphics": "Sharp-Hudson Custom Chipset", "media": "5 1/4\" FDDs", "memory": "1MB ROM, 1-4 MB RAM (expandable to 12MB), 1056 KB VRAM, 16KB SRAM", "name": "Initial version", "os": "Human68k ver1.0", "platform_logo": 306, "platform_version_release_dates": [183], "resolutions": "several from 256×240 up to 1024×1024", "slug": "initial-version", "sound": "Yamaha YM2151, Yamaha YM3012 & Oki MSM6258", "storage": "optional SASI hard drive", "url": "https://www.igdb.com/platforms/sharp-x68000/version/initial-version", "checksum": "4641aa99-c36a-1865-2dd4-bb3fd55e75bc"}, {"id": 202, "name": "tele-ball II", "platform_logo": 128, "platform_version_release_dates": [241], "slug": "tele-ball-ii", "summary": "This is a nice looking system from MBO, a famous electronic brand from Munich. It doesn't look at all like the other pongs. An original shape for both the unit (quite triangular in depth) and the remote controllers which are largely curved. The best part is that it has absolutely no switch, only buttons to select the different options. This system was sold in Germany as all the texts on the box are in german.", "url": "https://www.igdb.com/platforms/ay-3-8500/version/tele-ball-ii", "checksum": "2eed6e30-4e86-67c5-acea-3f8cb5c826b7"}, {"id": 146, "companies": [99], "name": "Snow Leopard", "platform_logo": 95, "platform_version_release_dates": [155], "slug": "snow-leopard", "summary": "Mac OS X Snow Leopard (version 10.6) is the seventh major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. Unlike those of previous versions of Mac OS X, the goals of Snow Leopard were improved performance, greater efficiency and the reduction of its overall memory footprint. Much of the software in Mac OS X was extensively rewritten for this release in order to take advantage fully of modern Macintosh hardware. New programming frameworks, such as OpenCL, were created, allowing software developers to use graphics cards in their applications. This is also the first Mac OS release since System 7.1.1 that does not support Macs using PowerPC processors, as Apple now intends to focus on its current line of Intel-based products. As support for Rosetta was dropped in OS X Lion, Snow Leopard is the last version of Mac OS X that is able to run PowerPC-only applications. Snow Leopard is the last release of Mac OS X to support the 32-bit Intel Core Solo and Intel Core Duo CPUs.", "url": "https://www.igdb.com/platforms/mac/version/snow-leopard", "checksum": "ac20de9e-6781-af12-803c-35f5c4ecc1dd"}, {"id": 46, "name": "Initial version", "slug": "initial-version-49010d94-2573-43a2-999d-648049f79445", "url": "https://www.igdb.com/platforms/mobile/version/initial-version-49010d94-2573-43a2-999d-648049f79445", "checksum": "343e0c59-8068-caa3-ab93-8b5c84445edd"}, {"id": 184, "name": "Initial version", "platform_logo": 301, "slug": "initial-version", "url": "https://www.igdb.com/platforms/acorn-electron/version/initial-version", "checksum": "e6837567-958c-bd33-17c9-57126c1bbd5b"}, {"id": 81, "companies": [239], "cpu": "Main CPU processor: Motorola 68000 @ 12MHz, CPU co-processor: Zilog Z80 @ 4MHz", "media": "Cartridge", "name": "Initial version", "platform_logo": 70, "platform_version_release_dates": [311, 312, 313], "resolutions": "320x224", "slug": "initial-version-3c3779b9-d6d6-4bbf-bab6-b815fe4412ec", "sound": "Stereo up to 56KHz, 4 channels FM (4 operators + LFO) + 3 PSG + 1 noise + 7 4-bit ADPCM", "storage": "Removable memory card: 68-pin, JEIDA V3 compla, cross-compatible with the AES", "url": "https://www.igdb.com/platforms/neogeomvs/version/initial-version-3c3779b9-d6d6-4bbf-bab6-b815fe4412ec", "checksum": "4d056fd9-5646-1c49-73a4-a0332815d83f"}, {"id": 99, "cpu": "Hudson Soft HuC6280", "name": "Initial version", "platform_logo": 296, "platform_version_release_dates": [144, 145, 146], "slug": "initial-version", "url": "https://www.igdb.com/platforms/turbografx16--1/version/initial-version", "checksum": "fede3e3c-5696-c8dd-7ab7-6ac9f5b857e5"}, {"id": 49, "companies": [318], "connectivity": "HSCSD, GPRS, Bluetooth", "cpu": "ARM 920T @ 104 MHz", "media": "MMC", "name": "Nokia N-Gage Classic", "online": "N-Gage Arena", "os": "Symbian OS 6.1 (Series 60)", "platform_logo": 257, "platform_version_release_dates": [89], "slug": "nokia-n-gage-classic", "storage": "MMC, 3.4 MB Internal memory", "summary": "The launch model of the Nokia N-Gage with its taco-shaped design came out in mid 2003. It was known to be clumsy to hold and also a big pain to insert games into because of you having to remove the back cover and battery before you could insert the game disc. Another clumsy feature was the way the microphone and speaker was situated on the edge of the phone, many described this as talking into a ''Taco phone''.", "url": "https://www.igdb.com/platforms/ngage/version/nokia-n-gage-classic", "checksum": "9eb72d39-5dd6-385d-3e4a-0d8ec6d02c13"}, {"id": 188, "companies": [372], "connectivity": "Gigabit Ethernet, Wi-Fi 2.4GHz and 5GHz", "cpu": "8-core Jaguar CPU at 1.75GHz", "graphics": "12 CUs (914MHz) 1.23 TF GPU", "media": "Digital Downloads Only", "memory": "8GB DDR3 RAM", "name": "Xbox One S All-Digital", "online": "Xbox Live", "os": "Xbox OS", "output": "HDMI 2.0", "platform_logo": 329, "platform_version_release_dates": [351], "resolutions": "4K HDR video, 1080p HDR gaming", "slug": "xbox-one-s-all-digital", "sound": "7.1 surround sound", "storage": "1TB Hard Drive", "summary": "\"Go all digital with the Xbox One S All-Digital Edition and build a library of digital games that travels with you and is available in the cloud. Take your cloud saves on the go, and enjoy the ability to preorder and pre-install upcoming games so you’re ready to play the moment they launch.\"", "url": "https://www.igdb.com/platforms/xboxone/version/xbox-one-s-all-digital", "checksum": "24b2cfb5-9cd1-c7a3-329f-ecaaeadc1aff"}, {"id": 237, "companies": [409], "name": "Marshmallow", "platform_logo": 378, "platform_version_release_dates": [273], "slug": "marshmallow", "summary": "Versions 6.0 – 6.0.1", "url": "https://www.igdb.com/platforms/android/version/marshmallow", "checksum": "a2d745af-0d1e-e229-7552-31ee09324642"}, {"id": 424, "companies": [524], "cpu": "4-bit CPU Sharp SM5xx", "name": "Initial version", "output": "LCD screen", "platform_logo": 531, "platform_version_release_dates": [541], "slug": "initial-version", "summary": "The Game & Watch brand (called Tricotronic in West Germany and Austria, abbreviated as G&W) is a series of handheld electronic games developed, manufactured, released and marketed by Nintendo from 1980 to 1991. Created by game designer Gunpei Yokoi, each Game & Watch features a single game to be played on an LCD screen in addition to a clock, an alarm, or both.", "url": "https://www.igdb.com/platforms/game-and-watch/version/initial-version", "checksum": "c1c7fcbc-d9dc-e41d-68ec-cf14c1430aeb"}, {"id": 91, "name": "SG-1000", "platform_logo": 223, "platform_version_release_dates": [120], "slug": "sg-1000", "summary": "The SG-1000 is a home video game console manufactured by Sega and released in Japan, Australia, and other regions. It was Sega's first entry into the home video game hardware business. Introduced in 1983, the SG-1000 was released on the same day that Nintendo released the Family Computer in Japan. The SG-1000 was released in several forms, including the SC-3000 computer and the redesigned SG-1000 II released in 1984. A third iteration of the console, the Sega Mark III, was released in 1985, which provided a custom video display processor over previous iterations and served as the basis for the Master System in 1986, Sega's first internationally-released console.", "url": "https://www.igdb.com/platforms/sg1000/version/sg-1000", "checksum": "778575d7-e32f-1dda-7dae-70c9f8fc5bc8"}, {"id": 84, "companies": [327], "cpu": "16-bit NEC V30 MZ processor at 3.072 MHz", "name": "WonderSwan Color", "platform_logo": 265, "platform_version_release_dates": [98], "slug": "wonderswan-color", "storage": "Built-in EEPROM and 1Kbit RAM for backing up game data", "url": "https://www.igdb.com/platforms/wonderswan/version/wonderswan-color", "checksum": "dc3c8cfd-59f3-9f3f-6f39-69a6490f63fd"}, {"id": 73, "connectivity": "Wi-Fi IEEE 802.11 b/g/n. Bluetooth 4,0 and 4x USB 2,0", "cpu": "1,24 GHz Tri-Core IBM PowerPC ''Espresso''", "graphics": "550 MHz AMD Radeon ''Latte''", "media": "Wii U and Wii optical discs.", "memory": "2 GB DDR3 @ 1600MHz", "name": "Initial version", "online": "Nintendo Network", "os": "Wii U OS", "output": "Composite, S-Video, YPbPr component, RGB SCART, D-Terminal, HDMI", "platform_logo": 239, "platform_version_release_dates": [40, 41, 42], "resolutions": "480i, 480p, 720p, 1080i, 1080p", "slug": "initial-version-8d77ec4c-dc38-4fd8-a59a-5fbfcaea12ae", "sound": "5,1 Linear PCM, Dolby Surround (Wii mode)", "storage": "8 GB internal flash (Basic), 32 GB internal flash (Deluxe). USB mass storage device, SD/SDHC Card", "url": "https://www.igdb.com/platforms/wiiu/version/initial-version-8d77ec4c-dc38-4fd8-a59a-5fbfcaea12ae", "checksum": "de560447-b326-113c-69a0-c6a46715f55d"}, {"id": 171, "companies": [109], "name": "Odissea (Italian Export)", "platform_version_release_dates": [174], "slug": "odissea-italian-export", "summary": "Italian Export version of the Magnavox Odyssey.", "url": "https://www.igdb.com/platforms/odyssey--1/version/odissea-italian-export", "checksum": "ea40e639-b20e-72d5-8b0d-3348246ad7f1"}, {"id": 177, "companies": [119], "cpu": "Ricoh 5A22 @ 3.58 MHz", "media": "ROM cartridge", "memory": "128 KB", "name": "Super Famicom Jr. (Model SHVC-101)", "output": "Composite video and stereo audio", "platform_logo": 106, "platform_version_release_dates": [205], "resolutions": "256x224 to 512x448", "slug": "super-famicom-jr-model-shvc-101", "sound": "Nintendo S-SMP 8 channels, stereo, 64 KB", "summary": "Redesign of the original Super Famicom\nAKA Super Famicom Junior\nAKA SFC Jr", "url": "https://www.igdb.com/platforms/snes--1/version/super-famicom-jr-model-shvc-101", "checksum": "6c69c75e-1e11-64fd-7e06-71e34107b35d"}, {"id": 131, "name": "Initial version", "platform_logo": 369, "slug": "initial-version", "url": "https://www.igdb.com/platforms/hp3000/version/initial-version", "checksum": "bb541587-d858-1eea-897f-28254c8154b6"}, {"id": 135, "name": "Initial version", "platform_logo": 374, "slug": "initial-version", "url": "https://www.igdb.com/platforms/cdccyber70/version/initial-version", "checksum": "39ef0935-96ab-8cfa-946d-f94249e954d1"}, {"id": 509, "name": "Initial version", "platform_logo": 739, "slug": "initial-version", "url": "https://www.igdb.com/platforms/gear-vr/version/initial-version", "checksum": "5e8135ca-4bbf-ba6e-3d90-7611fb48ca24"}, {"id": 76, "companies": [326], "name": "Initial version", "platform_logo": 264, "platform_version_release_dates": [141], "slug": "initial-version-65f6a9f6-778c-4532-836e-c1712835544a", "url": "https://www.igdb.com/platforms/wonderswan/version/initial-version-65f6a9f6-778c-4532-836e-c1712835544a", "checksum": "c42fa15b-e0ff-c425-1460-75577ecd10a8"}, {"id": 140, "name": "Initial version", "platform_logo": 383, "platform_version_release_dates": [149], "slug": "initial-version", "summary": "OnLive was a Mountain View, California-based provider of cloud visualization technologies. OnLive's flagship product was its cloud gaming service, which allowed subscribers to rent or demo computer games without installing them on their device. Games were delivered to OnLive's client software as streaming video rendered by the service's servers, rather than rendered locally by the device. This setup allowed the games to run on computers and devices that would normally be unable to run them due to insufficient hardware, and also enabled other features, such as the ability for players to record and spectate gameplay. The service was available through clients for personal computers and mobile devices, as well as through smart TVs and a dedicated video game console-styled device known as the OnLive Game System. OnLive also expanded into the cloud desktop market with a sister product, OnLive Desktop—a subscription service offering a cloud-based instance of Windows Server 2008 R2 accessible via tablets.\n\nThe OnLive service received mixed reception. Critics noted that the video quality and amount of input lag varied on a game-by-game basis, and did not consider OnLive to be a complete substitute to owning games and playing them on local hardware due to these inconsistencies and other factors that prospective users may consider, such as the overall cost of the service as opposed to simply upgrading their existing computers. Critics praised the service for allowing users to demo games without the need to install them, along with its built-in spectator mode.\n\nOn April 2, 2015, it was announced that Sony Computer Entertainment had acquired OnLive's patents, and that all OnLive services would be discontinued on April 30, 2015. Sony operates PlayStation Now, a similar service built using the infrastructure of Gaikai, a former competitor to OnLive.", "url": "https://www.igdb.com/platforms/onlive-game-system/version/initial-version", "checksum": "28ad438c-d323-500c-b808-a4000a2e9be6"}, {"id": 149, "companies": [102], "name": "Mavericks", "platform_logo": 98, "platform_version_release_dates": [158], "slug": "mavericks", "summary": "OS X Mavericks (version 10.9) is the tenth major release of OS X, Apple Inc.'s desktop and server operating system for Macintosh computers. It was released as a free update. The update emphasized battery life, Finder improvements, other improvements for power users, and continued iCloud integration, as well as bringing more of Apple's iOS apps to OS X. Mavericks, which was named for the surfing location in California, was the first in the series of OS X releases named for places in Apple's home state; earlier releases used the names of big cats.", "url": "https://www.igdb.com/platforms/mac/version/mavericks", "checksum": "cece3695-0ed2-1eaa-be2d-253d7023fbdc"}, {"id": 5, "companies": [295], "connectivity": "Wi-Fi IEEE 802.11 b/g. Bluetooth 2,0 and 2x USB 2,0, Ethernet", "cpu": "3,2 GHz Cell Broadband Engine", "graphics": "550 MHz nVidia/SCEI RSX ''Reality Synthesizer''", "media": "Blu-ray, DVD, Compact Disc, Playstation Game disc, Digital distribution", "memory": "256 MB system, 256 MB video", "name": "Playstation 3 Slim", "online": "Playstation Network", "os": "XcrossMediaBar", "output": "S-Video, RGB Scart, YPAPR, D-Terminal, HDMI", "platform_logo": 238, "platform_version_release_dates": [165, 166, 167], "resolutions": "480i, 480p, 720p, 1080i, 1080p", "slug": "playstation-3-slim", "sound": "Dolby Digital, DTS, DTS-HD Master Audio, Dolby TrueHD", "storage": "120 GB, 250 GB", "summary": "Released in 2009 as an slimmer, quieter and re-designet version of the PS3. They also changed the font from the ''Spider-Man'' like PLAYSTATION 3 design to a more traditional Playstation look while also imprinting PS3 on the console surface instead of PLAYSTATION 3.", "url": "https://www.igdb.com/platforms/ps3/version/playstation-3-slim", "checksum": "230fa32c-1d27-0d06-f911-a243429bb192"}, {"id": 225, "companies": [172], "name": "Windows Phone 8", "platform_logo": 143, "platform_version_release_dates": [253], "slug": "windows-phone-8", "summary": "Windows Phone 8 is the second generation of the Windows Phone mobile operating system from Microsoft. Like its predecessor, it features a flat user interface based on Metro design language.", "url": "https://www.igdb.com/platforms/winphone/version/windows-phone-8", "checksum": "f74a426b-bf13-6de3-f536-a34dacc0d2ba"}, {"id": 221, "cpu": "Motorola 6809E @ 1 MHz", "graphics": "320×200 16 colors", "media": "Floppy disk", "memory": "32 KB RAM, 16 KB VRAM", "name": "Initial version", "os": "BASIC 1.0", "platform_logo": 537, "platform_version_release_dates": [545, 546], "slug": "initial-version", "summary": "The Thomson MO5 is a home computer introduced in France in 1984 to compete against systems such as the ZX Spectrum and Commodore 64. At the same time, Thomson also released the up-market Thomson TO7/70 machine. The MO5 was not sold in vast quantities outside France and was largely discontinued in favour of the improved Thomson MO6 in 1986. MO5s were also used as educational tools in French schools for a period.", "url": "https://www.igdb.com/platforms/thomson-mo5/version/initial-version", "checksum": "d1308f16-f5d9-d4d9-5c89-d0892d6d84fc"}, {"id": 160, "cpu": "VM labs Nuon MPE @ 333MHz", "graphics": "2x 3D Media GL MPE", "media": "DVD, CD-R", "memory": "32MB 8-bit Fast DRAM @ 33Mhz, 512KB sound RAM and 24KB programmable ROM", "name": "Initial version", "platform_logo": 268, "platform_version_release_dates": [192], "slug": "initial-version", "storage": "optional hardrive(up to 137GB)", "summary": "Nuon is a technology developed by VM Labs that adds features to a DVD player. In addition to viewing DVDs, one can play 3D video games and use enhanced DVD navigational tools such as zoom and smooth scanning of DVD playback. One could also play CDs while the Nuon graphics processor generates synchronized graphics on the screen. There were plans to provide Internet access capability in the next generation of Nuon-equipped DVD players.", "url": "https://www.igdb.com/platforms/nuon/version/initial-version", "checksum": "ee607d5c-6395-5e9c-c128-09540d0bf358"}, {"id": 62, "cpu": "Zilog Z80 @ 3.5MHz", "media": "Cartridges", "memory": "8kB", "name": "Initial version", "platform_logo": 287, "platform_version_release_dates": [185, 186, 187, 188], "resolutions": "160x144", "slug": "initial-version-23584cc8-ba5c-4175-86bf-4b784c45ec52", "sound": "Texas Instruments SN76489 PSG", "summary": "The Game Gear is an 8-bit fourth generation handheld game console released by Sega on October 6, 1990 in Japan, in April 1991 throughout North America and Europe, and during 1992 in Australia. The Game Gear primarily competed with Nintendo's Game Boy, the Atari Lynx, and NEC's TurboExpress. It shares much of its hardware with the Master System, and can play Master System games by the use of an adapter. Sega positioned the Game Gear, which had a full-color backlit screen with a landscape format, as a technologically superior handheld to the Game Boy.", "url": "https://www.igdb.com/platforms/gamegear/version/initial-version-23584cc8-ba5c-4175-86bf-4b784c45ec52", "checksum": "52ac0da3-b320-f082-05ac-11261916fd18"}, {"id": 235, "name": "Initial version", "platform_logo": 161, "slug": "initial-version", "url": "https://www.igdb.com/platforms/playstation-vr/version/initial-version", "checksum": "43fe1205-613a-7c45-a17a-c0cba1a69ecf"}, {"id": 236, "companies": [408], "name": "Lollipop", "platform_logo": 377, "platform_version_release_dates": [272], "slug": "lollipop", "summary": "Versions 5.0 - 5.1.1", "url": "https://www.igdb.com/platforms/android/version/lollipop", "checksum": "a7d30435-079f-498c-9f16-484697ef876c"}, {"id": 167, "companies": [537], "name": "Odyssey (Export)", "platform_logo": 545, "platform_version_release_dates": [171], "slug": "odyssey-export", "summary": "Export version of the Magnavox Odyssey. Shipped with manual in English, German and Spanish. The games Cat & Mouse, Haunted House, Roulette, and States were replaced with Wipeout and Volleyball. The game Football was replaced with Soccer.", "url": "https://www.igdb.com/platforms/odyssey--1/version/odyssey-export", "checksum": "738e9884-5e77-9f36-7264-df2b0e6fa863"}, {"id": 168, "companies": [539], "name": "Odyssey (German Export)", "platform_logo": 546, "platform_version_release_dates": [172], "slug": "odyssey-german-export", "summary": "German Export version of the Magnavox Odyssey. Shipped with the same games as the standard Export Version. Shipped with two German manuals. It is unknown why Magnavox exported this system to Germany at the same time as the ITT Odyssee.", "url": "https://www.igdb.com/platforms/odyssey--1/version/odyssey-german-export", "checksum": "0fcbec87-b478-6db1-b33e-19c775c1680b"}, {"id": 95, "name": "Super Nintendo (original European version)", "platform_logo": 272, "slug": "super-nintendo-original-european-version", "url": "https://www.igdb.com/platforms/snes--1/version/super-nintendo-original-european-version", "checksum": "010f76dc-7e25-1b55-c56b-194b4b82fddc"}, {"id": 218, "name": "Initial version", "platform_logo": 302, "slug": "initial-version", "url": "https://www.igdb.com/platforms/dragon-32-slash-64/version/initial-version", "checksum": "7527e302-f765-5875-071d-74bc0768b6e1"}, {"id": 219, "cpu": "Z80 @ 4 MHz; speed increased in later models", "memory": "256 or 512 KB", "name": "Initial version", "os": "CP/M Plus; custom GUI operating system", "platform_logo": 547, "platform_version_release_dates": [557], "slug": "initial-version", "summary": "The Amstrad PCW series is a range of personal computers produced by British company Amstrad from 1985 to 1998, and also sold under licence in Europe as the \"Joyce\" by the German electronics company Schneider in the early years of the series' life. The PCW, short for Personal Computer Word-processor, was targeted at the wordprocessing and home office markets. When it was launched the cost of a PCW system was under 25% of the cost of almost all IBM-compatible PC systems in the UK, and as a result the machine was very popular both in the UK and in Europe, persuading many technophobes to venture into using computers.", "url": "https://www.igdb.com/platforms/amstrad-pcw/version/initial-version", "checksum": "edd1aced-1151-70d9-4f18-85478d3a74fa"}, {"id": 147, "companies": [100], "name": "Lion", "platform_logo": 96, "platform_version_release_dates": [156], "slug": "lion", "summary": "Mac OS X Lion (version 10.7), marketed as OS X Lion, is the eighth major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. It brings many developments made in Apple's iOS, such as an easily navigable display of installed applications, to the Mac, and includes support for the Mac App Store, as introduced in Mac OS X Snow Leopard.", "url": "https://www.igdb.com/platforms/mac/version/lion", "checksum": "0e81de0e-b15d-9b18-1c5d-37c0d3868220"}, {"id": 158, "name": "Initial version", "platform_logo": 269, "platform_version_release_dates": [352, 353, 354], "slug": "initial-version", "summary": "The Neo Geo Pocket Color (also stylized as NEOGEOPOCKET COLOR, often abbreviated NGPC), is a 16-bit color handheld video game console manufactured by SNK. It is a successor to SNK's monochrome Neo Geo Pocket handheld which debuted in 1998 in Japan, with the Color being fully backward compatible. The Neo Geo Pocket Color was released on March 16, 1999 in Japan, August 6, 1999 in North America, and on October 1, 1999 in Europe, entering markets all dominated by Nintendo.", "url": "https://www.igdb.com/platforms/neo-geo-pocket-color/version/initial-version", "checksum": "072f9851-5319-eadc-91b3-6e1a44ecdc3f"}, {"id": 115, "name": "Initial version", "platform_version_release_dates": [553], "slug": "initial-version", "url": "https://www.igdb.com/platforms/pdp1/version/initial-version", "checksum": "3e8b8f96-6c0f-cb1f-85ef-f04db9c6a515"}, {"id": 16, "companies": [590], "connectivity": "56K Modem, 100Mbit Broadband Adapter", "cpu": "Hitachi SH4 32-bit RISC @ 200 MHz", "graphics": "100 MHz PowerVR2, integrated with the system's ASIC", "media": "CD, 1.2 GB GD-ROM", "memory": "16 MB RAM, 8 MB video RAM, 2 MB audio RAM", "name": "Initial version", "online": "SegaNet, GameSpy, Dreamarena", "os": "Custom Windows CE with DirectX API and dynamic-link libraries", "output": "VHF, Composite Video, S-Video, VGA, RF Modulator, RGB SCART", "platform_logo": 270, "platform_version_release_dates": [121, 122, 123, 124], "resolutions": "640x480, Progressive", "slug": "initial-version-62da4d4a-0faa-489f-bab1-a0ec26db72d9", "sound": "67 MHz Yamaha AICA with 32-bit ARM7 RISC CPU core, 64 channels", "storage": "128K VMU", "summary": "The Dreamcast is a home video game console released by Sega on November 27, 1998, in Japan, September 9, 1999, in North America, and October 14, 1999, in Europe. It was the first in the sixth generation of video game consoles, preceding Sony's PlayStation 2, Nintendo's GameCube, and Microsoft's Xbox. The Dreamcast was Sega's final home console, marking the end of the company's eighteen years in the console market. \n \nIn contrast to the expensive hardware of the unsuccessful Sega Saturn, the Dreamcast was designed to reduce costs with \"off-the-shelf\" components, including a Hitachi SH-4 CPU and an NEC PowerVR2 GPU. Released in Japan to a subdued reception, the Dreamcast enjoyed a successful U.S. launch backed by a large marketing campaign, but interest in the system steadily declined as Sony built hype for the upcoming PlayStation 2. Sales did not meet Sega's expectations despite several price cuts, and the company continued to incur significant financial losses. After a change in leadership, Sega discontinued the Dreamcast on March 31, 2001, withdrawing from the console business and restructuring itself as a third-party publisher. In total, 9.13 million Dreamcast units were sold worldwide. \n \nAlthough the Dreamcast had a short lifespan and limited third-party support, reviewers have considered the console ahead of its time. Its library contains many games considered innovative, including Crazy Taxi, Jet Set Radio, Phantasy Star Online, and Shenmue, as well as high-quality ports from Sega's NAOMI arcade system board. The Dreamcast was also the first console to include a built-in modular modem for internet support and online play.", "url": "https://www.igdb.com/platforms/dc/version/initial-version-62da4d4a-0faa-489f-bab1-a0ec26db72d9", "checksum": "b880975a-f8f6-9caa-ad5d-aa4b868570c4"}, {"id": 165, "companies": [361], "cpu": "Fairchild F8 at 1.79MHz", "graphics": "8 colors (either black/white or four color max. per line)", "media": "2 kB VRAM Cartridges", "memory": "64 bytes", "name": "Initial version", "output": "RF modulated composite video signal, cord hardwired to console", "platform_logo": 316, "platform_version_release_dates": [169, 175], "resolutions": "128x64 pixels", "slug": "initial-version", "sound": "120 Hz, 500 Hz and 1 kHz beeps (can be modulated to produce different tones)", "summary": "The Fairchild Channel F is a home video game console released by Fairchild Semiconductor in November 1976. It has the distinction of being the first programmable ROM cartridge–based video game console, and the first console to use a microprocessor. It was launched as the Video Entertainment System, or VES, but when Atari released their VCS the next year, Fairchild renamed its machine. By 1977, the Fairchild Channel F had sold 250,000 units and trailed behind the VCS.", "url": "https://www.igdb.com/platforms/fairchild-channel-f/version/initial-version", "checksum": "692b8969-62e7-ab05-7f9d-c91f2cddcab1"}, {"id": 8, "companies": [59], "name": "Gingerbread 2.3.3", "platform_logo": 62, "platform_version_release_dates": [110], "slug": "gingerbread-2-3-3", "url": "https://www.igdb.com/platforms/android/version/gingerbread-2-3-3", "checksum": "5dc8a075-11ed-40c1-6c88-a82d92cac368"}, {"id": 216, "cpu": "Motorola 6809E @ 0.895 MHz / 1.79 MHz", "graphics": "MC6847 Video Display Generator (VDG)", "memory": "4 KB / 16 KB / 32 KB / 64 KB / 128 KB / 512 KB", "name": "Initial version", "os": "Color BASIC 1.0 / 2.0 / OS-9", "platform_logo": 541, "platform_version_release_dates": [550], "slug": "initial-version", "summary": "The RadioShack TRS-80 Color Computer (later marketed as the Tandy Color Computer and sometimes nicknamed the CoCo) is a line of home computers based on the Motorola 6809 processor. The Tandy Color Computer line started in 1980 with what is now called the CoCo 1 and ended in 1991 with the more powerful CoCo 3. All three CoCo models maintained a high level of software and hardware compatibility, with few programs written for the older model being unable to run on the newer ones. \n \nDespite bearing the TRS-80 name, the Color Computer is a radical departure from the earlier TRS-80. In particular it has a Motorola 6809E processor, rather than the TRS-80's Zilog Z80. The machines in the Color Computer line are not compatible with software made for the earlier TRS-80.", "url": "https://www.igdb.com/platforms/trs-80-color-computer/version/initial-version", "checksum": "a0ee8357-7d8e-7041-65dd-8ec687f78d8b"}, {"id": 169, "name": "ITT Odyssee", "platform_logo": 322, "slug": "itt-odyssee", "summary": "One of two versions of the Magnavox Odyssey that was officialy licensed from Magnavox. The ITT Odyssee was the first home video game console released in Europe. Released only in Germany all of the text for the system (manuals, cards, etc) was changed to German. It is unknown how many were sold or why Magnavox released its own German version shortly after.", "url": "https://www.igdb.com/platforms/odyssey--1/version/itt-odyssee", "checksum": "2936d394-f592-9f35-2eda-f5a2c23c220c"}, {"id": 148, "companies": [101], "name": "Mountain Lion", "platform_logo": 97, "platform_version_release_dates": [157], "slug": "mountain-lion", "summary": "OS X Mountain Lion (version 10.8) is the ninth major release of OS X (formerly called Mac OS X), Apple Inc.'s desktop and server operating system for Macintosh computers. Named to signify its status as a refinement of the previous OS X version, Lion, Apple's stated aims in developing Mountain Lion were to allow users to more easily manage and synchronise content between multiple Apple devices and to make the operating system more familiar. The operating system gained the new malware-blocking system Gatekeeper and integration with Apple's online Game Center and iCloud services, while the Safari web browser was updated to version 6. As on iOS, Notes and Reminders became full applications, separate from Mail and Calendar, while the iChat application was replaced with a version of iOS's Messages. Mountain Lion also added a version of iOS's Notification Center, which groups updates from different applications in one place.", "url": "https://www.igdb.com/platforms/mac/version/mountain-lion", "checksum": "49d004c2-b4ba-e954-cefc-6f55368ceb15"}, {"id": 155, "cpu": "16/32-bit Philips 68070 CISC Chip @ 15.5 MHz", "graphics": "Philips SCC66470", "media": "CD-i, Audio CD, CD+G, Karaoke CD, VCD", "memory": "1MB RAM", "name": "Initial version", "os": "CD-RTOS (based on Microware's OS-9)", "platform_logo": 288, "platform_version_release_dates": [193, 194], "resolutions": "384×280 to 768×560", "slug": "initial-version", "sound": "MCD 221", "url": "https://www.igdb.com/platforms/philips-cd-i/version/initial-version", "checksum": "0c1e8563-cd6c-acf1-5371-f269278b5260"}, {"id": 102, "name": "Initial version", "platform_logo": 314, "slug": "initial-version", "url": "https://www.igdb.com/platforms/microvision--1/version/initial-version", "checksum": "32a0f46a-4ef0-cede-1293-61950306bb71"}, {"id": 38, "media": "Floppy Disk", "name": "Initial version", "platform_logo": 299, "platform_version_release_dates": [125], "slug": "initial-version-c99a4073-0ce0-49d1-afcf-4e9ff7cd7ade", "url": "https://www.igdb.com/platforms/fds/version/initial-version-c99a4073-0ce0-49d1-afcf-4e9ff7cd7ade", "checksum": "ee15f73b-d8a5-36f1-6335-e2248ded4b0b"}, {"id": 179, "companies": [290], "connectivity": "Super-Speed USB (USB 3.1 Gen.1) port × 3, AUX port × 1, Ethernet (10BASE-T, 100BASE-TX, 1000BASE-T)×1, IEEE 802.11 a/b/g/n/ac, Bluetooth® 4.0 (LE)", "cpu": "x86-64 AMD \"Jaguar,\" 8 cores", "graphics": "4.20 TFLOPS, AMD Radeon™ based graphics engine", "media": "BD × 6 CAV, DVD × 8 CAV", "memory": "GDDR5 8GB", "name": "PlayStation 4 Pro", "online": "PlayStation Network", "os": "Orbis OS", "platform_logo": 231, "platform_version_release_dates": [207], "resolutions": "capable of running at up to 4K (3840 x 2160 pixels, also known as “2160p”) resolution", "slug": "playstation-4-pro", "storage": "1 tb", "summary": "Also Known as the PS4 Neo and PS4.5\n\n\"PS4 Pro is a high-end version of PS4 that is capable of outputting 4K graphics, HDR support, smoother and more stable framerates, and 4K video streaming. Upon its launch, PS4 Pro will make supported PS4 games look better and run more smoothly, while giving developers an upgraded toolset to create even richer, more detailed game worlds. How these powerful new tools are used is up to individual developers and the experience they are creating.\"", "url": "https://www.igdb.com/platforms/ps4--1/version/playstation-4-pro", "checksum": "1663bed9-c084-4ffa-67f6-ce8197d0c034"}, {"id": 427, "companies": [531], "cpu": "TMS9900 @ 3 MHz", "graphics": "TMS9918A", "memory": "16 KB RAM 256 bytes scratchpad RAM", "name": "Texas Instruments TI-99/4A", "os": "TI BASIC", "platform_logo": 540, "platform_version_release_dates": [549], "slug": "texas-instruments-ti-99-slash-4a", "summary": "The Texas Instruments TI-99/4A is a home computer released in June 1981 in the United States. It is an enhanced version of the less successful TI-99/4 which was released in late 1979.", "url": "https://www.igdb.com/platforms/ti-99/version/texas-instruments-ti-99-slash-4a", "checksum": "b611731b-230f-ec6b-42f5-c6be0fc3ce3b"}, {"id": 354, "name": "Initial version", "platform_version_release_dates": [544], "slug": "initial-version", "summary": "The Sol-20 was the first fully assembled microcomputer with a built-in keyboard and television output, what would later be known as a home computer. The design was a combination of an Intel 8080-based motherboard, a VDM-1 graphics card, the 3P+S I/O card to drive a keyboard, and circuitry to connect to a cassette deck for program storage. Additional expansion was available via five S-100 bus slots at the back of the machine. It also included swappable ROMs with a rudimentary operating system.", "url": "https://www.igdb.com/platforms/sol-20/version/initial-version", "checksum": "f181f827-4319-391c-0878-713f927f3818"}, {"id": 80, "cpu": "MC68000 @ 12.5 MHz", "media": "CD-ROM, CD+G", "name": "Initial version", "platform_logo": 284, "platform_version_release_dates": [21, 22, 23, 24, 25], "slug": "initial-version-4a139f68-37d5-4cda-977a-77d29be274dd", "storage": "Internal RAM", "url": "https://www.igdb.com/platforms/segacd/version/initial-version-4a139f68-37d5-4cda-977a-77d29be274dd", "checksum": "823d3ec0-0d73-bd24-ea38-4d52de8ed26a"}, {"id": 70, "cpu": "Motorola MC68A09 @ 1.5 MHz", "graphics": "MOS 6522 Versatile Interface Adapter (VIA)", "media": "ROM cartridge", "memory": "1 kB (two 4-bit 2114 chips)", "name": "Vectrex", "platform_logo": 305, "platform_version_release_dates": [103, 104, 105], "slug": "vectrex", "sound": "General Instrument AY-3-8912", "summary": "The Vectrex is a vector display-based home video game console that was developed by Western Technologies/Smith Engineering. It was licensed and distributed first by General Consumer Electronics (GCE), and then by Milton Bradley Company after its purchase of GCE. Unlike other non-portable video game consoles, which connected to televisions and rendered raster graphics, the Vectrex has an integrated vector monitor which displays vector graphics. The Vectrex is monochrome and uses plastic screen overlays to simulate color and various static graphics and decorations", "url": "https://www.igdb.com/platforms/vectrex/version/vectrex", "checksum": "a843953b-c191-fae3-b05d-fc616d746ddb"}, {"id": 172, "cpu": "TMS9900 @ 3 MHz", "graphics": "TMS9918", "name": "Texas Instruments TI-99/4", "platform_logo": 539, "platform_version_release_dates": [548], "slug": "texas-instruments-ti-99-slash-4", "url": "https://www.igdb.com/platforms/ti-99/version/texas-instruments-ti-99-slash-4", "checksum": "fa1ab443-9e4c-577e-ff87-3369a14df675"}, {"id": 152, "companies": [489], "cpu": "Motorola 68EC020 @ 14.18 MHz (PAL), 14.32 MHz (NTSC)", "graphics": "RF modulator (RCA) / Composite video (RCA) / S-Video / 24-bit colour palette (16.8 million colors)", "memory": "2 MB Chip RAM", "name": "Initial version", "os": "AmigaOS 3.1", "output": "Headphone jack 3.5 mm /  2 × Mouse/Gamepad ports / RS-232 serial AUX port and for keyboard / Expansion slot behind a plate / Power input / RF audio/video out (RCA) /  S-Video out / Composite video out (RCA) / Audio out Left & Right (2 × RCA)", "platform_logo": 283, "platform_version_release_dates": [506], "resolutions": "From 320×200 to 1280×400i (NTSC) / From 320×256 to 1280×512i (PAL)", "slug": "initial-version", "sound": "4 × 8-bit PCM channels / Stereo audio (RCA)", "storage": "1 MB Kickstart ROM with CD32 firmware / 1 KB non-volatile EEPROM", "summary": "The Amiga CD32, code-named \"Spellbound\", is a 32 bit home video game console developed by Commodore and released in western Europe, Australia, Canada and Brazil. It was first announced at the Science Museum in London on July 16, 1993, and was released in September of the same year. \n \nThe CD32 is part of a family of Amiga computers and other hardware. It uses CD-ROM as its storage medium. It was based on Commodore's Advanced Graphics Architecture chipset, and is of similar specification to the Amiga 1200 computer. Using third party devices, it is possible to upgrade the CD32 with keyboard, floppy drive, hard drive, RAM and mouse, turning it into the equivalent of an Amiga 1200 personal computer. A hardware MPEG decompression module for playing Video CD was also released. \n \nIn the Christmas period following its launch, the CD32 accounted for 38% of all CD-ROM drive sales in the UK, exceeding sales of the Mega-CD; however, it was soon overshadowed by CD-ROM based games consoles from other companies, and was discontinued as Commodore went into bankruptcy.", "url": "https://www.igdb.com/platforms/amiga-cd32/version/initial-version", "checksum": "93e467c3-b4c0-7723-a733-3d066c10ab2e"}, {"id": 101, "companies": [362], "name": "Odyssey (US)", "platform_logo": 318, "platform_version_release_dates": [170], "slug": "odyssey-us", "summary": "The Magnavox Odyssey was the very first home video game system. Created by Ralph Baer (\"The Father of home video games\"). The system was released in May 1972 and reportedly sold over 100,000 units that year.\n\nThe Odyssey is made of transistors, resistors, and capacitors. There are no real hardware \"specs\". Odyssey used cards that contained pin outs to change game settings.  Plastic overlays that could be placed over the TV screen created graphics and color, but the actual display consisted of white squares (Paddle and ball) on an all black background.\n\nThis version was sold only in Magnavox stores.", "url": "https://www.igdb.com/platforms/odyssey--1/version/odyssey-us", "checksum": "d6c56d30-9670-d057-49d7-f59d0e9ee508"}, {"id": 143, "companies": [96], "name": "Panther", "platform_logo": 92, "platform_version_release_dates": [152], "slug": "panther", "summary": "Mac OS X Panther (version 10.3) is the fourth major release of Mac OS X, Apple’s desktop and server operating system. It had features such as a refined brushed metal interface, fast user switching, Exposé tool for window management, built-in X11 support and on-the-fly user home folder encryption and decryption.", "url": "https://www.igdb.com/platforms/mac/version/panther", "checksum": "f5c4bb9b-d987-692c-23cd-a180dbedfef9"}, {"id": 142, "companies": [95], "name": "Jaguar", "platform_logo": 91, "platform_version_release_dates": [151], "slug": "jaguar", "summary": "Mac OS X version 10.2 Jaguar is the third major release of Mac OS X, Apple's desktop and server operating system. The operating system was generally well received by most Mac users as a large step forward in the areas of stability, general speed enhancements, compatibility with other flavors of Unix and the lineup of both graphical and terminal applications available; however, many critics still claimed that significant user interface speed issues existed and that the operating system was still a big step down from Mac OS 9. Jaguar was the first Mac OS X release to publicly use its code name in marketing and advertisements, a practice that has continued in subsequent releases of the operating system.", "url": "https://www.igdb.com/platforms/mac/version/jaguar", "checksum": "9d953f7c-a069-27a4-785f-ed0b41278f62"}, {"id": 4, "connectivity": "Wi-Fi IEEE 802.11 b/g. Bluetooth 2,0 and 2x USB 2,0, Ethernet", "cpu": "3,2 GHz Cell Broadband Engine", "graphics": "550 MHz nVidia/SCEI RSX ''Reality Synthesizer''", "media": "Blu-ray, DVD, Compact Disc, Playstation Game disc, Playstation 2 game disc, Super Audio CD, Digital distribution", "memory": "256 MB system, 256 MB video", "name": "Playstation 3 Original", "online": "Playstation Network", "os": "XcrossMediaBar", "platform_logo": 237, "platform_version_release_dates": [3, 4, 5], "resolutions": "480i, 480p, 720p, 1080i, 1080p", "slug": "playstation-3-original", "sound": "Dolby Digital, DTS", "storage": "20 GB, 40 GB, 60 GB, 80 GB, 120 GB", "summary": "Launch model released in 2006, commonly known as the PS3 Fat", "url": "https://www.igdb.com/platforms/ps3/version/playstation-3-original", "checksum": "f8808442-b044-1882-a33e-e57f5920c936"}, {"id": 42, "cpu": "GI CP1610", "media": "ROM cartridge", "name": "Initial version", "online": "PlayCable", "platform_logo": 312, "platform_version_release_dates": [99, 100, 101], "slug": "initial-version-c9a95eb1-f299-40fe-8ea5-38561de50c23", "url": "https://www.igdb.com/platforms/intellivision/version/initial-version-c9a95eb1-f299-40fe-8ea5-38561de50c23", "checksum": "71952246-8b3e-f237-e8c2-3cde963f98b8"}, {"id": 133, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/call-a-computer/version/initial-version", "checksum": "265b712a-6542-5e65-f4c2-8fd16ba2a7a6"}, {"id": 138, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/microcomputer--1/version/initial-version", "checksum": "3839c5ce-f6c1-3960-ff43-8024ed23248b"}, {"id": 210, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8606/version/initial-version", "checksum": "af8ec5a1-ce96-fbb3-8a95-2ac81a659af7"}, {"id": 34, "companies": [35], "name": "Initial version", "platform_logo": 40, "platform_version_release_dates": [68], "slug": "initial-version-d71a6afd-592a-42e8-8e07-1840a9f74687", "url": "https://www.igdb.com/platforms/blackberry/version/initial-version-d71a6afd-592a-42e8-8e07-1840a9f74687", "checksum": "d1c097dc-443e-520f-4775-83619c8c187e"}, {"id": 43, "companies": [311, 312], "name": "Initial version", "platform_logo": 248, "platform_version_release_dates": [63], "slug": "initial-version-7c777fb0-182a-4db6-a04e-ceaa99c240b2", "summary": "iOS is Apples mobile operating system for the iPhone, iPod Touch, iPad, iPad Mini and so on. It was first introduced in 2006 as iPhone OS but they later changed it to its current name iOS.", "url": "https://www.igdb.com/platforms/ios/version/initial-version-7c777fb0-182a-4db6-a04e-ceaa99c240b2", "checksum": "21304bb8-5c13-a6e5-74c2-e137b7764ccd"}, {"id": 53, "companies": [286], "cpu": "Ricoh 2A03 at 1.79 MHz", "graphics": "Custom Ricoh Picture Processing Unit (PPU)", "media": "Nintendo Entertainment System Game Pak", "memory": "2 KiB", "name": "Initial version", "online": "Famicom Modem (Japan only)", "output": "RF, composite", "platform_logo": 228, "platform_version_release_dates": [195, 196, 197, 198, 199], "slug": "initial-version-910b4439-ecb8-404f-8e5f-791e43ccf889", "sound": "CPU-integrated programmable sound generator (5 mono channels)", "summary": "The Nintendo Entertainment System (commonly abbreviated as NES) is an 8-bit home video game console that was developed and manufactured by Nintendo. It was initially released in Japan as the Family Computer (Japanese: ファミリーコンピュータ Hepburn: Famirī Konpyūta?) (also known by the portmanteau abbreviation Famicom (ファミコン Famikon?) and abbreviated as FC) on July 15, 1983, and was later released in North America during 1985, in Europe during 1986, and Australia in 1987. In South Korea, it was known as the Hyundai Comboy (현대 컴보이 Hyeondae Keomboi) and was distributed by SK Hynix which then was known as Hyundai Electronics. It was succeeded by the Super Nintendo Entertainment System.", "url": "https://www.igdb.com/platforms/nes/version/initial-version-910b4439-ecb8-404f-8e5f-791e43ccf889", "checksum": "564f2119-9767-4ee8-d3a3-28409553ae08"}, {"id": 183, "name": "Initial version", "platform_logo": 112, "platform_version_release_dates": [215, 216], "slug": "initial-version", "summary": "The Videopac used the standard joystick design of the 1970s and early 1980s: the original console had a moderately-sized silver controller, held in one hand, with a square housing for its eight-direction stick that was manipulated with the other hand. Later releases had a similar black controller, with an 8-pointed star-shaped housing for its eight-direction joystick. In the upper corner of the joystick was a single 'Action' button, silver on the original controllers and red on the black controllers. The games, graphics and packaging were designed by Ron Bradford and Steve Lehner.\n\nOne other difference in these controllers is that the earliest releases of the silver joystick were removable. They could be plugged and unplugged from the back of the unit, while all later silver and all black controllers were hardwired into the rear of the unit itself (although the joysticks still can be easily replaced, but not without dismounting the cover deck).\n\nOne of the strongest points of the system was its speech synthesis unit, which was released as an add-on for speech, music, and sound effects enhancement. The area that the Odyssey² may be best remembered for was its pioneering fusion of board and video games: The Master Strategy Series. The first game released was Quest for the Rings!, with gameplay somewhat similar to Dungeons &amp; Dragons, and a storyline reminiscent of J. R. R. Tolkien's The Lord of the Rings. Later, two other games were released in this series, Conquest of the World and The Great Wall Street Fortune Hunt, each with its own gameboard.\n\nIts graphics and few color choices, compared to its biggest competitors at the time—the Atari 2600, Mattel's Intellivision and the Bally Astrocade—were its \"weakest point\". Of these systems, the Odyssey² was listed by Jeff Rovin as being the third in total of sales, and one of the seven major video game suppliers.", "url": "https://www.igdb.com/platforms/philips-videopac-g7000/version/initial-version", "checksum": "03a6bf6c-bcd0-0af7-cea0-cb856b1be9c2"}, {"id": 192, "companies": [308], "connectivity": "Wi-FI", "cpu": "ARM9 clocked at 133 MHz and ARM7 clocked at 33 MHz", "media": "Nintendo DS Cartridge, Nintendo DSi Cartridge", "memory": "16 MB PSRAM", "name": "Nintendo DSi XL", "online": "Nintendo Wi-Fi Connection, Nintendo DSi Shop, Nintendo Zone", "platform_logo": 245, "platform_version_release_dates": [234, 235, 236, 237], "resolutions": "256x192 pixel resolution", "slug": "nintendo-dsi-xl", "storage": "256 MB internal flash memory, SD card (up to 2gb), SDHC card (up to 32gb)", "summary": "The extra large version of the Nintendo DSi. \nThe system itself is larger overall than the other Nintendo DS versions. \nThe screens are larger than the Nintendo DSi, at 4.2-inch (110 mm), and have a larger viewing angle than the other versions allowing people around the main user to easily view the game being played. \nThe system came with an extra stylus that did not fit into the system and was made in the style of a pen.", "url": "https://www.igdb.com/platforms/nds/version/nintendo-dsi-xl", "checksum": "4d5c7b38-5c03-67a0-85fb-e91e67d207bf"}, {"id": 276, "connectivity": "Wi-Fi 802.11b", "cpu": "MIPS R4000", "media": "Universal Media Disc, digital distribution", "memory": "64MB eDRAM", "name": "PlayStation Portable Slim & Lite", "online": "PlayStation Network", "os": "PlayStation Portable system software", "platform_logo": 211, "platform_version_release_dates": [336, 337, 338, 339], "resolutions": "480 x 272", "slug": "playstation-portable-slim-and-lite", "sound": "Stereo speakers, 3.5 mm headphone jack", "storage": "Memory Stick Duo, Memory Stick PRO Duo", "summary": "The PSP-2000, which was marketed as the \"PlayStation Portable Slim & Lite\", is the first redesign of the PlayStation Portable. It is slimmer and lighter than the original PSP, reduced from 0.91 to 0.73 inches (23 to 18.6 mm) and from 9.87 to 6.66 ounces (280 to 189 g). \n \nThe serial port was modified to accommodate a new video-out feature, making it incompatible with older PSP remote controls. Games only output to external monitors and televisions in progressive scan mode. Non-game video outputs work in either progressive or interlaced mode. USB charging was introduced and the D-Pad was raised in response to complaints of poor performance and the responsiveness of the buttons was improved. \n \nOther changes include improved WLAN modules and micro-controller, and a thinner and much brighter LCD screen. To improve the poor loading times of UMD games on the original PSP, the internal memory was doubled from 32MB to 64MB, part of which now acting as a cache, also improving the web browser's performance.", "url": "https://www.igdb.com/platforms/psp/version/playstation-portable-slim-and-lite", "checksum": "32319fe4-0fe6-8578-fcdb-efa21c278331"}, {"id": 39, "companies": [334], "connectivity": "2 Game Boys can be linked together via built-in serial ports, up to 4 with a DMG-07 4-player adapter. And 16 in maximum.", "cpu": "Sharp LR35902 @ 4,19 MHz", "graphics": "160x144 pixels, 66 mm (2.6 in) diagonal screen with 2-bit (4 shades of \"gray\" {light to very dark olive green})", "media": "Game Boy Cartridge", "memory": "8 KB S-RAM", "name": "Initial version", "platform_logo": 275, "platform_version_release_dates": [73, 74, 75], "slug": "initial-version-831971f0-0222-4373-ba03-1acf8274b991", "sound": "2 pulse wave generators, 1 PCM 4-bit wave sample (64 4-bit samples played in 1×64 bank or 2×32 bank) channel, 1 noise generator, and one audio input from the cartridge", "storage": "8 MB", "url": "https://www.igdb.com/platforms/gb/version/initial-version-831971f0-0222-4373-ba03-1acf8274b991", "checksum": "65a0126e-8fb6-2ba3-5789-ea36fd37852a"}, {"id": 392, "companies": [540], "cpu": "32-Bit NEC V810 RISC running at 21.5 to 25  MHz., 15.5 MIPS", "graphics": "Internal color format: Digitized Y'UV (not YCbCr), Maximum On-screen colors: 16,777,216 (24-bit color, 8 bits per channel), 6 background layers, 2 sprite layers, 1 motion decoder layer generated from RLE-encoded or JPEG-like data", "media": "2X CD-ROM, 300KB / Sec", "memory": "2 MB main RAM, 1 MB shared RAM (for background generators, CD-ROM DMA, motion decoder, and ADPCM), 256 KB dedicated VRAM (for HuC6270 chips), 1 MB OS ROM, 256 KB CD Buffer, 32 KB back-up RAM", "name": "Initial version", "output": "Composite and S-Video", "platform_logo": 548, "platform_version_release_dates": [540], "resolutions": "256x240p, 341x240p, 256x480i, 341x480i", "slug": "initial-version", "sound": "16-Bit Stereo CD-DA 2 ADPCM channels at up to ≈31.5 kHz with left/right panning, 6 5-bit sample channels with left/right panning, Audio out: × 2 RCA", "summary": "The PC-FX is a 32-bit home video game console made by NEC Home Electronics. It was released in Japan on December 23, 1994, just weeks after Sony's PlayStation and a month after the Sega Saturn. It is the successor to the PC Engine, known as TurboGrafx-16 in North America.", "url": "https://www.igdb.com/platforms/pc-fx/version/initial-version", "checksum": "59aedda4-efe0-861c-ea6c-3ff0f828d57a"}, {"id": 54, "companies": [323], "connectivity": "Nintendo GameCube Broadband Adapter", "cpu": "IBM PowerPC ''Gekko'' @ 485 MHz", "graphics": "ATI ''Flipper'' @ 162 MHz", "media": "Nintendo GameCube game disc", "memory": "24MB", "name": "Initial version", "online": "Various game-specific services", "os": "Dolphin OS", "output": "Composite, S-Video, YPbPr component, RGB component (Japan only)", "platform_logo": 262, "platform_version_release_dates": [48, 49, 51, 179], "resolutions": "240i, 240p (no games use these), 480i, 480p (only some games support 480p), 576i (PAL)", "slug": "initial-version-87dfdafa-bcbc-466c-8286-cc8cccf4daa3", "sound": "64 ADPCM channels, analog stereo w/ Dolby Pro Logic II (Dolby Surround)", "storage": "Nintendo GameCube Memory Card (8MB-16MB Capacity)", "summary": "The GameCube is the first Nintendo console to use optical discs for its primary storage medium. The discs are similar to the miniDVD format, and as a result of their smaller size, the system was not designed to play standard DVDs or audio CDs. Nintendo presents a variety of connectivity options for the GameCube. It supports online gaming for a small number of games via the broadband or modem adapter, sold separately; it also connects to the Game Boy Advance, allowing players to access exclusive in-game features using the handheld as a second screen and controller.\n\nContemporary reception of the GameCube was generally positive. Some praised the extensive software library and high-quality games, while others criticized the console's exterior design and lack of features. Nintendo sold 21.74 million GameCube units worldwide before being discontinued in 2007. Its successor, the Wii, was released in November 2006.", "url": "https://www.igdb.com/platforms/ngc/version/initial-version-87dfdafa-bcbc-466c-8286-cc8cccf4daa3", "checksum": "f8179178-799a-7e95-4315-0ee24be6b355"}, {"id": 185, "companies": [234], "cpu": "8-core AMD custom CPU", "graphics": "Integrated AMD graphics with 6 teraflops of performance", "name": "Xbox One X", "online": "Xbox Live", "os": "Xbox OS", "platform_logo": 196, "platform_version_release_dates": [249], "resolutions": "up to 4k", "slug": "xbox-one-x--1", "summary": "Announced as Project Scorpio, it is the next version of the Xbox One.  \nAdvertised as having \"true 4k gaming\" with 6 teraflops of GPU processing power and 320gb/s memory bandwidth. Planned for release at the end of 2017.", "url": "https://www.igdb.com/platforms/xboxone/version/xbox-one-x--1", "checksum": "c1933401-ce01-d5df-f809-a02ecca4f2ea"}, {"id": 187, "companies": [338], "cpu": "Motorola 68000 running at 12 MHz with a Zilog Z80 running at 4 MHz Co-processor", "media": "CD-ROM (1x), 700 MB", "memory": "7Mb of DRAM; 512K of VRAM; and 64K of SRAM", "name": "Initial version", "platform_logo": 281, "platform_version_release_dates": [219, 220, 221], "resolutions": "304 x 224", "slug": "initial-version", "sound": "13-channel Yamaha sound chip in stereo", "storage": "56 Mbits", "summary": "The first version of the console was a front loading system that was only released in Japan and had 25,000 models made. A top loading model was soon released and sold internationally. Both suffered from long loading times.", "url": "https://www.igdb.com/platforms/neo-geo-cd/version/initial-version", "checksum": "3238f309-90e1-fe13-9f40-4825cf1e6b57"}, {"id": 194, "name": "Game Boy Micro", "platform_logo": 256, "slug": "game-boy-micro", "url": "https://www.igdb.com/platforms/gba/version/game-boy-micro", "checksum": "023a60ad-379e-047c-f298-cf226aa53a28"}, {"id": 277, "connectivity": "Wi-Fi 802.11b", "cpu": "MIPS R4000", "media": "Universal Media Disc, digital distribution", "memory": "64MB eDRAM", "name": "PlayStation Portable Brite", "online": "PlayStation Network", "os": "PlayStation Portable system software", "platform_logo": 212, "platform_version_release_dates": [340, 341, 342, 343], "resolutions": "480 x 272", "slug": "playstation-portable-brite", "sound": "Stereo speakers, 3.5 mm headphone jack", "storage": "Memory Stick Duo, Memory Stick PRO Duo", "summary": "In comparison with the PSP-2000 (PlayStation Portable Slim & Lite), the PSP-3000, which was marketed as \"PlayStation Portable Brite\", has an improved LCD screen with an increased color range, five times the contrast ratio, a halved pixel response time, new sub-pixel structure, and anti-reflective technology to reduce outdoor glare. The disc tray, logos and buttons were all redesigned, and a microphone was added. Games could now be outputted in either component or composite video using the video-out cable.", "url": "https://www.igdb.com/platforms/psp/version/playstation-portable-brite", "checksum": "cacac5ce-8582-b599-0f69-109617a7f7ab"}, {"id": 198, "companies": [160], "name": "Telstar", "platform_logo": 126, "platform_version_release_dates": [239], "slug": "telstar", "summary": "The Telstar is a series of video game consoles produced by Coleco from 1976 to 1978. Starting with Telstar Pong clone based on General Instrument's AY-3-8500 chip in 1976, there were 14 consoles released in the Telstar branded series. One million Telstar units were sold.", "url": "https://www.igdb.com/platforms/ay-3-8500/version/telstar", "checksum": "90439c2c-df3d-5d9a-08a2-fd9d350d5435"}, {"id": 224, "companies": [171], "name": "Windows Phone 7", "platform_logo": 142, "platform_version_release_dates": [250, 251, 252], "slug": "windows-phone-7", "summary": "Windows Phone 7 is the first release of the Windows Phone mobile client operating system. It received multiple large updates and added a few features backported from Windows Phone 8, such as a more customizable start screen. Microsoft ended support for Windows Phone 7 on October 14, 2014.", "url": "https://www.igdb.com/platforms/winphone/version/windows-phone-7", "checksum": "cdfd8f49-dfb4-a15f-8359-dcca1a11c861"}, {"id": 107, "companies": [534], "cpu": "MOS Technology 7501 or 8501 @ 0.89 MHz or 1.76 MHz", "graphics": "TED (320 × 200, 121 colors)", "media": "ROM Cartridge, Cassette tape", "memory": "16 KB RAM + 32 KB ROM", "name": "Initial version", "os": "Commodore BASIC 3.5", "platform_logo": 544, "platform_version_release_dates": [554], "resolutions": "320x200, 320x160, 160x200 and 160x160", "slug": "initial-version", "sound": "TED (2 channels, 4 octaves + white noise)", "summary": "The Commodore 16 is a home computer made by Commodore International with a 6502-compatible 7501 or 8501 CPU, released in 1984 and intended to be an entry-level computer to replace the VIC-20. A cost-reduced version, the Commodore 116, most of the units were sold in Europe. \n \nThe C16 and C116 belong to the same family as the higher-end Plus/4 and are internally very similar to it (albeit with less RAM - 16 rather than 64 KB - and lacking the Plus/4's user port and Three plus one software). Software is generally compatible among all three provided it can fit within the C16's smaller RAM and does not utilize the user port on the Plus/4.", "url": "https://www.igdb.com/platforms/c16/version/initial-version", "checksum": "8e9b359a-f342-8395-89dc-5f859c3bae7c"}, {"id": 503, "cpu": "Custom Nividia Tegra Processor", "name": "OLED Model", "platform_logo": 606, "slug": "oled-model", "storage": "64 GB", "summary": "An upgraded model with a 7-inch OLED screen, wider kickstand, better speakers for handheld or tabletop play, and a LAN port built into the brand new dock for a better online experience.", "url": "https://www.igdb.com/platforms/switch/version/oled-model", "checksum": "69056ab9-e365-93f1-410e-a5cd92767afe"}, {"id": 205, "name": "Tele-Cassetten-Game", "platform_logo": 132, "platform_version_release_dates": [245], "slug": "tele-cassetten-game", "summary": "This is a typical incarnation of the PC-50x systems using cartridges based on General Instruments chips. \n \nTen small buttons, are used to select the different games offered by the inserted cartridge. The cartridge offering the greatest number of games is \"10-Ballspiele\" with 10 games. The playing options are activated by the three switches. Each option depends on the cartridge inserted, the meaning of switches being explained on each cartridge label. The joysticks are detachable and are connected to the system through connectors placed on each side. \n \nCartridges released are the classic ones for these systems using cartridges based on General Instrument chips: Ball games, Motorcycle, Car racing, Submarine, Super wipeout, Tank battle and maybe Shooting gallery. These are generic english titles. Real titles are in German. \n \nConcerning the Tank Battle cartridge, the problem is that this game requires digital controllers as opposed to the analog joystick of the system. The Palladium system is one of the few GI based systems which offered optional numeric keypads to play this game! \n \nThe shooting games require the use of a light gun, which usually came with the cartridge. \n \nThere are in fact two models of the Palladium Tele-Cassetten-Game. The cases are different (see \"more pictures\" section), but everything else is identical (games, front panel, controllers, etc.). Why two systems? Maybe Palladium first marketed this licenced product using a \"common\" case used by other brands such as MBO and Optim, and then decided to redesign its own case so that consumers would identify more clearly the Palladium system. \n \nThis system (at least the \"first\" case style) was also marketed as the MBO Tele-Cassetten-System and Optim 600.", "url": "https://www.igdb.com/platforms/pc-50x-family/version/tele-cassetten-game", "checksum": "79b55f87-2ead-1f04-8207-d3359c4cca36"}, {"id": 182, "companies": [333], "name": "Game Boy Light", "platform_logo": 274, "platform_version_release_dates": [211], "slug": "game-boy-light", "summary": "\"The Game Boy Light is a backlit and updated version of the Game Boy Pocket exclusively released in Japan\"\n\nHas a larger battery compartment because it requires two AA batteries instead of AAA batteries.", "url": "https://www.igdb.com/platforms/gb/version/game-boy-light", "checksum": "52134218-95bf-035a-3873-25509ef12cd8"}, {"id": 234, "name": "Initial version", "platform_logo": 160, "slug": "initial-version", "url": "https://www.igdb.com/platforms/daydream/version/initial-version", "checksum": "ec756947-d992-6f4e-c506-e2dd962b9105"}, {"id": 189, "name": "Atari Lynx MkII", "platform_logo": 290, "platform_version_release_dates": [224], "slug": "atari-lynx-mkii", "summary": "Released 1991. \nRedesigned case, smaller size.  \nClearer screen. \nStereo sound.", "url": "https://www.igdb.com/platforms/lynx/version/atari-lynx-mkii", "checksum": "afef6734-c4f5-e893-b0c8-4ab0e5e8eea8"}, {"id": 226, "companies": [173], "name": "Windows Phone 8.1", "platform_logo": 144, "platform_version_release_dates": [254], "slug": "windows-phone-8-dot-1", "summary": "Windows Phone 8.1 is the third generation of Microsoft's Windows Phone mobile operating system, succeeding Windows Phone 8. Windows Phone 8.1 is also the last version that uses the Windows Phone brand name as it was succeeded by Windows 10 Mobile.", "url": "https://www.igdb.com/platforms/winphone/version/windows-phone-8-dot-1", "checksum": "c58eb49f-bd0f-4efb-af61-5ee5e151bf8d"}, {"id": 238, "companies": [410], "name": "Nougat", "platform_logo": 379, "platform_version_release_dates": [274], "slug": "nougat", "summary": "Versions 7.0 – 7.1.2", "url": "https://www.igdb.com/platforms/android/version/nougat", "checksum": "da2df9df-cae6-1442-6149-561486427e6f"}, {"id": 274, "connectivity": "IEEE 802.11 b/g/n Wi-Fi, Bluetooth 2.1+EDR", "cpu": "ARM Cortex-A9 MPCore", "graphics": "PowerVR SGX543MP4+", "media": "PlayStation Vita Game Card, digital distribution", "memory": "512 MB RAM, 128 MB VRAM", "name": "PlayStation Vita (PCH-2000)", "online": "PlayStation Network", "os": "PlayStation Vita system software", "platform_logo": 215, "platform_version_release_dates": [326, 327, 328], "resolutions": "960 x 544", "slug": "playstation-vita-pch-2000", "sound": "Stereo speakers, 3.5 mm headphone jack, Bluetooth 2.1 + EDR", "storage": "1GB internal flash memory, PlayStation Vita Memory Card (4GB, 8GB, 16GB, 32GB, 64GB)", "summary": "The revised model, officially called the PCH-2000 series and commonly referred to as the PS Vita Slim, is 20% thinner and 15% lighter compared to the original model. While it largely maintains the original's overall structure and layout, the original's OLED screen has been replaced with a lower-cost LCD display. The model also roughly added about an extra hour of battery life. This model has a micro USB Type B port, which can be used to charge the device along with any standard micro USB cable.", "url": "https://www.igdb.com/platforms/psvita/version/playstation-vita-pch-2000", "checksum": "9148b12a-ec07-62c2-d92c-982e50e2902f"}, {"id": 355, "name": "DVD", "platform_logo": 426, "platform_version_release_dates": [435, 436, 437, 438, 439], "slug": "dvd", "url": "https://www.igdb.com/platforms/dvd-player/version/dvd", "checksum": "de5162c9-2f23-7c7d-97dd-8c2c9c3781d3"}, {"id": 129, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/pdp-7--1/version/initial-version", "checksum": "1e4dc91e-3857-820b-ac45-53cd47d3f909"}, {"id": 199, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8610/version/initial-version", "checksum": "1bdd1a97-cef3-aed7-be54-fe37eb57d8f0"}, {"id": 206, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8760/version/initial-version", "checksum": "31ddaa58-7fe0-e357-26c6-414eb69a7006"}, {"id": 207, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8710/version/initial-version", "checksum": "2d6cf8ac-db81-e755-f229-bde1fea73056"}, {"id": 33, "name": "Initial version", "platform_logo": 294, "slug": "initial-version-5bdd02e2-0187-419e-9db1-db42d1a6507c", "url": "https://www.igdb.com/platforms/bbcmicro/version/initial-version-5bdd02e2-0187-419e-9db1-db42d1a6507c", "checksum": "1289408e-7dfc-84e6-914f-42d88dca1734"}, {"id": 231, "name": "Initial version", "platform_logo": 796, "slug": "initial-version", "summary": "Windows Mixed Reality is a platform introduced as part of the Windows 10 and 11 operating system, which provides augmented reality and virtual reality experiences with compatible head-mounted displays.", "url": "https://www.igdb.com/platforms/windows-mixed-reality/version/initial-version", "checksum": "5bcbee32-1049-1715-c104-aa538838505c"}, {"id": 40, "cpu": "ARM7DMI @ 16,78 MHz", "graphics": "Custom 2D core", "media": "Game Boy Cartridge, Game Boy Advance Cartridge", "memory": "32 KB + 96 KB VRAM Internal to the CPU, 256 KB WRAM Normal RAM", "name": "Initial version", "platform_logo": 255, "platform_version_release_dates": [80, 81, 82, 83], "slug": "initial-version-e3ea39e6-786b-4b95-b574-b90f9b282c58", "sound": "Nintendo Direct Sound (software sound mixing), GB/GBC 8-bit channels", "url": "https://www.igdb.com/platforms/gba/version/initial-version-e3ea39e6-786b-4b95-b574-b90f9b282c58", "checksum": "58df7d07-a9ea-ebff-c2f8-65181a21d18f"}, {"id": 227, "companies": [405], "name": "Windows 10 Mobile", "platform_logo": 363, "platform_version_release_dates": [255], "slug": "windows-10-mobile", "summary": "Windows 10 Mobile is a mobile operating system developed by Microsoft. It is an iteration of the Windows Phone product line and a successor to Windows Phone 8.1. \n \nWindows 10 Mobile aims to provide greater consistency with its counterpart for personal computers, including more extensive synchronization of content, a new universal application platform that allows one app to run on multiple Windows 10 devices such as PCs, mobile devices and Xbox, as well as the capability, on supported hardware, to connect devices to an external display and use a \"PC-like\" interface with mouse and keyboard input support.", "url": "https://www.igdb.com/platforms/winphone/version/windows-10-mobile", "checksum": "d545fd60-467f-84d9-6d4b-1e2c6a7f1212"}, {"id": 278, "connectivity": "Wi-Fi 802.11b, Bluetooth", "cpu": "MIPS R4000", "media": "Digital distribution", "memory": "64MB eDRAM", "name": "PlayStation Portable Go", "online": "PlayStation Network", "os": "PlayStation Portable system software", "platform_logo": 241, "platform_version_release_dates": [344, 345, 346], "resolutions": "480 x 272", "slug": "playstation-portable-go", "sound": "Stereo speakers, 3.5 mm headphone jack", "storage": "16GB internal flash memory, Memory Stick Micro (M2)", "summary": "The PlayStation Portable Go (PSP-N1000) is 43% lighter and 56% smaller than the original PlayStation Portable (PSP-1000), and 16% lighter and 35% smaller than the PlayStation Portable Brite (PSP-3000). Its rechargeable battery is not intended to be removed by the user. Its LCD screen slides up to reveal the main controls. The overall shape and sliding mechanism are similar to those of Sony mylo COM-2. \n \nIts USB port was replaced with a proprietary connector. A compatible cable that connects to other devices' USB ports is included with the unit. The new multi-use connector allows video and sound output with the same connector using an optional composite or component AV cable. \n \nThe removal of the UMD drive effectively region-locks the unit because it must be linked to a single, region-locked PlayStation Network account. While it can download games to itself, users can also download and transfer games to the device from a PlayStation 3 console, or the Windows-based software Media Go.", "url": "https://www.igdb.com/platforms/psp/version/playstation-portable-go", "checksum": "411c41a0-280e-0285-7fcb-a50b72ef95ad"}, {"id": 173, "companies": [284], "connectivity": "802.11 a/b/g/n/ac, Bluetooth 4.0 (TV Mode Only), 2x USB 3.0, 1x USB 2.0, 1x USB-C, HDMI", "cpu": "Custom NVIDIA Tegra", "graphics": "Nvidia GM20B Maxwell-based GPU @ 307.2 - 384 MHz while undocked, 307.2 - 768 MHz while docked", "media": "Nintendo Switch Game Card, microSD Card", "memory": "4GB LPDDR4", "name": "Initial version", "online": "Nintendo Switch Online Service", "os": "Nintendo Switch system software", "output": "HDMI, 3.5mm headphone jack, DisplayPort over USB-C (internal)", "platform_logo": 227, "platform_version_release_dates": [217], "resolutions": "1280x720 on integrated screen, up to 1920x1080 through HDMI", "slug": "initial-version", "sound": "5.1 channel Linear PCM (HDMI), analog stereo (3.5mm headphone jack)", "storage": "32 GB NAND flash, expandable via microSD cards", "summary": "Nintendo Switch is a hybrid console/tablet. The tablet becomes a console via a docking station connected to a tv set. Nintendo regards the concept as mainly a home gaming system rather than portable. The Switch features two wireless controllers, which may be used individually or attached to a grip to get a more traditional controller.", "url": "https://www.igdb.com/platforms/switch/version/initial-version", "checksum": "07e6b829-ebb9-f4c6-72b8-a7dc776a6cb4"}, {"id": 119, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/pdp-8--1/version/initial-version", "checksum": "50bacafa-9595-7143-10b5-44a92d93f78e"}, {"id": 208, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/ay-3-8603/version/initial-version", "checksum": "0a6df289-0d98-a0ee-8bff-496cb38c8de2"}, {"id": 44, "name": "Initial version", "platform_logo": 380, "platform_version_release_dates": [57], "slug": "initial-version-04719e9f-bc9e-4b08-982c-50c495215228", "summary": "Linux is a free and open-source (FOSS/FLOSS) Operating System. In a more precise and complex definition, Linux is an open-source OS kernel on which a large variety of Operating Systems (known as Linux distributions) are built.", "url": "https://www.igdb.com/platforms/linux/version/initial-version-04719e9f-bc9e-4b08-982c-50c495215228", "checksum": "476c202a-811c-a811-8de0-7e3f1257edac"}, {"id": 275, "connectivity": "IEEE 802.11 b/g/n Wi-Fi, Bluetooth 2.1+EDR, Ethernet LAN", "cpu": "ARM Cortex-A9 MPCore", "graphics": "PowerVR SGX543MP4+", "media": "PlayStation Vita Game Card, digital distribution", "memory": "512MB RAM, 128MB VRAM", "name": "PlayStation TV", "online": "PlayStation Network", "os": "PlayStation Vita system software", "output": "HDMI", "platform_logo": 233, "platform_version_release_dates": [329, 330, 331, 332, 333], "resolutions": "1920 x 1080, 1280 x 720, 854 x 480", "slug": "playstation-tv", "sound": "2 channel LPCM", "storage": "1GB internal flash memory, PlayStation Vita Memory Card (4GB, 8GB, 16GB, 32GB, 64GB)", "summary": "PlayStation TV (abbreviated to PS TV), known in Japan and other parts of Asia as the PlayStation Vita TV or PS Vita TV, is a microconsole, and a non-handheld variant of the PlayStation Vita. \n \nControlled with either the DualShock 3 or DualShock 4 controllers, the PS TV is capable of playing many PS Vita games and applications, either through physical game cards or downloaded through the PlayStation Store. However, not all content is compatible with the device, since certain features in the PS Vita such as the gyroscope and microphone are not available on the PS TV. Nevertheless, the PS TV is able to emulate touch input for both the Vita's front and rear touchpads using the controller.", "url": "https://www.igdb.com/platforms/psvita/version/playstation-tv", "checksum": "e08744e4-1931-7936-bbf5-c0896a585897"}, {"id": 356, "name": "Blu-ray Disc", "platform_logo": 427, "platform_version_release_dates": [434], "slug": "blu-ray-disc", "url": "https://www.igdb.com/platforms/blu-ray-player/version/blu-ray-disc", "checksum": "26f8672f-5f17-8928-208e-b451ed8f719f"}, {"id": 120, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/gt40/version/initial-version", "checksum": "75caa1fc-6c82-f345-636d-ae3c273017aa"}, {"id": 35, "cpu": "Zilog Z80A @ 3,58 MHz", "media": "Cartridge", "memory": "1 KB", "name": "Initial version", "platform_logo": 311, "platform_version_release_dates": [93], "slug": "initial-version-8b4019b7-7255-449e-9571-088151f6b335", "sound": "Mono", "storage": "ROM Cartridge 8-32 KB", "url": "https://www.igdb.com/platforms/colecovision/version/initial-version-8b4019b7-7255-449e-9571-088151f6b335", "checksum": "d664a2fb-de76-502e-ead3-e6173f0cdbae"}, {"id": 489, "companies": [586], "name": "Xbox Series S", "slug": "xbox-series-s", "summary": "Xbox Series S delivers the same next generation speed and performance that define Xbox Series X. It is similar in CPU and has the identical I/O performance as Xbox Series X, making it easier for developers to deliver the same great performance, while rendering at a lower resolution. Xbox Series S delivers 4x the processing power of an Xbox One console and supports experiences up to 120fps, more immersive and responsive gameplay with support for hardware-accelerated DirectX Raytracing and Variable Rate Shading. In addition, Xbox Series S includes 512GB of custom SSD storage and is powered by the Xbox Velocity Architecture, delivering more than 40x the I/O bandwidth of an Xbox One resulting in faster loading times, steadier frame rates and Quick Resume for multiple titles.", "url": "https://www.igdb.com/platforms/series-x/version/xbox-series-s", "checksum": "fd6f01da-bb28-2526-8254-4053af3ddd69"}, {"id": 492, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/sharp-mz-2200/version/initial-version", "checksum": "726e1b9a-31a1-8e0d-e93a-a17f8f10abb3"}, {"id": 60, "connectivity": "IEEE 802.11 b/g/n Wi-Fi, 3G (3G model only), Bluetooth 2.1+EDR", "cpu": "ARM Cortex-A9 MPCore", "graphics": "PowerVR SGX543MP4+", "media": "PlayStation Vita Game Card, digital distribution", "memory": "512 MB RAM, 128 MB VRAM", "name": "PlayStation Vita", "online": "PlayStation Network", "os": "PlayStation Vita system software", "platform_logo": 232, "platform_version_release_dates": [26, 28, 323, 324, 325], "resolutions": "960 x 544", "slug": "playstation-vita", "sound": "Stereo speakers, 3.5 mm headphone jack, Bluetooth 2.1 + EDR", "storage": "PlayStation Vita Memory Card (4GB, 8GB, 16GB, 32GB, 64GB)", "summary": "PlayStation Vita's design was created to meld the experience of big budget, dedicated video game platforms with the then up-and-coming trend of mobile gaming through smart phones and tablets. However, in the year after the device's successful launch, sales of the hardware and its bigger budget games stalled, threatening to end its lifespan. A concentrated effort to attract smaller, indie developers in the West, combined with strong support from mid-level Japanese companies, helped keep the platform afloat. While this led to less diversity in its game library, it did garner strong support in Japanese-developed role-playing video games and visual novels alongside a wealth of Western-developed indie games, leading it to become a moderate seller in Japan, and build a smaller, yet passionate userbase in the West. In the platform's later years, Sony also promoted its ability to work in conjunction with its other gaming products, notably the ability to play PlayStation 4 games on it through the process of Remote Play, similar to the Wii U's function of Off-TV Play.", "url": "https://www.igdb.com/platforms/psvita/version/playstation-vita", "checksum": "2a3fe13d-1fab-ba3d-987c-7e3a8894b6b1"}, {"id": 58, "companies": [315], "connectivity": "100 Mbit Ethernet/modem (Add-on), 2x USB 1.1", "cpu": "Emotion Engine @ 294.912 MHz", "graphics": "Graphics Synthesizer @ 147.456 MHz", "media": "DVD, CD", "memory": "32 MB", "name": "Initial version", "online": "Dynamic Network Authentication System", "output": "Composite video, S-Video, RGB, VGA, YPBPR", "platform_logo": 253, "platform_version_release_dates": [126, 127, 128, 129, 130], "resolutions": "480i, 480p", "slug": "initial-version-414585e3-0f93-496a-8a82-d9fd5ab9f5e3", "sound": "CPU+SPU2", "storage": "Playstation 2 Memory Card (8 MB), Playstation 1 Memory Card (1 MB)", "summary": "The PlayStation 2 (PS2), is a home video game console that was manufactured by Sony Computer Entertainment. The sixth-generation console competed with the Sega Dreamcast, Microsoft Xbox, and Nintendo GameCube.\n\nThe PlayStation 2 went on to become the best-selling video game console in history, selling over 155 million units. More than 3,874 game titles have been released for the PS2 since launch, and more than 1.5 billion copies have been sold. Sony later manufactured several smaller, lighter revisions of the console known as \"slimline\" models, and in 2006 introduced the successor, the PlayStation 3.\n\nEven with the PlayStation 3 release, the PlayStation 2 remained popular well into the seventh generation and continued to be produced until January 4, 2013, when Sony finally announced that the PlayStation 2 had been discontinued after almost 13 years of production – one of the longest runs for a video game console. Despite the announcement, new games for the console continued to be produced until the end of 2013, including Final Fantasy XI: Seekers of Adoulin for Japan, Pro Evolution Soccer 2014 for North America and Europe, and FIFA 14 for Brazil. Sony unveiled the PlayStation 4 console the following month on February 20, 2013.", "url": "https://www.igdb.com/platforms/ps2/version/initial-version-414585e3-0f93-496a-8a82-d9fd5ab9f5e3", "checksum": "f12717a2-868c-7ca2-3491-d45657601f4a"}, {"id": 181, "companies": [335], "connectivity": "2 Game Boys can be linked together via built-in serial ports, up to 4 with a DMG-07 4-player adapter. And 16 in maximum.", "cpu": "Sharp LR35902 @ 4,19 MHz", "graphics": "160x144 pixels screen with 2-bit a black-and-white display screen", "media": "Game Boy Cartridge", "memory": "8 KB S-RAM", "name": "Game Boy Pocket", "platform_logo": 276, "platform_version_release_dates": [209, 210], "resolutions": "a 65 mm (2.56 in) diagonal, 48.5 mm (1.91 in) width, and 43.5 mm (1.71 in) height screen", "slug": "game-boy-pocket", "sound": "2 pulse wave generators, 1 PCM 4-bit wave sample (64 4-bit samples played in 1×64 bank or 2×32 bank) channel, 1 noise generator, and one audio input from the cartridge", "storage": "8 MB", "summary": "A smaller, lighter unit that required fewer batteries.\n\nThe Game Boy Pocket has a smaller link port, which requires an adapter to link with the older Game Boy. Takes two AAA batteries.", "url": "https://www.igdb.com/platforms/gb/version/game-boy-pocket", "checksum": "bbe9bdd9-49ac-4fe2-d303-97c11639cece"}, {"id": 45, "companies": [34], "name": "Cheetah", "platform_logo": 89, "platform_version_release_dates": [67], "slug": "cheetah", "summary": "Mac OS X version 10.0, code named Cheetah, is the first major release of Mac OS X, Apple’s desktop and server operating system. Mac OS X v10.0 was a radical departure from the previous classic Macintosh operating system (Mac OS) and was Apple’s long awaited answer for a next generation Macintosh operating system. It introduced a brand new code base completely separate from Mac OS 9's, as well as all previous Apple operating systems. Mac OS X introduced the new Darwin Unix-like core and a completely new system of memory management. Cheetah proved to be a rocky start to the Mac OS X line, plagued with missing features and performance issues, although it was praised for being a good start to an operating system still in its infancy, in terms of completeness and overall operating system stability. Unlike later releases of Mac OS X, the cat-themed code name was not used in marketing the new operating system.", "url": "https://www.igdb.com/platforms/mac/version/cheetah", "checksum": "1af8f31d-921d-6159-354d-d86b626ab991"}, {"id": 200, "companies": [161], "name": "Initial version", "platform_logo": 131, "platform_version_release_dates": [244], "slug": "initial-version", "summary": "The world was undergoing \"PONG Madness\". It seemed only natural that developers would create advancements to the original AY-3-8500 chip to incorporate color and even more games. This explains the amount of PONG systems since each machine contained a different chip. However things were handled different in some areas particularly in Europe. \n \nEurope did not see the release of the Intellivision and Atari 2600 till the early 1980s. This allowed Pong to have a longer success. Rather then creating a new machine for each new chip, developers took the General Instruments popular line of chips and slapped them into cartridges. These carts were not like ROM carts used in later systems. They simply housed a specific General Instruments processor chip with pin outs to interface with a console. These were the PC-50X line of cartridges. \n \nWith the PC-50X cartridges available, console manufacturers were able to produce a machine that could play several games and market them at a low cost. The units were made in various countries and were marketed by Creatronic, Hanimex, ITMC, Rollet, GrandStand, Soundic and lord knows how many other manufacturers. There are literally over two hundred console variations that utilized this technology. \n \nThe initial model SD-050 varied in terms of outward appearance (colors, etc), manufacturers names and slight modifications. However each unit had the same overall design with two detachable controllers with 10 buttons located on the top of the machine. These 10 buttons, which clearly identify a PC-50X based console, were used to select the different games available on each cart. The SD-050 model only produced black and white video. \n \nNew models such as the SD-070 and SD-090 appeared and sold well into the 80s since the units were far cheaper then the newer consoles making waves in the US and Japan. These newer models played the same carts, but added additional settings, sound and SECAM color (4 colors).", "url": "https://www.igdb.com/platforms/pc-50x-family/version/initial-version", "checksum": "c9a97d1e-baec-890e-a1b6-1532f207956a"}, {"id": 490, "companies": [589], "name": "Initial version", "platform_logo": 594, "platform_version_release_dates": [605], "slug": "initial-version", "url": "https://www.igdb.com/platforms/ooparts/version/initial-version", "checksum": "5921bf6d-7c75-7a36-6ff2-2afdf6e75557"}, {"id": 285, "companies": [606], "name": "Google Stadia: Founder's Edition", "platform_logo": 328, "platform_version_release_dates": [432], "slug": "google-stadia-founders-edition", "summary": "Stadia Founder’s Edition lets you instantly enjoy games in up to 4K on your TV without a console. You can also play across laptops, desktops, Pixel 3, and Pixel 3a with cross-screen early access starting from day one.", "url": "https://www.igdb.com/platforms/stadia/version/google-stadia-founders-edition", "checksum": "bae118b3-4075-e02d-6887-9992fc9817b4"}, {"id": 223, "name": "Initial version", "platform_logo": 292, "platform_version_release_dates": [308, 309, 310], "slug": "initial-version", "summary": "The CDTV is essentially a Commodore Amiga 500 home computer with a CD-ROM drive and remote control. With the optional keyboard, mouse, and floppy disk drive, it gained the functionality of the regular Amiga. Commodore marketed the machine as an all-in-one multimedia appliance. As such, it targeted the same market as the Philips CD-i. The expected market for multimedia appliances did not materialize, and neither machine met with any real commercial success. Though the CDTV was based entirely on Amiga hardware, it was marketed strictly as a CDTV, with the Amiga name omitted from product branding. The CDTV was supplied with AmigaOS 1.3, rather than the more advanced and user-friendly 2.0 release that was launched at around the same time.", "url": "https://www.igdb.com/platforms/commodore-cdtv/version/initial-version", "checksum": "8a0a2a07-0696-3373-c3d8-edba337a6c30"}, {"id": 166, "cpu": "8-bit HuC6280A", "graphics": "two 16-bit HuC6270A Video Display Controllers (VDCs), one HuC6202 Video Priority Controller, and one HuC6260 Video Color Encoder (VCE)", "memory": "32KB of work RAM and 128KB (64KB per HuC6270A VDC) Video RAM", "name": "Initial version", "output": "5-pin DIN A/V connector with composite video and stereo audio output only", "platform_logo": 364, "slug": "initial-version", "sound": "Six Wavetable Synthesis audio channels", "url": "https://www.igdb.com/platforms/supergrafx/version/initial-version", "checksum": "23db0480-b34a-242f-bc51-7fd03936abf3"}, {"id": 496, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/plug-and-play/version/initial-version", "checksum": "852306ff-1ffb-b005-c1c3-f3f9629f85bc"}, {"id": 500, "companies": [595], "connectivity": "Built in WiFi for easy updates and future network enabled features", "cpu": "1.5Ghz quad-core processor", "memory": "512MB DRAM", "name": "Evercade VS", "os": "Linux-based", "output": "HDMI", "platform_logo": 598, "platform_version_release_dates": [610], "resolutions": "1080p", "slug": "evercade-vs", "storage": "4GB", "summary": "In April 2021, Blaze announced a home console version known as Evercade VS. It will be backwards-compatible with most games released for the handheld Evercade, with an output of 1080p. Unlike the handheld console, the VS will have multiplayer functionality. The console will include ports for four USB controllers, allowing the use of either VS or third-party controllers. The handheld Evercade can also be plugged into the VS and used as a controller. The VS's cartridge slot is covered by a small flap, resembling the design of the NES. The VS is scheduled to launch on November 3, 2021, with a price of $99.99.\n\nhttp://evercade.info/evercade-vs-home-console/", "url": "https://www.igdb.com/platforms/evercade/version/evercade-vs", "checksum": "41acaf27-bafd-6ee5-6b19-32ad4a6c0463"}, {"id": 426, "companies": [594], "connectivity": "HDMI, USB port", "cpu": "1.2GHz Cortex-A7", "media": "ROM Cartridge", "name": "Initial version", "os": "Linux-based", "output": "4.3” screen (480 x 272 resolution), HDMI (720p)", "platform_logo": 597, "platform_version_release_dates": [609], "resolutions": "480 x 272 resolution", "slug": "initial-version", "sound": "Stereo, 3.5 mm headphones", "summary": "The Evercade is a handheld console which is specialized in retrogaming. The games are distributed in cartridges, and all the cartridges are compilations of games already released in other gaming consoles.", "url": "https://www.igdb.com/platforms/evercade/version/initial-version", "checksum": "52c969d3-6bd7-9fa9-f256-20988234ad0e"}, {"id": 456, "name": "Initial version", "platform_logo": 600, "slug": "initial-version", "url": "https://www.igdb.com/platforms/sega-pico/version/initial-version", "checksum": "8e9a96d9-c27a-f204-02cc-46155472b68e"}, {"id": 79, "companies": [599], "cpu": "Z80A", "name": "ZX Spectrum", "platform_logo": 371, "platform_version_release_dates": [131], "slug": "zx-spectrum", "summary": "The ZX Spectrum is an 8-bit personal home computer released in the United Kingdom in 1982 by Sinclair Research Ltd.\n\nReferred to during development as the ZX81 Colour and ZX82, the machine was launched as the ZX Spectrum by Sinclair to highlight the machine's colour display, compared with the black and white of its predecessor, the ZX81. The Spectrum was ultimately released as eight different models, ranging from the entry level model with 16 KB RAM released in 1982 to the ZX Spectrum +3 with 128 KB RAM and built in floppy disk drive in 1987; together they sold in excess of 5 million units worldwide (not counting numerous clones).\n\nThe Spectrum was among the first mainstream audience home computers in the UK, similar in significance to the Commodore 64 in the USA. The introduction of the ZX Spectrum led to a boom in companies producing software and hardware for the machine, the effects of which are still seen; some credit it as the machine which launched the UK IT industry. Licensing deals and clones followed, and earned Clive Sinclair a knighthood for \"services to British industry\".\n\nThe Commodore 64, Oric-1 and Atmos, BBC Microcomputer and later the Amstrad CPC range were rivals to the Spectrum in the UK market during the early 1980s. Over 24,000 software titles have been released since the Spectrum's launch and new titles continue to be released--over 100 in 2012. In 2014, a bluetooth keyboard modelled on the Spectrum was announced.", "url": "https://www.igdb.com/platforms/zxs/version/zx-spectrum", "checksum": "a83400a5-0902-a6a6-bf0a-1b9314844532"}, {"id": 501, "companies": [609], "cpu": "180 MHz Cortex M7", "memory": "4 GB Flash", "name": "Initial version", "platform_logo": 609, "platform_version_release_dates": [613], "resolutions": "400 × 240 1-bit", "slug": "initial-version", "sound": "Built-In Mono Speaker, Stereo Headphone Jack, Condenser Mic + TRRS Mic In", "storage": "16 MB RAM32 KB L1 Cache", "summary": "It’s yellow. It fits in your pocket. It’s got a beautiful black and white screen. It’s not super cheap, but not super expensive. It includes brand new games from some amazing creators. Plus it has a crank.", "url": "https://www.igdb.com/platforms/playdate/version/initial-version", "checksum": "27f6538e-d7b4-87e2-4c2c-fc0ffc928dd1"}, {"id": 495, "name": "Xbox 360 S", "platform_logo": 622, "platform_version_release_dates": [607], "slug": "xbox-360-s", "url": "https://www.igdb.com/platforms/xbox360/version/xbox-360-s", "checksum": "2746d371-46ac-5011-6682-6bc205bfe7ef"}, {"id": 497, "companies": [614], "name": "Initial version", "platform_logo": 627, "platform_version_release_dates": [614], "slug": "initial-version", "url": "https://www.igdb.com/platforms/gamate/version/initial-version", "checksum": "2846e467-8741-a7fc-2404-8c71e61b24c5"}, {"id": 176, "companies": [604], "name": "Initial version", "platform_logo": 325, "slug": "initial-version", "summary": "A TV with the Android OS built in to play supported mobile games. Amazon Luna, a video game streaming service created by Amazon, was later built into other versions of the Fire TV.", "url": "https://www.igdb.com/platforms/amazon-fire-tv/version/initial-version", "checksum": "a46eae1d-a0c0-18a8-67dc-604a82bb570b"}, {"id": 508, "name": "Initial version", "platform_logo": 740, "slug": "initial-version", "url": "https://www.igdb.com/platforms/oculus-go/version/initial-version", "checksum": "f5695201-9855-c30a-e1e5-4aef9aae51b7"}, {"id": 502, "name": "Initial version", "platform_logo": 745, "slug": "initial-version", "url": "https://www.igdb.com/platforms/intellivision-amico/version/initial-version", "checksum": "886afd67-7801-59bc-cd72-c6a526b54e31"}, {"id": 506, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/oculus-rift/version/initial-version", "checksum": "461db49e-7a26-2acc-5063-0ee5c4e2a914"}, {"id": 510, "name": "Sears Hockey-Pong", "slug": "sears-hockey-pong", "url": "https://www.igdb.com/platforms/ay-3-8500/version/sears-hockey-pong", "checksum": "3f3d0993-bda2-05fa-044f-444d13488b68"}, {"id": 423, "name": "Initial version", "platform_logo": 595, "slug": "initial-version", "summary": "The Satellaview is a satellite modem peripheral produced by Nintendo for the Super Famicom in 1995. Containing 1 megabit of ROM space and an additional 512 kB of RAM, Satellaview allowed players to download games, magazines, and other media through satellite broadcasts provided by Japanese company St.GIGA. Its heavy third-party support included Squaresoft, Taito, Konami, Capcom, and Seta. To use Satellaview, players purchased a special broadcast satellite (BS) tuner directly from St.GIGA or rented one for a six-month fee, and paid monthly subscription fees to both St.GIGA and Nintendo. It attaches to the expansion port on the bottom of the Super Famicom.", "url": "https://www.igdb.com/platforms/satellaview/version/initial-version", "checksum": "27cbe403-8bee-8bc5-71eb-00e3dd11c333"}, {"id": 514, "name": "Feature phone", "slug": "feature-phone", "url": "https://www.igdb.com/platforms/mobile/version/feature-phone", "checksum": "5588086b-a23b-ee2d-f840-97a666dd8bb7"}, {"id": 523, "companies": [620], "name": "Initial version", "platform_logo": 663, "platform_version_release_dates": [639], "slug": "initial-version", "url": "https://www.igdb.com/platforms/windows-mobile/version/initial-version", "checksum": "b4bcfea4-db07-67d3-e93f-4c1395d00940"}, {"id": 513, "companies": [625], "name": "Windows 11", "platform_logo": 670, "platform_version_release_dates": [642], "slug": "windows-11", "summary": "Windows 11 is the latest major release of Microsoft's Windows NT operating system, released in October 2021. It is a free upgrade to its predecessor, Windows 10 (2015), available for any Windows 10 devices that meet the new Windows 11 system requirements.\n\nWindows 11 features major changes to the Windows shell influenced by the canceled Windows 10X, including a redesigned Start menu, the replacement of its \"live tiles\" with a separate \"Widgets\" panel on the taskbar, the ability to create tiled sets of windows that can be minimized and restored from the taskbar as a group, and new gaming technologies inherited from Xbox Series X and Series S such as Auto HDR and DirectStorage on compatible hardware. Internet Explorer (IE) has been replaced by the Chromium-based Microsoft Edge as the default web browser like its predecessor, Windows 10, and Microsoft Teams is integrated into the Windows shell. Microsoft also announced plans to allow more flexibility in software that can be distributed via Microsoft Store, and to support Android apps on Windows 11 (including a partnership with Amazon to make its app store available for the function).\n\nCiting security considerations, the system requirements for Windows 11 were increased over Windows 10. Microsoft only officially supports the operating system on devices using an eighth-generation Intel Core CPU or newer (with some minor exceptions), AMD Ryzen CPU based on Zen+ microarchitecture or newer, or a Qualcomm Snapdragon 850 ARM system-on-chip or newer, with UEFI secure boot and Trusted Platform Module (TPM) 2.0 supported and enabled (although Microsoft may provide exceptions to the TPM 2.0 requirement for OEMs).", "url": "https://www.igdb.com/platforms/win/version/windows-11", "checksum": "d19c5f11-835b-3733-1f76-497717f53542"}, {"id": 530, "companies": [627], "name": "Windows 2.0", "platform_logo": 672, "slug": "windows-2-dot-0", "summary": "Windows 2.0 is a major release of Microsoft Windows, a family of graphical operating systems for personal computers developed by Microsoft. It was released to manufacturing on December 9, 1987, as a successor to Windows 1.0.\n\nThe product includes two different variants, a base edition for 8086 real mode, and Windows/386, an enhanced edition for i386 protected mode. Windows 2.0 differs from its predecessor by allowing users to overlap and resize application windows, and the operating environment also introduced desktop icons, keyboard shortcuts, and support for 16-color VGA graphics. It also introduced Microsoft Word and Excel, and integrated the Control Panel, while the developer support increased substantially.", "url": "https://www.igdb.com/platforms/win/version/windows-2-dot-0", "checksum": "28dbd8d1-15b9-fdf1-655e-fe4a3c885194"}, {"id": 524, "companies": [642], "connectivity": "Expansion slot, ROM cartridge socket, dual RS-232 ports, proprietary QLAN local area network ports, dual joystick ports, external Microdrive bus", "cpu": "7.5 MHz Motorola 68008", "media": "Microdrive tape cartridges", "memory": "128 KB of RAM, expandable to 896 KB", "name": "Sinclair QL", "os": "Sinclair QDOS", "output": "RF and RGB", "platform_logo": 665, "platform_version_release_dates": [640], "resolutions": "256x256 (8 colors), 512x256 (4 colors)", "slug": "sinclair-ql", "storage": "2x Microdrive tape cartridges", "summary": "The Sinclair QL (for Quantum Leap) is a personal computer that was an upper-end counterpart to the ZX Spectrum, and it was based on the Motorola 68008 processor.", "url": "https://www.igdb.com/platforms/sinclair-ql/version/sinclair-ql", "checksum": "dfe61f5b-6761-e9c6-0b5d-540ba3a6356d"}, {"id": 532, "companies": [629], "name": "Windows 95", "platform_logo": 674, "slug": "windows-95", "summary": "Windows 95 is a consumer-oriented operating system developed by Microsoft as part of its Windows 9x family of operating systems. The first operating system in the 9x family, it is the successor to Windows 3.1x, and was released to manufacturing on July 14, 1995, and generally to retail on August 24, 1995, almost three months after the release of Windows NT 3.51. Windows 95 merged Microsoft's formerly separate MS-DOS and Microsoft Windows products, and featured significant improvements over its predecessor, most notably in the graphical user interface (GUI) and in its simplified \"plug-and-play\" features. There were also major changes made to the core components of the operating system, such as moving from a mainly cooperatively multitasked 16-bit architecture to a 32-bit preemptive multitasking architecture, at least when running only 32-bit protected mode applications.\n\nAccompanied by an extensive marketing campaign, Windows 95 introduced numerous functions and features that were featured in later Windows versions, such as the taskbar, notification area, and the \"Start\" button.", "url": "https://www.igdb.com/platforms/win/version/windows-95", "checksum": "03796576-f080-3fc5-fa85-f901dd9dc23e"}, {"id": 531, "companies": [628], "name": "Windows 3.0", "platform_logo": 673, "slug": "windows-3-dot-0", "summary": "Windows 3.0 is the third major release of Microsoft Windows, launched in 1990. It features a new graphical user interface (GUI) where applications are represented as clickable icons, as opposed to the list of file names seen in its predecessors. Later updates would expand the software's capabilities, one of which added multimedia support for sound recording and playback, as well as support for CD-ROMs.", "url": "https://www.igdb.com/platforms/win/version/windows-3-dot-0", "checksum": "ce21e8da-652f-55c3-2d41-eb3c8d0bf792"}, {"id": 511, "name": "Initial version", "platform_logo": 746, "slug": "initial-version", "url": "https://www.igdb.com/platforms/airconsole/version/initial-version", "checksum": "ae65c38d-49cf-b61a-5e98-61b0c965a55e"}, {"id": 522, "name": "Amiga A 1200", "platform_version_release_dates": [638], "slug": "amiga-a-1200", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-1200", "checksum": "d19bae1e-7f7e-eaf6-4ddd-5119f4551a6a"}, {"id": 30, "cpu": "Motorola 68000 16-/32-bit 8 MHz", "media": "3½-inch disk", "memory": "512 Kb (1 Mb for Atari ST 1040)", "name": "520 ST", "os": "TOS (The Operating System)", "platform_logo": 367, "platform_version_release_dates": [606], "resolutions": "320 × 200 (16 color), palette of 512 colors / 640 × 200 (4 color), palette of 512 colors / 640 × 400 (mono), monochrome", "slug": "520-st", "sound": "Yamaha YM2149 3-voice squarewave plus 1-voice white noise mono Programmable Sound Generator", "summary": "The Atari ST is a line of personal computers from Atari Corporation and the successor to the Atari 8-bit family. The initial model, the 520ST, saw limited release in April–June 1985 and was widely available in July. It was the first personal computer with a bitmapped color GUI, using a version of Digital Research's GEM from February 1985.\n\nThe 1040ST, released in 1986 with 1 MB of RAM, was the first home computer with a cost-per-kilobyte of less than US$1. It is part of a mid-1980s generation of computers with 16- or 32-bit processors, 256 KB or more of RAM, and mouse-controlled graphical user interfaces. (Other examples include the Macintosh, Amiga, Apple IIGS, and Acorn Archimedes.)\n\n\"ST\" officially stands for \"Sixteen/Thirty-two\", referring to the Motorola 68000's 16-bit external bus and 32-bit internals. The system was designed by a small team led by Shiraz Shivji.\n\nThe ST was sold with either Atari's color monitor or less expensive monochrome monitor. Color graphics modes were available only on the former while the highest-resolution mode required the monochrome monitor. Some later models could display the color modes on a TV.\n\nIn some markets, particularly Germany, the ST gained a foothold for CAD and desktop publishing. With its built-in MIDI ports, it was popular for music sequencing and as a controller of musical instruments among amateurs and professional musicians.\n\nIt was superseded by the Atari STE, Atari TT, Atari MEGA STE and Falcon computers.", "url": "https://www.igdb.com/platforms/atari-st/version/520-st", "checksum": "db4ac739-ab4a-b159-45e7-2eb5469e70ec"}, {"id": 20, "companies": [624], "cpu": "Zilog Z80A @ 4 MHz", "memory": "64 or 128 KB", "name": "CPC 464", "os": "AMSDOS", "platform_logo": 114, "platform_version_release_dates": [641], "slug": "cpc-464", "summary": "The Amstrad CPC (short for Colour Personal Computer) is a series of 8-bit home computers produced by Amstrad between 1984 and 1990. It was designed to compete in the mid-1980s home computer market dominated by the Commodore 64 and the Sinclair ZX Spectrum, where it successfully established itself primarily in the United Kingdom, France, Spain, and the German-speaking parts of Europe.\n\nThe series spawned a total of six distinct models: The CPC464, CPC664, and CPC6128 were highly successful competitors in the European home computer market. The later 464plus and 6128plus, intended to prolong the system's lifecycle with hardware updates, were considerably less successful, as was the attempt to repackage the plus hardware into a game console as the GX4000.\n\nThe CPC models' hardware is based on the Zilog Z80A CPU, complemented with either 64 or 128 KB of RAM. Their computer-in-a-keyboard design prominently features an integrated storage device, either a compact cassette deck or 3-inch floppy disk drive. The main units were only sold bundled with either a colour, green-screen or monochrome monitor that doubles as the main unit's power supply. Additionally, a wide range of first and third-party hardware extensions such as external disk drives, printers, and memory extensions, was available.\n\nThe CPC series was pitched against other home computers primarily used to play video games and enjoyed a strong supply of game software. The comparatively low price for a complete computer system with dedicated monitor, its high-resolution monochrome text and graphic capabilities and the possibility to run CP/M software also rendered the system attractive for business users, which was reflected by a wide selection of application software.\n\nDuring its lifetime, the CPC series sold approximately three million units.", "url": "https://www.igdb.com/platforms/acpc/version/cpc-464", "checksum": "57b5ae47-0ced-9743-3eb9-a7728a6c064e"}, {"id": 526, "name": "10", "slug": "10", "url": "https://www.igdb.com/platforms/android/version/10", "checksum": "6d5af0f5-62ab-b2ce-703c-24791c08d80b"}, {"id": 527, "name": "11", "slug": "11", "url": "https://www.igdb.com/platforms/android/version/11", "checksum": "6be97259-1a8a-d1c6-d4bc-6fd6183407cd"}, {"id": 528, "name": "12", "slug": "12", "url": "https://www.igdb.com/platforms/android/version/12", "checksum": "deeeedfd-5ab3-7d05-9832-a04a883a0efe"}, {"id": 541, "name": "Android 1.0", "slug": "android-1-dot-0", "url": "https://www.igdb.com/platforms/android/version/android-1-dot-0", "checksum": "a858d3aa-8b71-9496-f79d-0c00356d7528"}, {"id": 542, "name": "Android 1.1", "slug": "android-1-dot-1", "url": "https://www.igdb.com/platforms/android/version/android-1-dot-1", "checksum": "72446f01-84f2-8277-894b-42c47c74fe78"}, {"id": 543, "name": "Android Cupcake", "slug": "android-cupcake", "url": "https://www.igdb.com/platforms/android/version/android-cupcake", "checksum": "db7ec24b-5c4a-77de-61ce-f59e32a3bc73"}, {"id": 544, "name": "Android Donut", "slug": "android-donut", "url": "https://www.igdb.com/platforms/android/version/android-donut", "checksum": "a2e1b589-6d53-24a6-7c5e-bb99ba15f8cf"}, {"id": 545, "name": "Android Eclair", "slug": "android-eclair", "url": "https://www.igdb.com/platforms/android/version/android-eclair", "checksum": "abc352d8-412e-12e8-e6d7-10c0a5841cfc"}, {"id": 546, "name": "Android Froyo", "slug": "android-froyo", "url": "https://www.igdb.com/platforms/android/version/android-froyo", "checksum": "42bd445f-26bd-64c7-70f9-a885bdcd6513"}, {"id": 529, "companies": [626], "name": "Windows 1.0", "platform_logo": 671, "platform_version_release_dates": [643], "slug": "windows-1-dot-0", "summary": "Windows 1.0 is the first major release of Microsoft Windows, a family of graphical operating systems for personal computers developed by Microsoft. It was first released to manufacturing in the United States on November 20, 1985, while the European version was released as Windows 1.02 in May 1986.\n\nIts development began after the Microsoft co-founder and spearhead of Windows 1.0, Bill Gates, saw a demonstration of a similar software suite, Visi On, at COMDEX in 1982. The operating environment was showcased to the public in November 1983, although it ended up being released two years later. Windows 1.0 runs on MS-DOS, as a 16-bit shell program known as MS-DOS Executive, and it provides an environment which can run graphical programs designed for Windows, as well as existing MS-DOS software. It introduced multitasking and the use of the mouse, and various built-in programs such as Calculator, Paint, and Notepad. The operating environment does not allow its windows to overlap, and instead, the windows are tiled. Windows 1.0 also contains four releases, which contain minor updates to the system.", "url": "https://www.igdb.com/platforms/win/version/windows-1-dot-0", "checksum": "a3c8c1d1-b0e1-743f-e55d-9c15c238442a"}, {"id": 537, "companies": [634], "name": "Windows Mobile 5.0", "platform_logo": 680, "platform_version_release_dates": [648], "slug": "windows-mobile-5-dot-0", "summary": "Windows Mobile 5.0, originally codenamed \"Magneto\", was released at Microsoft's Mobile and Embedded Developers Conference 2005 in Las Vegas, May 9–12, 2005. Microsoft offered mainstream support for Windows Mobile 5 through October 12, 2010, and extended support through October 13, 2015. It was first offered on the Dell Axim x51. It used the .NET Compact Framework 1.0 SP3, an environment for programs based on .NET. Windows Mobile 5.0 included Microsoft Exchange Server \"push\" functionality improvements that worked with Exchange 2003 SP2. The \"push\" functionality also required vendor/device support[5] With AKU2 software upgrades all WM 5.0 devices supported DirectPush. This version featured increased battery life due to Persistent storage capability. Previously up to 50% (enough for 72 hours of storage) of battery power was reserved just to maintain data in volatile RAM. This continued the trend of Windows-based devices moving from using RAM as their primary storage medium to the use of a combination of RAM and flash memory (in use, no distinction between the two is obvious to users). Programs and frequently accessed data run in RAM, while most storage is in the flash memory. The OS seamlessly moves data between the two as needed. Everything is backed up in the flash memory, so unlike prior devices, WM5 devices lose no data if power is lost. New to 5.0, OS updates were released as Adaptation kit upgrades, with AKU 3.5 being the final released.\n\nA new version of Office was bundled called \"Microsoft Office Mobile\" which includes PowerPoint Mobile, Excel Mobile with graphing capability and Word Mobile with the ability to insert tables and graphics. Media management and playback was enhanced with Picture and Video package, which converged the management of videos and pictures and Windows Media Player 10 Mobile. Among new hardware features were enhanced Bluetooth support, default QWERTY keyboard-support and a management interface for Global Positioning System (GPS). Improvements were made to ActiveSync 4.2 with 15% increased synchronization speed. Business customers benefited from a new error reporting facility similar to that present in desktop and server Windows systems. Caller ID now supports photos so a user can apply an image to each contact to show when a call is received. DirectShow was also natively added. This release was the first to include DirectDraw with hardware acceleration, replacing the deprecated graphics component of GAPI, and Pocket MSN can be viewed directly from the Today Screen.\n\nWindows Mobile 5.0 requires at least 64MB of RAM, and the device must run an ARM compatible processor such as the Intel XScale or the Samsung and Texas Instruments ARM compatibles.", "url": "https://www.igdb.com/platforms/windows-mobile/version/windows-mobile-5-dot-0", "checksum": "3609ace6-3e4e-623d-6e12-12b49138b47b"}, {"id": 536, "companies": [633], "name": "Windows Mobile 2003", "platform_logo": 679, "platform_version_release_dates": [647], "slug": "windows-mobile-2003", "summary": "Windows Mobile 2003, originally codenamed \"Ozone\", is a discontinued mobile operating system and member of the Windows Mobile family. It was released on June 23, 2003, and was the first Microsoft OS to be called \"Windows Mobile\". It was based on Windows CE 4.20.", "url": "https://www.igdb.com/platforms/windows-mobile/version/windows-mobile-2003", "checksum": "b470e64a-3ebb-1cf8-72c1-7b3285c027d1"}, {"id": 538, "companies": [702], "name": "Windows Mobile 6.0", "platform_logo": 741, "platform_version_release_dates": [649], "slug": "windows-mobile-6-dot-0", "summary": "Windows Mobile 6, formerly codenamed \"Crossbow\", was the version of Windows Mobile released on February 12, 2007 at the 3GSM World Congress 2007. It comes in three different versions: \"Windows Mobile 6 Standard\" for Smartphones (phones with touchscreens), \"Windows Mobile 6 Professional\" for Pocket PCs with phone functionality, and \"Windows Mobile 6 Classic\" for Pocket PCs without cellular radios.\n\nWindows Mobile 6 is powered by Windows CE 5.0 (version 5.2) and is strongly linked to the then newly introduced Windows Live[5] and Exchange 2007 products. Windows Mobile 6 Standard was first offered on the Orange's SPV E650,[6] while Windows Mobile 6 Professional was first offered on the O2's Xda Terra. Aesthetically, Windows Mobile 6 was meant to be similar in design to the then newly released Windows Vista. Functionally, it works much like its predecessor Windows Mobile 5, but with improved stability.\n\nAlong with the announcement of Office Mobile 6.1 with support for Office 2007 document formats (pptx, docx, xlsx); OneNote Mobile, a companion to Microsoft Office OneNote was added to most builds of WM6. In addition to the newly included programs with Office Mobile improvements were made to existing applications, such as HTML email support in Outlook Mobile. Many Windows Mobile users are enterprise users business environments were targeted. With Server Search on Microsoft Exchange 2007, Out of Office Replies with Microsoft Exchange 2007, and search ability for contacts in an Exchange Server Address Book being implemented. To aid development for programmers .NET Compact Framework v2 SP2 is now preinstalled with the OS. Developers and users also have access to Microsoft SQL Server 2005 Compact Edition for storage and retrieval of information. AJAX, JavaScript, and XMLDOM support were added to Internet Explorer Mobile along with improved devicewide Internet Sharing. Communication abilities were further enhanced with a new Microsoft Bluetooth Stack and VoIP (Internet calling) support with acoustic echo cancellation and MSRT Audio Codec.\n\nTo improve security Microsoft added Storage Card Encryption so that encryption keys are lost if device is cold-booted. Further updates, both security and feature wise, can now also be provided using Operating System Live Update.\n\nAmong other improvements: 320x320 and 800x480 (WVGA) screen resolution support (The S01SH or \"Em One\" by Sharp was the first and only device to have an 800x480 screen on WM5), Improved Remote Desktop access (Available for only certain Pocket PCs), Customer Feedback option, Smartfilter for searching within programs and Unlicensed Mobile Access (UMA) support for select operators.", "url": "https://www.igdb.com/platforms/windows-mobile/version/windows-mobile-6-dot-0", "checksum": "2234f414-489e-189d-9a22-e3ea3baedb53"}, {"id": 525, "cpu": "Zilog Z80A 4 MHz", "graphics": "Motorola 6845", "media": "Floppy Disk 3'' , Optional Cassette Tape", "memory": "ROM: 48KB, RAM:128KB Upgradeable to 512KB", "name": "Amstrad CPC 6128", "os": "CP/M 3.0", "output": "Stereo sound output, Centronics port, Extension port, RGB monitor DIN plug, Light pen / gun port", "platform_version_release_dates": [684, 685], "resolutions": "MODE 0: 160x200 16 Colors, MODE 1: 320x200 4 Colors, MODE 2: 640 x 200 2 Colors", "slug": "amstrad-cpc-6128", "sound": "General Instrument AY-3-8910, 3 Stereo Voices", "summary": "The Amstrad CPC 6128 was a home computer created by british company Amstrad Consumer Plc in 1985. It is the successor of the Amstrad CPC 664, which only lasted 6 months on the market.", "url": "https://www.igdb.com/platforms/acpc/version/amstrad-cpc-6128", "checksum": "bda7591e-cc15-6c56-fffd-02883ceceddc"}, {"id": 533, "companies": [630], "name": "Windows 98", "platform_logo": 675, "platform_version_release_dates": [644], "slug": "windows-98", "summary": "Windows 98 is a consumer-oriented operating system developed by Microsoft as part of its Windows 9x family of Microsoft Windows operating systems. The second operating system in the 9x line, it is the successor to Windows 95, and was released to manufacturing on May 15, 1998, and generally to retail on June 25, 1998. Like its predecessor, it is a hybrid 16-bit and 32-bit monolithic product with the boot stage based on MS-DOS.\n\nWindows 98 is a web-integrated operating system that bears numerous similarities to its predecessor. Most of its improvements were cosmetic or designed to improve the user experience, but there were also a handful of features introduced to enhance system functionality and capabilities, including improved USB support and accessibility, as well as support for hardware advancements such as DVD players. Windows 98 was the first edition of Windows to adopt the Windows Driver Model, and introduced features that would become standard in future generations of Windows, such as Disk Cleanup, Windows Update, multi-monitor support, and Internet Connection Sharing.", "url": "https://www.igdb.com/platforms/win/version/windows-98", "checksum": "489c85fa-7a8a-fbab-fd33-38548c85f6f8"}, {"id": 534, "companies": [631], "name": "Windows Me", "platform_logo": 676, "platform_version_release_dates": [645], "slug": "windows-me", "summary": "Windows Millennium Edition, or Windows Me (marketed with the pronunciation of the pronoun \"me\"), is an operating system developed by Microsoft as part of its Windows 9x family of Microsoft Windows operating systems. It is the successor to Windows 98, and was released to manufacturing on June 19, 2000, and then to retail on September 14, 2000. It was Microsoft's main operating system for home users until the introduction of its successor Windows XP in 2001.\n\nWindows Me was targeted specifically at home PC users, and included Internet Explorer 5.5 (later default was Internet Explorer 6), Windows Media Player 7 (later default was Windows Media Player 9 Series) and the new Windows Movie Maker software, which provided basic video editing and was designed to be easy to use for consumers. Microsoft also incorporated features first introduced in Windows 2000, which had been released as a business-oriented operating system seven months earlier, into the graphical user interface, shell and Windows Explorer. Although Windows Me was still ultimately based around MS-DOS like its predecessors, access to real-mode DOS was restricted to decrease system boot time.", "url": "https://www.igdb.com/platforms/win/version/windows-me", "checksum": "170f5a87-4f9d-171e-dd41-f9bc377eeb39"}, {"id": 535, "companies": [632], "name": "Pocket PC 2002", "platform_logo": 678, "platform_version_release_dates": [646], "slug": "pocket-pc-2002", "summary": "Pocket PC 2002, originally codenamed \"Merlin\", was released on October 4, 2001. Like Pocket PC 2000, it was powered by Windows CE 3.0. Although targeted mainly for 240×320 (QVGA) Pocket PC devices, Pocket PC 2002 was also used for Pocket PC phones (Pocket PC 2002 Phone Edition), and for the first time, smartphones (Smartphone 2002). These Pocket PC 2002 Smartphones were mainly GSM devices. With future releases, the Pocket PC and Smartphone lines would increasingly collide as the licensing terms were relaxed allowing OEMs to take advantage of more innovative, individual design ideas.\n\nAesthetically, Pocket PC 2002 was meant to be similar in design to the then newly released Windows XP. Newly added or updated programs include Windows Media Player 8 with streaming capability, MSN Messenger, and Microsoft Reader 2, with digital rights management support. Upgrades to the bundled version of Office Mobile include a spell checker and word count tool in Pocket Word and improved Pocket Outlook. Connectivity was improved with file beaming on non-Microsoft devices such as Palm OS, the inclusion of Terminal Services and Virtual Private Networking support, and the ability to synchronize folders. Other upgrades include an enhanced UI with theme support and savable downloads and WAP in Pocket Internet Explorer.\n\nOn the technical side, Pocket PC 2002 removed MIPS and SuperH chip support, only supporting ARM architecture.", "url": "https://www.igdb.com/platforms/windows-mobile/version/pocket-pc-2002", "checksum": "943ee03d-2d5e-097e-06b2-ac29a7fb84da"}, {"id": 539, "name": "Handheld PC", "os": "Windows CE", "slug": "handheld-pc", "summary": "A handheld personal computer (PC) is a miniature computer typically built around a clamshell form factor and is significantly smaller than any standard laptop computer, but based on the same principles. It is sometimes referred to as a palmtop computer, not to be confused with Palmtop PC which was a name used mainly by Hewlett-Packard.\n\nMost handheld PCs use an operating system specifically designed for mobile use. Ultra-compact laptops capable of running common x86-compatible desktop operating systems are typically classified as subnotebooks. The first hand-held device compatible with desktop IBM personal computers of the time was the Atari Portfolio of 1989. Other early models were the Poqet PC of 1989 and the Hewlett Packard HP 95LX of 1991 which run the MS-DOS operating system. Other DOS-compatible hand-held computers also existed. After 2000 the handheld PC segment practically halted, replaced by other forms, although later communicators such as Nokia E90 can be considered to be of the same class.\n\nThe name Handheld PC was used by Microsoft from 1996 until the early 2000s to describe a category of small computers having keyboards and running the Windows CE operating system.", "url": "https://www.igdb.com/platforms/mobile/version/handheld-pc", "checksum": "10e5553e-7d85-cc0e-5780-861ba73301ca"}, {"id": 540, "companies": [636], "name": "MS-DOS", "platform_logo": 681, "platform_version_release_dates": [650], "slug": "ms-dos", "summary": "MS-DOS is an operating system for x86-based personal computers mostly developed by Microsoft. Collectively, MS-DOS, its rebranding as IBM PC DOS, and few operating systems attempting to be compatible with MS-DOS, are sometimes referred to as \"DOS\" (which is also the generic acronym for disk operating system). MS-DOS was the main operating system for IBM PC compatibles during the 1980s, from which point it was gradually superseded by operating systems offering a graphical user interface (GUI), in various generations of the graphical Microsoft Windows operating system.", "url": "https://www.igdb.com/platforms/dos/version/ms-dos", "checksum": "2b072348-9b74-a80b-1257-ff5f916ff327"}, {"id": 498, "companies": [644], "connectivity": "Compete.com serial cable, 14.4 kbit/s modem", "cpu": "10 MHz Sharp SM8521", "media": "ROM Cartridge", "name": "Initial version", "online": "Delphi or alternate ISP through 14.4 kbit/s modem", "platform_logo": 596, "platform_version_release_dates": [654], "resolutions": "200x160", "slug": "initial-version", "sound": "Monaural. Total of four audio channels: two 4-bit waveform generators, one noise generator, and one direct 8-bit PCM output channel", "storage": "Internal storage", "summary": "The Game com is a handheld game console released by Tiger Electronics on September 12, 1997. The first version of the Game.com can be connected to a 14.4 kbit/s modem for Internet connectivity, referenced by the \".com\" in the name. It was the first video game console to include a touchscreen and the first handheld console to include Internet connectivity.", "url": "https://www.igdb.com/platforms/game-dot-com/version/initial-version", "checksum": "816f4afc-055f-04b4-232b-d5a11764038a"}, {"id": 547, "cpu": "Sunplus SPG290 SoC", "graphics": "Sunplus SPG290 SoC", "media": "CD-ROM", "memory": "16 MB SDRAM", "name": "Initial version", "output": "Composite video", "platform_logo": 686, "platform_version_release_dates": [651], "resolutions": "640x480", "slug": "initial-version", "storage": "RFID cards", "summary": "The HyperScan is a home video game console from the toy company Mattel. The console used UDF format CD-ROMs. The HyperScan has two controller ports, as well as a 13.56 MHz RFID scanner that reads and writes to the \"cards\" which, in turn, activate features in and save data from the game.", "url": "https://www.igdb.com/platforms/hyperscan/version/initial-version", "checksum": "4b02d144-ea96-ef09-c735-8ab7b87519c7"}, {"id": 548, "companies": [640], "connectivity": "Serial link for two player games (6 pins), or external joystick.", "cpu": "4.194304 MHz Sharp LR35902", "media": "36 pin ROM cartridge", "memory": "16 KB in two 8K chips (Goldstar GM76C88LFW)", "name": "Initial version", "output": "2.7\" LCD STN dot matrix screen", "platform_logo": 687, "platform_version_release_dates": [652, 653], "resolutions": "160x144", "slug": "initial-version", "sound": "Built-in speaker (8Ω 200 mW) and stereo headset output", "summary": "The Mega Duck is a handheld game console that was developed and manufactured by Hong Kong-based Welback Holdings through its Timlex International division, and released in 1993. It was marketed under various different brands worldwide including Creatronic and Videojet, and the shell of the console came in white or black plastic. In South America (mainly in Brazil), the Chinese-made Creatronic version was distributed by Cougar USA, also known as \"Cougar Electronic Organization\", and sold as the \"Cougar Boy\". Cougar USA didn't release the Cougar Boy in its origin country.\n\nThe Cougar Boy came with a 4-in-one game cartridge and a stereo earphone. With an external joystick (not included) two players could play against each other simultaneously.", "url": "https://www.igdb.com/platforms/mega-duck-slash-cougar-boy/version/initial-version", "checksum": "3b09cfff-7923-055b-f4de-59129d63fc92"}, {"id": 549, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/legacy-computer/version/initial-version", "checksum": "bf649b3f-a46a-2a05-063d-6235fd6d3d47"}, {"id": 550, "companies": [645], "media": "CD-ROM, ROM cartridge", "name": "Initial version", "online": "AtariNet", "platform_logo": 688, "platform_version_release_dates": [655, 656], "slug": "initial-version", "storage": "Memory Track cartridge", "summary": "The Atari Jaguar CD is a CD-ROM peripheral for the Atari Jaguar video game console. The device sits atop the Jaguar console, fitting into the ROM cartridge slot. The drive has its own cartridge slot to allow cartridge games to be played without removing the CD drive, and to run software that used cartridge and CD in tandem.", "url": "https://www.igdb.com/platforms/atari-jaguar-cd/version/initial-version", "checksum": "a26e3ba0-9061-9e24-01ec-01841244011c"}, {"id": 551, "name": "Initial version", "slug": "initial-version", "url": "https://www.igdb.com/platforms/handheld-electronic-lcd/version/initial-version", "checksum": "d1ed4d39-d5c9-4d02-537e-7adbd7c046d4"}, {"id": 552, "companies": [646], "cpu": "96 MHz ARCTangent-A5", "graphics": "4 MB ATI chip", "media": "4-16 MB cartridge", "memory": "2 MB", "name": "Initial version", "platform_logo": 689, "platform_version_release_dates": [657], "resolutions": "160x160", "slug": "initial-version", "sound": "Proprietary hardware audio acceleration", "storage": "256 bytes onboard, 2-512 KB on cartridges", "summary": "The Leapster Learning Game System is an educational handheld game console aimed at 5 to 10-11 year olds (preschool to fourth grade), made by LeapFrog Enterprises. Its games teach the alphabet, phonics, basic math (addition, subtraction, multiplication, division), and art and animal facts to players. Along with a directional pad, the system features a touchscreen with a stylus pen that enables young users to interact directly with the screen.", "url": "https://www.igdb.com/platforms/leapster/version/initial-version", "checksum": "ed80fdcc-3f91-1a94-34d4-0cecc14048cf"}, {"id": 553, "companies": [647], "cpu": "393 MHz ARM9-based processor", "media": "ROM Cartridge", "memory": "64 MB DDR SDRAM", "name": "Initial version", "os": "Linux", "platform_version_release_dates": [658], "resolutions": "320x240", "slug": "initial-version", "storage": "512 MB", "summary": "The Leapster Explorer is a handheld console developed and marketed by LeapFrog Enterprises as the third generation of the successful Leapster series. It is aimed at children aged 4 to 9. The LeapPad Explorer was the first release in a new line of LeapPad products after the discontinuation of the original LeapPad line. Games for each system are cross-compatible.", "url": "https://www.igdb.com/platforms/leapster-explorer-slash-leadpad-explorer/version/initial-version", "checksum": "ddd842c0-db98-ec71-1bae-ef855816426e"}, {"id": 554, "companies": [648, 649], "connectivity": "Wi-Fi, Bluetooth", "cpu": "1 GHz quad core custom processor", "media": "ROM Cartridge, Video CD (Malaysia only)", "memory": "1GB DDR3 RAM", "name": "Initial version", "online": "LeapFrog", "output": "HDMI, composite video (Malaysia only)", "platform_logo": 690, "platform_version_release_dates": [659, 660], "resolutions": "1280x720, 640x480 (Malaysia only)", "slug": "initial-version", "storage": "16 GB", "summary": "LeapTV is an educational video game console developed by LeapFrog and released on October 20, 2014. The console consists of the main unit, a TV-connected motion sensing camera, and a modifiable controller for different play styles.\n\nThe Malaysian version is known as LeapTV VCD, as it uses Video CDs.", "url": "https://www.igdb.com/platforms/leaptv/version/initial-version", "checksum": "0d18d1da-477d-77af-8331-f4c17ffd1afb"}, {"id": 555, "companies": [650], "connectivity": "Two Player Link using DE-9 connector", "cpu": "4 MHz 8-bit 65SC02", "media": "ROM Cartridge", "name": "Initial version", "output": "TV Adpater", "platform_logo": 691, "platform_version_release_dates": [661], "resolutions": "160x160 in 4 color greyscale", "slug": "initial-version", "sound": "2 Tonal + 1 Noise Channel, additional audio DMA stereo output channel. Built-in speaker and headphone jack.", "summary": "The Watara Supervision, also known as the QuickShot Supervision in the UK, is a monochrome handheld game console, originating from Asia, and introduced in 1992 as a cut-price competitor for Nintendo's Game Boy. One unique feature of the Supervision was that it could be linked up to a television via a link cable. Games played in this way would display in four colors.", "url": "https://www.igdb.com/platforms/watara-slash-quickshot-supervision/version/initial-version", "checksum": "52336677-f6d7-2067-f113-8cc6586b23bf"}, {"id": 556, "companies": [651, 652], "connectivity": "22.8 kbps dial-up modem", "media": "64 MB magnetic disk", "name": "Initial version", "online": "Randnet", "platform_logo": 692, "platform_version_release_dates": [662], "slug": "initial-version", "storage": "Rewritable magnetic disk", "summary": "The Nintendo 64DD is a magnetic floppy disk drive peripheral for the Nintendo 64 game console developed by Nintendo. It was announced in 1995, prior to the Nintendo 64's 1996 launch, and after numerous delays was released in Japan on December 13, 1999. The \"64\" references both the Nintendo 64 console and the 64MB storage capacity of the disks, and \"DD\" is short for \"disk drive\" or \"dynamic drive\".\n\nPlugging into the extension port on the underside of the console, the 64DD allows the Nintendo 64 to use proprietary 64MB magnetic disks for expanded and rewritable data storage, a real-time clock for persistent game world design, and a standard font and audio library for further storage efficiency. Its games and hardware accessories let the user create movies, characters, and animations to use within various other games and to be shared online. The system could connect to the Internet through a dedicated online service, Randnet, for e-commerce, online gaming, and media sharing.", "url": "https://www.igdb.com/platforms/nintendo-64dd/version/initial-version", "checksum": "401ff879-d203-c235-1c1a-ee8d5cac8c40"}, {"id": 557, "companies": [653], "name": "Initial version", "platform_logo": 693, "platform_version_release_dates": [663], "slug": "initial-version", "summary": "Palm OS is a discontinued mobile operating system initially developed by Palm, Inc., for personal digital assistants (PDAs) in 1996. Palm OS was designed for ease of use with a touchscreen-based graphical user interface. It is provided with a suite of basic applications for personal information management. Later versions of the OS have been extended to support smartphones.", "url": "https://www.igdb.com/platforms/palm-os/version/initial-version", "checksum": "0072e4bb-3b1a-776a-bc5d-e78c11d55f53"}, {"id": 588, "companies": [685], "connectivity": "microUSB", "cpu": "8-bit ATMega32u4", "media": "digital distribution", "memory": "2.5 KB", "name": "Initial version", "output": "1.3 inch 128x64px 1-bit OLED display", "platform_logo": 726, "platform_version_release_dates": [671], "resolutions": "128x64", "slug": "initial-version", "sound": "Stereo piezoelectric speakers", "storage": "32 KB flash, 1 KB EEPROM", "summary": "The Arduboy is a handheld game console with open source software, based on the Arduino hardware platform. The original version of the Arduboy was 0.063 in thick, with the height and width of a credit card, and was initially designed by Kevin Bates as an electronic business card. A consumer version came later and was funded through a Kickstarter crowdfunding campaign.", "url": "https://www.igdb.com/platforms/arduboy/version/initial-version", "checksum": "a0a8f7b4-7409-90f0-d226-4d8dea8da887"}, {"id": 589, "companies": [686], "cpu": "Sunplus SPG2xx", "media": "ROM cartridges", "name": "Initial version", "output": "Composite video", "platform_logo": 727, "platform_version_release_dates": [672], "resolutions": "320x240", "slug": "initial-version", "sound": "Mono/stereo sound through RCA", "summary": "The V.Smile was a sixth-generation educational home video game console manufactured and released by VTech. Titles are available on ROM cartridges called \"Smartridges\", to play off the system's educational nature. The graphics are primarily sprite-based. The console is often sold bundled with a particular game, with most of them having a game called Alphabet Park Adventure. Several variants of the V.Smile console are sold including handheld versions, or models with added functionality such as touch tablet integrated controllers or microphones. The V-Motion is a major variant with its own software lineup that includes motion sensitive controllers, and has Smartridges designed to take advantage of motion-related \"active learning\". The V-Motion and Smartridges however, are fully backwards compatible with other V.Smile variants and V.Smile Smartridges, and a V-Motion Smartridge can also be played on V.Smile console or handheld, albeit with limited functionality. However, in 2010, the new and old models of the V.Smile were discontinued. VTech still made games for the V.Smile until 2012.", "url": "https://www.igdb.com/platforms/vsmile/version/initial-version", "checksum": "5d030537-4f65-4228-9fc5-7d93435b1d57"}, {"id": 591, "companies": [695], "connectivity": "Infrared, memory card slot connector", "cpu": "ARM7T (32 bit RISC processor)", "memory": "2KB SRAM", "name": "Initial version", "output": "Monochrome LCD", "platform_logo": 732, "platform_version_release_dates": [677], "resolutions": "32x32 dots", "slug": "initial-version", "sound": "1 miniature speaker (10-bit PCM)", "storage": "128KB Flash RAM", "summary": "The PocketStation is a Memory Card peripheral by Sony Computer Entertainment for the PlayStation home video game console. Categorized by Sony as a combination of a Memory Card and a miniature personal digital assistant, the device features a monochrome liquid crystal display (LCD), infrared communication capability, a real-time clock, built-in flash memory, and sound capability. To use the device's memory card functionality, it must be connected to a PlayStation through a memory card slot.\n\nSoftware for the PocketStation was typically distributed as extras for PlayStation games, included in the CD-ROM, enhancing the games with added features. Stand-alone software could also be downloaded through the PlayStation console. The software is then transferred to the PocketStation for use. A built-in infrared data interface allows direct transfer of data such as game saves between PocketStation units, as well as multiplayer gaming.", "url": "https://www.igdb.com/platforms/pocketstation/version/initial-version", "checksum": "5886b97c-bf4f-d0fc-da1b-f4b2ee9436ef"}, {"id": 590, "companies": [700], "connectivity": "Multi-purpose connector for linking to Dreamcast controller and other VMUs", "cpu": "8-bit Sanyo LC8670", "memory": "28KB Flash Memory", "name": "Initial Version", "output": "1.46 in × 1.02 in LCD", "platform_logo": 728, "platform_version_release_dates": [673, 674, 675, 676], "resolutions": "48x32 dots", "slug": "initial-version", "sound": "1-channel PWM sound source", "storage": "100KB Flash Memory", "summary": "The Visual Memory Unit is the primary memory card produced by Sega for the Dreamcast home video game console. The device features a monochrome liquid crystal display (LCD), multiplayer gaming capability (via connectors at the top), second screen functionality, a real-time clock, file manager, built-in flash memory, and sound capability.\n\nWhile its most basic function is as a removable storage device, the VMU may also serve as an auxiliary display during normal gameplay and, through the use of additional software (distributed as extras on Dreamcast GD-ROMs), acts as a handheld game console. Console-like features of the VMU include a screen, speaker, proper directional pad, four action buttons, the ability to connect and interact with other VMUs, and the ability to download additional games.", "url": "https://www.igdb.com/platforms/visual-memory-unit-slash-visual-memory-system/version/initial-version", "checksum": "9ef9d863-de01-081e-dd66-0b71b1eb9b0c"}, {"id": 507, "name": "Oculus Quest 2", "slug": "oculus-quest-2", "url": "https://www.igdb.com/platforms/meta-quest-2/version/oculus-quest-2", "checksum": "0c4a02ff-05ca-1fd7-df89-8b7bbd6ec95f"}, {"id": 512, "name": "Initial version", "platform_logo": 738, "platform_version_release_dates": [678], "slug": "initial-version", "url": "https://www.igdb.com/platforms/playstation-vr2/version/initial-version", "checksum": "dcea298a-4332-d039-bb85-277ef28ad8df"}, {"id": 493, "name": "Initial version", "platform_logo": 744, "slug": "initial-version", "url": "https://www.igdb.com/platforms/epoch-cassette-vision/version/initial-version", "checksum": "613716b8-e0ce-8029-2321-05c74ab06eb0"}, {"id": 494, "name": "Initial version", "platform_logo": 743, "slug": "initial-version", "url": "https://www.igdb.com/platforms/epoch-super-cassette-vision/version/initial-version", "checksum": "6375c684-1ac9-370f-6353-bf593cb1903e"}, {"id": 499, "name": "Initial version", "platform_logo": 742, "slug": "initial-version", "url": "https://www.igdb.com/platforms/casio-loopy/version/initial-version", "checksum": "c216b32a-3da9-9bba-e2c7-eb750bd9fceb"}, {"id": 357, "connectivity": "1 SD card slot, 3 USB ports", "cpu": "ARM 11 528Mhz", "graphics": "Qualcomm Adreno 130", "memory": "160 MB DDR SDRAM", "name": "Initial version", "online": "ZeeboNet 3G made by Claro (Brazil) and Telnet (Mexico)", "os": "BREW 4.0.2", "output": "Composite video", "platform_logo": 429, "platform_version_release_dates": [441, 682], "resolutions": "640x480", "slug": "initial-version", "sound": "MP3, MIDI, PCM, ADPCM, CMX", "storage": "1GB", "summary": "Zeebo is a 3G-enabled entertainment and education system from Zeebo Inc. It enables users to play video games, and also connect to the Internet, communicate online and run educational applications.", "url": "https://www.igdb.com/platforms/zeebo/version/initial-version", "checksum": "57e558b7-e3af-473f-9196-0602f27bd1f7"}, {"id": 491, "companies": [707], "cpu": "Z80 3.25 Mhz", "memory": "1KB", "name": "Initial version", "online": "None", "os": "Sinclair Basic", "platform_logo": 603, "platform_version_release_dates": [611], "resolutions": "256x192 pixels", "slug": "initial-version", "sound": "None", "storage": "External Compact Cassette", "summary": "The ZX81 is designed to be a low-cost introduction to home computing for the general public. More than 1.5 million units were sold.\n\nThe ZX81 is equiped with 1KB memory, the operating system is driven by a Basic variant called Sinclair Basic. Programs or data can be stored on compact cassette's by connecting them to an audio output of the ZX81 (EAR).\n\nThe ZX81 has an Rf output to be connected to a TV and produces no sound.\n\nExpansion modules exist like a 16KB memory expansion modules and a printer. Also many other thirth party expansion modules are developed, like better keyboard, printers and others.\n\nMost commercial software like games or tools were written for use with a 16K expansion module.\n\nThe ZX81 is known as the Timex 1000 on the US market.", "url": "https://www.igdb.com/platforms/sinclair-zx81/version/initial-version", "checksum": "29901e60-0a5c-d677-5639-f80c97a3738a"}, {"id": 593, "name": "Meta Quest 2", "platform_logo": 756, "platform_version_release_dates": [688], "slug": "meta-quest-2", "summary": "Meta Quest 2 is a virtual reality headset developed by Meta Platforms.", "url": "https://www.igdb.com/platforms/meta-quest-2/version/meta-quest-2", "checksum": "862084ba-a389-f34a-c50f-1d371b0c60e9"}, {"id": 594, "companies": [710], "connectivity": "Built-in WiFi", "cpu": "1.5Ghz Processor", "graphics": "4.3” IPS Screen", "media": "Cartridges", "memory": "4GB Built-in Memory", "name": "Evercade EXP", "output": "720p Mini-HDMI, 3.5mm Headphone Jack", "platform_logo": 754, "platform_version_release_dates": [686], "resolutions": "800x480, 480x800 (TATE Mode)", "slug": "evercade-exp", "sound": "Stereo Speakers", "summary": "The Evercade EXP features 18 built-in games from Capcom and the new TATE mode.\nThe Capcom games included are 1942, 1943, 1944: The Loop Master, Bionic Commando, Captain Commando, Commando, Final Fight, Forgotten Worlds, Ghouls ‘n Ghosts, Legendary Wings, MERCS, Street Fighter II’: Hyper Fighting, Strider, Vulgus, Mega Man, Mega Man 2, Mega Man X and Breath of Fire.\n\nThe Evercade EXP features a high resolution IPS screen for greater viewing angles and better quality, built-in WiFi for easy updates and the brand new TATE mode, that allows for seamless and comfortable vertical gaming using dedicated buttons.", "url": "https://www.igdb.com/platforms/evercade/version/evercade-exp", "checksum": "ae8614c5-b113-917c-4ea0-c392c9bf2f95"}, {"id": 505, "companies": [611], "name": "Initial version", "platform_logo": 619, "slug": "initial-version", "summary": "The Oculus Quest is the first iteration of the brand of standalone virtual reality headsets sold by Facebook (now named Meta) and developed by Oculus (now merged into the Meta company). It was released on May 21st 2019.", "url": "https://www.igdb.com/platforms/oculus-quest/version/initial-version", "checksum": "4143fa0e-3172-658e-a049-dbda91175aca"}, {"id": 595, "cpu": "MOS 6510", "graphics": "VIC-II", "memory": "64KB", "name": "Commodore 64C", "os": "Commodore 64 BASIC V2", "platform_logo": 759, "platform_version_release_dates": [691], "slug": "commodore-64c", "sound": "SID: MOS 8580", "summary": "The C64's designers intended the computer to have a new, wedge-shaped case within a year of release, but the change did not occur. In 1986, Commodore released the 64C computer, which is functionally identical to the original. The exterior design was remodeled in the sleeker style of the Commodore 128. The 64C uses new versions of the SID, VIC-II, and I/O chips being deployed. Models with the C64E board had the graphic symbols printed on the top of the keys, instead of the normal location on the front. The sound chip (SID) was changed to use the MOS 8580 chip, with the core voltage reduced from 12V to 9V. The most significant changes include different behavior in the filters and in the volume control, which result in some music/sound effects sounding differently than intended, and in digitally-sampled audio being almost inaudible, respectively (though both of these can mostly be corrected-for in software). The 64 KB RAM memory went from eight chips to two chips. BASIC and the KERNAL went from two separate chips into one 16 KB ROM chip. The PLA chip and some TTL chips were integrated into a DIL 64-pin chip. The \"252535-01\" PLA integrated the color RAM as well into the same chip. The smaller physical space made it impossible to put in some internal expansions like a floppy-speeder. In the United States, the 64C was often bundled with the third-party GEOS graphical user interface (GUI)-based operating system, as well as the software needed to access Quantum Link. The 1541 drive received a matching face-lift, resulting in the 1541C. Later, a smaller, sleeker 1541-II model was introduced, along with the 800 KB 3.5-inch microfloppy 1581.", "url": "https://www.igdb.com/platforms/c64/version/commodore-64c", "checksum": "6d508a26-012d-8f27-c1d1-3928b5ea1047"}, {"id": 19, "cpu": "Motorola 68000 @ 7.16 MHz (NTSC) 7.09 MHz (PAL)", "media": "880 kB floppy disks", "memory": "512 kB (9 MB maximum)", "name": "Amiga A 500", "os": "AmigaOS v1.2 - 1.3", "platform_logo": 391, "platform_version_release_dates": [134], "resolutions": "736x567i 4-bpp PAL (736x483i 4 bpp NTSC), 368x567i 6 bpp PAL (368x483i 6 bpp NTSC)", "slug": "amiga-a-500", "sound": "4× 8-bit channels PCM at max 28 kHz with 6-bit volume in stereo", "summary": "In 1982, the Amiga Corporation developed \"Lorraine\" a computer that was named after the wife of the company's president. Amiga incorporated a 16-bit 68000 chip as Lorraine's CPU. Lorraine featured two dedicated graphics and sound chips.\n\nBy the time Lorraine was introduced at the Consumer Electronics Show on January 4, 1984, the developmental costs that Amiga had devoted to it had exceeded its resources. After Atari showed interest in purchasing the company, Commodore stepped in to outbid the console giant and renamed the system the Amiga.\n\nCommodore made some slight modifications to the Amiga. The system's memory was upgraded to 256KB and the console was redesigned to accommodate keyboard storage underneath it. Commodore finally released the Amiga 1000 in July 1985 at a retail price of $1,295. It was compatible with home television sets and could be utilized for video editing. It featured a palette of 4,096 colors and was capable of 320 x 200 resolution. The system also featured a 3.5 inch floppy disk drive that could externally store up to 880KB.\n\nThe \"Paula\" sound chip enabled programs to be heard in stereo. The system featured two mouse/controller ports. Such peripherals as joysticks, light pens or game paddles could be used with the system. Even in its early stages of release, Commodore chose to promote the Amiga as a game machine.\n\nThe \"kickstart\" was a small part of the operating system that was contained in the ROM. The Amiga performed a kickstart or initiated the loading of the operating system itself every time the computer was activated. To fully load the operating system a 3.5 inch AmigaDos disk needed to be inserted into the external drive. Every time the computer was shut off, the operating system was lost from memory and needed to be reloaded.\n\nThe Amiga 1000 was capable of \"multitasking.\" A concept similar to Windows 95, multitasking allowed users to keep two or more programs open at one time and instantly switch between them. The \"Workbench\" was the Amiga's file manager. Workbench allowed users to open windows and run programs.\n\nIn 1987, Commodore released the Amiga 500 and the Amiga 2000. The Amiga 500 was a compact system that became the best selling computer in the Amiga line. Among the improvements Commodore incorporated into the Amiga 500 were an updated operating system (AmigaDOS 1.2), 512KB RAM and a bigger keyboard. The Amiga 2000 featured a new computer case design, expansion slots and a CPU slot for future processor upgrades. It was powered by a 68000 microprocessor.\n\nThe Amiga 3000 improved on the Amiga 2000 by offering new Zorro III expansion slots, an integrated SCSI interface and a built-in hard drive. It used a 68030 32-bit microprocessor and a new version of Workbench.\n\nIn 1992 Commodore released the Amiga 600. Commodore promoted the system as a video game console with a keyboard. It quickly vanished from store shelves. Later that year Commodore released the Amiga 4000 and the Amiga 1200. The 4000 featured the speedy 68040 processor. It could display up to 256,000 colors on-screen at once. The 1200 was a compact system that combined the CPU, keyboard and disk drive into a single unit. It was similar in design to the Amiga 500. It utilized the 68020 processor and could run at 14.28MHz.\n\nIn October 1993 Commodore introduced the Amiga CD 32. This 32-bit CD-ROM based add-on featured a palette of 17 million colors. It retailed for $400 and had a built-in catalog of software because it was compatible with game titles for the failed Commodore CDTV multimedia system. Timing for the CD 32's release was not perfect. Several other CD-ROM based gaming consoles, like the 3DO and Sega CD, were released at the same time and flooded the market. The Amiga CD 32 system never gained a following.\n\nUnfortunately, software developers rarely released programs that displayed the full potential of the Amiga's impressive graphics. The system was much more technologically advanced than its competitors. Ultimately the Amiga was viewed as an expensive gaming console, and as software support dwindled, so did sales. On April 29, 1994 Commodore announced that it was in the process of closing the company.", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-500", "checksum": "9cf35e31-01b1-da5e-22be-7baa27c8fe9e"}, {"id": 109, "cpu": "Motorola 68000", "memory": "1MB", "name": "Amiga A 600", "os": "AmigaOS 2.0", "platform_version_release_dates": [238], "slug": "amiga-a-600", "storage": "20MB 2.5\" Disk Drive", "summary": "Codenamed \"June Bug\" this was the successor to Amiga's A500 model.", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-600", "checksum": "c01a9580-5eb1-35c4-18e4-a9b360e62e91"}, {"id": 110, "name": "Amiga A 1000", "platform_logo": 735, "slug": "amiga-a-1000", "summary": "The Commodore Amiga 1000, also known as the A1000, is the first personal computer released by Commodore International in the Amiga line. It combines the 16/32-bit Motorola 68000 CPU which was powerful by 1985 standards with one of the most advanced graphics and sound systems in its class. It runs a preemptive multitasking operating system that fits into 256 KB of read-only memory and was shipped with 256 KB of RAM. The primary memory can be expanded internally with a manufacturer-supplied 256 KB module for a total of 512 KB of RAM. Using the external slot the primary memory can be expanded up to 8.5 MB.", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-1000", "checksum": "33501d04-bcc2-4d7d-179b-3f28f7817b3c"}, {"id": 112, "name": "Amiga A 3000", "slug": "amiga-a-3000", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-3000", "checksum": "ee1d8d93-a2e8-04b8-0fba-6d979becd9f6"}, {"id": 113, "name": "Amiga A 3000T", "slug": "amiga-a-3000t", "url": "https://www.igdb.com/platforms/amiga/version/amiga-a-3000t", "checksum": "0f6dcf18-4206-a220-07ac-ed1aa7ce89cd"}, {"id": 151, "companies": [729], "name": "El Capitan", "platform_logo": 764, "platform_version_release_dates": [695], "slug": "el-capitan", "summary": "OS X El Capitan (version 10.11) is the twelfth major release of macOS (named OS X at the time of El Capitan's release), Apple Inc.'s desktop and server operating system for Macintosh. It focuses mainly on performance, stability, and security. Following the California location-based naming scheme introduced with OS X Mavericks, El Capitan was named after a rock formation in Yosemite National Park. El Capitan is the final version to be released under the name OS X. OS X El Capitan received far better reviews than Yosemite.", "url": "https://www.igdb.com/platforms/mac/version/el-capitan", "checksum": "34b93613-562e-833c-ea67-a03c11c56fb6"}, {"id": 598, "companies": [726], "name": "Ventura", "platform_logo": 761, "platform_version_release_dates": [692], "slug": "ventura", "summary": "macOS Ventura (version 13) is the nineteenth major release of macOS, Apple's desktop operating system for Mac computers. The successor to macOS Monterey, it was announced at WWDC 2022 on June 6, 2022, and launched on October 24, 2022. It is named after the city of Ventura and is the tenth macOS release to bear a name from the company's home state of California. The macOS 13 Ventura logo and default wallpaper resemble an abstract California poppy.", "url": "https://www.igdb.com/platforms/mac/version/ventura", "checksum": "aa03037e-d1f1-2710-9010-b86f94455058"}, {"id": 600, "name": "Monterey", "platform_logo": 765, "slug": "monterey", "summary": "macOS Monterey (version 12.0) is the eighteenth major release of macOS, Apple's desktop operating system for Macintosh computers, released on October 25, 2021.", "url": "https://www.igdb.com/platforms/mac/version/monterey", "checksum": "784961cd-2292-ec8b-3218-59413c60b5e2"}, {"id": 599, "companies": [730], "name": "Big Sur", "platform_logo": 766, "platform_version_release_dates": [694], "slug": "big-sur", "summary": "macOS \"Big Sur\" (version 11.0) is the seventeenth major release of macOS, the operating system of Apple Inc. for Macintosh computers released November 12, 2020. This release was the first version to include support for the Apple M processor with ARM64 hardware architecture.", "url": "https://www.igdb.com/platforms/mac/version/big-sur", "checksum": "923d8566-fc32-f267-84a5-2fe7964d8cab"}, {"id": 77, "companies": [731], "connectivity": "10/100BASE-TX wired Ethernet", "cpu": "Custom 733 MHz Intel Pentium III ''Coppermine-based''", "graphics": "233 Mhz nVidia NV2A", "media": "DVD", "memory": "64 MB DDR SDRAM @ 200 MHz", "name": "Initial version", "online": "Xbox Live", "os": "Custom (Based on Windows NT architecture and Windows XP)", "output": "composite video, S-Video, component video, HDMI (via 3rd party), SCART, Digital Optical TOSLINK, and stereo RCA analog audio", "platform_logo": 266, "platform_version_release_dates": [30, 31, 32], "resolutions": "480i, 480p, 576i, 576p, 720p, 1080i", "slug": "initial-version-6ac4b90f-0745-458f-866d-3672aa6ed5eb", "sound": "NVIDIA \"MCPX\"", "storage": "8 to 10 GB Internal Storage", "summary": "The Xbox is a home video game console and the first installment in the Xbox series of consoles manufactured by Microsoft. It was released on November 15, 2001, in North America, followed by Australia and Europe in 2002. It was Microsoft's first foray into the gaming console market. The sixth-generation console competed with Sony's PlayStation 2, Sega's Dreamcast, and the Nintendo GameCube. It was the first console produced by an American company since the Atari Jaguar ceased production in 1996.\n\nIn November 2002, Microsoft launched Xbox Live, a fee-based online gaming service that enabled subscribers to download new content and connect with other players through a broadband connection. Unlike other online services from Sega and Sony, Xbox Live had support in the original console design through an integrated Ethernet port. The service gave Microsoft an early foothold in online gaming and would help the Xbox become a relevant competitor to other sixth-generation consoles.\n\nXbox's successor, the Xbox 360, was launched in November 2005. The Xbox was soon discontinued beginning with Microsoft's worst-performing market, Japan, in 2005. Other countries would follow suit in 2006. The last Xbox game in Europe was Xiaolin Showdown released in June 2007, and the last game in North America was Madden NFL 09 released in August 2008. Support for out-of-warranty Xbox consoles was discontinued on March 2, 2009. Support for Xbox Live on the console ended on April 15, 2010.\n\nXbox launched in North America and quickly sold out. Its launch in that region was successful, selling 1.53 million units three months after launch, which is higher than its successor Xbox 360, as well as the GameCube, PlayStation 3, Wii U, and even the PlayStation 2 and Wii.\n\nThe Xbox has sold 24 million units worldwide as of May 10, 2006, according to Microsoft. This is divided out to 16 million units sold in North America, six million units in Europe, and just two million units sold in Asia, Australia, and New Zealand.\n\nThe Xbox was almost always behind the PlayStation 2 in terms of sales, although in April 2004, the Xbox outsold the PS2 in the U.S. Despite lagging far behind the PlayStation 2's sales, the Xbox was overall a success (especially in North America), keeping a steady second place in the generation sales.\n\nThe popularity of the Xbox, as well as (in the United States) its comparatively short 90-day warranty, inspired efforts to circumvent the built-in hardware and software security mechanisms, a practice informally known as modding.", "url": "https://www.igdb.com/platforms/xbox/version/initial-version-6ac4b90f-0745-458f-866d-3672aa6ed5eb", "checksum": "152eca17-a449-c754-8e1c-93035b201557"}, {"id": 83, "connectivity": "Ethernet", "cpu": "3,2 GHz PowerPC Tri-Core ''Xenon''", "graphics": "ATI ''Xenos'' @ 500 MHz", "media": "DVD, Compact Dics, Digital Download", "memory": "512 MB GDDR3 @ 700 MHz", "name": "Xbox 360 Original", "online": "Xbox Live", "os": "Modified version of Windows 2000", "output": "component video, VGA, HDMI", "platform_logo": 249, "platform_version_release_dates": [52, 53, 54], "resolutions": "480i, 480p, 576i, 720p, 1080i, 1080p", "slug": "xbox-360-original", "sound": "Analog Stereo, Dolby Digital 5,1", "storage": "20 GB, 60 GB, 120 GB, 250 GB", "url": "https://www.igdb.com/platforms/xbox360/version/xbox-360-original", "checksum": "18244f50-c78e-2959-8cf0-b6ea068e0419"}, {"id": 197, "cpu": "8-bit Signetics 2650AI at 4.43 MHz", "graphics": "Signetics 2636N at 3.58 MHz, addressing 32Kb of memory in 8Kb banks", "media": "2-8 KByte ROM Cartridges", "memory": "43 bytes, optional 1k RAM", "name": "Audiosonic PP-1292 Advanced Programmable Video System", "output": "RF", "platform_logo": 135, "platform_version_release_dates": [697], "resolutions": "208x108", "slug": "audiosonic-pp-1292-advanced-programmable-video-system", "sound": "Single Channel (beep)", "summary": "The 1292 Advanced Programmable Video System is a home video game console released by European company Audiosonic in 1978. It is part of a group of software-compatible consoles which include the Interton VC-4000 and the Voltmace Database.\nBoth, the VC 4000 and the 1292 APVS, are built around the Signetics 2650 microprocessor, which was released in late 1975. That was around the same time when Philips had bought the Signetics company and shipped the technology over to Europe. At that time Philips' subsidary Magnavox was developing a system based on the arguably more powerful Intel 8048 microprocessor - that system would later become known as the G7000 (or Odyssey² in the USA). Having one hardware product already in development, Philips decided to treat the Signetics 2650 as commercial product, targeting small-sized electronic-manufacturers, who were already swarming the market with PONG-clones.\nMore evidence to support this hypothesis is provided by a Swedish TV broadcast from April 1979, when a team from SVT (Swedish broadcast company) visited the Philips-reasearch-centre in Eindhoven, Netherlands to talk about the future of video games. Throught the video the developers are seen with VC 4000 controllers, testing game prototypes which graphicly correspond with games on the VC 4000/1292 APVS and not Philips' own home console, the Videopac G7000.\nThe misconception that the 1292 APVS was released already in 1976 is probably owed to the - by now viral - misinformation that Radofin (the most prominent 1292 APVS manufacturer) released its first cosoles in 1976. These, however, were no microprocessored early wonder-machines, but plain PONG-clones.", "url": "https://www.igdb.com/platforms/1292-advanced-programmable-video-system/version/audiosonic-pp-1292-advanced-programmable-video-system", "checksum": "b0ca6137-2eb6-6817-2676-0749fce2785e"}, {"id": 213, "name": "Acetronic MPU-1000", "platform_logo": 136, "platform_version_release_dates": [696], "slug": "acetronic-mpu-1000", "summary": "The Acetronic MPU-1000 Home Video Entertainment Center was a second-generation video game console introduced in the UK in 1979.\n\nThe console is a member of the 1292 Advanced Programmable Video System family, all of which are software compatible, but some of which use different shape or size cartridges. Cartridges for the Acetronic system would also work in the Prinztronic and Radofin consoles in the family.\n\nThere were two controllers composed of a 12 keys keypad, two red fire buttons and an analogue joystick. The control panel has the same buttons found on all systems of the 1292 Advanced Programmable Video System family: Start, Load Programme, Game Select and on/off switch.\n\nThere was also an Acetronic MPU-2000, which had a slightly different case design and built-in power supply.\n\nAt least 33 cartridges were released for the Acetronic system.", "url": "https://www.igdb.com/platforms/1292-advanced-programmable-video-system/version/acetronic-mpu-1000", "checksum": "50c8264a-7203-3a5b-9b23-a4c98b036ca3"}, {"id": 154, "connectivity": "Econet, Ethernet", "cpu": "ARM", "graphics": "VIDC1", "media": "CD-ROM", "memory": "512 KB–16 MB", "name": "Initial version", "os": "Arthur, RISC OS, RISC iX", "platform_logo": 388, "platform_version_release_dates": [555, 556], "resolutions": "1280x976, 1152x864, 1056x256, 800x600, 640x512, 640x480, 640x256, 320x256, 160x256", "slug": "initial-version", "sound": "VIDC1 8 channels, 8-bit, stereo", "storage": "Hard drive", "summary": "Acorn Archimedes is a family of personal computers designed by Acorn Computers of Cambridge, England. The systems are based on Acorn's own ARM architecture processors and the proprietary operating systems Arthur and RISC OS. The first models were introduced in 1987, and systems in the Archimedes family were sold until the mid-1990s.", "url": "https://www.igdb.com/platforms/acorn-archimedes/version/initial-version", "checksum": "be4c724a-38d6-c25c-04a3-36ce350d63d2"}, {"id": 18, "companies": [736], "cpu": "32-bit RISC CPU @ 12.5 MHz (ARM60)", "graphics": "Dual pixel engine (CEL engine), 1 MB VRAM", "media": "CD-Rom", "memory": "2 MB RAM", "name": "Initial version", "os": "32-bit operating system", "output": "Composite RCA, S-Video, RF", "platform_logo": 282, "platform_version_release_dates": [117, 118, 698, 699], "resolutions": "640×480 (interpolated), 320×240 (actual) 60 Hz for NTSC version, and 768×576 (interpolated), 384×288 (actual) 50 Hz for PAL version", "slug": "initial-version", "sound": "16-bit stereo, 44.1kHz", "storage": "32 KB SRAM", "summary": "The 3DO Interactive Multiplayer, also referred to as simply 3DO, is a home video game console developed by The 3DO Company. Conceived by entrepreneur and Electronic Arts founder Trip Hawkins, the 3DO was not a console manufactured by the company itself, but a set of specifications, originally designed by Dave Needle and Robert J. Mical of New Technologies Group, that could be licensed by third parties. Panasonic produced the first models in 1993, and further renditions of the hardware were released in 1994 by GoldStar (now LG Electronics), and in 1995 by Sanyo.\n\nDespite having a highly promoted launch (including being named Time magazine's \"1993 Product of the Year\"), the console received mixed to negative reviews, and an oversaturated console market prevented the system from achieving success comparable to competing consoles from Sega and Sony. By 1996 3DO saw no market in places like NA and the EU. By mid-1997, The 3DO Opera hardware was sold to Samsung.", "url": "https://www.igdb.com/platforms/3do/version/initial-version", "checksum": "9c9b71c2-07cb-5ccf-7e64-c09d3009e464"}, {"id": 621, "companies": [751], "name": "Initial version", "platform_logo": 792, "platform_version_release_dates": [704], "slug": "initial-version", "summary": "The follow up headset to the Meta Quest 2. This headset is slimmer, and sports a new graphics chip claiming double the performance, and also has a higher resolution screen. The Meta Quest 3 has an increased focus on mixed reality, with an improved passthrough view.", "url": "https://www.igdb.com/platforms/meta-quest-3/version/initial-version", "checksum": "9032cc18-4e01-7238-d0a6-723aca647759"}, {"id": 273, "name": "Initial version", "platform_logo": 795, "platform_version_release_dates": [572, 573], "slug": "initial-version", "summary": "On October 8th 2019 Sony officially confirmed the long rumored follow up to the PS4, which will keep the numeral moniker simply as: Playstation 5.\n\nA confirmation for Holiday 2020 was given, alongside preliminary details about the controller. It will feature haptic feedback and adaptive triggers.", "url": "https://www.igdb.com/platforms/ps5/version/initial-version", "checksum": "654ff8f0-fb4d-fa8d-025f-eae6ce5093e9"}]